[
    {
        "comms": "Starc was outstanding, KKR's 'player of the playoffs': Dinesh Karthik",
        "timestamp": "2024-05-27 00:37:04",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Curtains down on the 17th edition of the Indian Premier League. It was fun bringing you all the action of this two-month carnival. We hope you enjoyed it. There's hardly any breathing space as the Men's T20 World Cup commences in less than a week's time. Brace yourselves! For now, this is B0$ signing off on behalf of B1$, B2$ and B3$.",
        "timestamp": "2024-05-27 00:37:04",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Kolkata Knight Riders, on the other hand, were relentless. In fact, that's how they've been playing for a while. Didn't lose a single match this month, finished at the top of the table, beat SRH convincingly in Ahmedabad in Qualifier 1 and gave them a bigger thrashing at Chepauk in the final. Terrific all-round performance throughout the tournament. Four batters with 350+ runs, five bowlers with 17+ wickets. Salt/Gurbaz giving brisk starts at the top, Starc stepping up in the playoffs and the Knight Riders' linchpins - Narine and Russell - being consistent. It wasn't just the overseas players, even the Indian players made vital contributions - Venkatesh Iyer, Varun Chakaravarthy, the uncapped pace duo of Harshit Rana and Vaibhav Arora, Ramandeep's little cameos and his fielding. And, of course, Shreyas Iyer. He came into this competition with a lot of uncertainties but he led KKR to the IPL championship.",
        "timestamp": "2024-05-27 00:36:23",
        "over": "- over",
        "score": null
    },
    {
        "comms": "From wooden spoon holders in the previous season to runners-up this year, Sunrisers Hyderabad can be proud of their campaign under the leadership of Pat Cummins. They smashed batting records left, right and center in the group stages and ironically, it's their batting that let them down on the big night. Both Head and Abhishek getting dismissed for single-digits happened only twice and unfortunately both were against KKR and in the playoffs.",
        "timestamp": "2024-05-27 00:34:41",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Here's the moment, Shreyas collects the coveted trophy from Roger Binny and Jay Shah. The KKR players rush to the centre to pose with the title. The captain lifts the trophy above his head. The fireworks go off and the confetti goes up in the background. All smiles in the KKR camp and they are jumping in joy. Incredible scenes.",
        "timestamp": "2024-05-27 00:29:16",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Absolutely comprehensive. This is what we demanded from the team and every individual. They stood up to the right occasion and the feeling is hard to express. It (wait) was so long, longer than the match. B1$ There's so much to cherish right now. It is pleasing, the performance has been flawless throughout. I am running out of words right now. We have been tremendous from game one, we stepped up today. All we demanded from ourselves was to back each other whatever the situation is. The game could have either way. They have been playing phenomenal cricket  - SRH - throughout the season. We were lucky to bowl first and every situation went in our favour. Thanks to SRH the way they played. Looking forward to play more competitive cricket. (On Starc) That's when all the big players stand up, right! It was a high-pressure game and he's been so good off the field. He's never shown any complacency in his work ethics. He stepped up to the right occasion. He's got that magic wand (on Russell), he's looking forward to pick wickets. When I look at him, I know he can look at me. All the guys stepped up at the right time. Made it easier. It has been a flawless season.",
        "timestamp": "2024-05-27 00:22:23",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Now, it's time for the KKR captain to collect the winners' cheque - INR 20 crores.",
        "timestamp": "2024-05-27 00:21:59",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ They bowled fantastically. Unfortunately, old mate Starcy turned it on again. Not enough tonight, totally outplayed. You hope you get a few boundaries away but they bowled fantastically well, didn't really give us anything. Similar to last week in Ahmedabad where they bowled really well, so full credit. It was a bit of a tricky wicket. If we got 160, it would have felt we were in the game. Didn't feel like a 200+ wicket. Well short, maybe a few extra runs would have given us a chance. So many (positives), the style that the the guys played particularly with the bat. Takes a lot of skill to not only get 250 but also three times. It takes real, you are putting yourself out there a fair bit. I loved how brave the guys were. In high-pressure situations, they took the game on. It was a lot of fun, fans seemed to like it back in Hyderabad. Great season. It was fantastic, hadn't worked with many of the guys before at all. It was a real pleasure to work with some of the older, experienced guys like Bhuvi. Bhuvi, Nattu, Jaydev were great and lots of young talent throughout. Really great squad, the support staff were amazing, had a great couple of months. We play a lot over here in India but it's normally a sea of blue. It's good having the crowd on our side for once. Amazing tournament, gets bigger and better each year. It was amazing this season.",
        "timestamp": "2024-05-27 00:18:00",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Pat Cummins receives the runners-up cheque - INR 12.5 crore and a shield.",
        "timestamp": "2024-05-27 00:17:53",
        "over": "- over",
        "score": null
    },
    {
        "comms": "The match officials receive their medallions.",
        "timestamp": "2024-05-27 00:16:37",
        "over": "- over",
        "score": null
    },
    {
        "comms": "The B0$ goes to the B1$",
        "timestamp": "2024-05-27 00:16:15",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ becomes the first player to win B1$ \\n24 wkts in IPL 2012 (Debut season) \\n357 runs + 17 wkts in IPL 2018 \\n488 runs + 17 wkts in IPL 2024",
        "timestamp": "2024-05-27 00:12:11",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Coming into the ground today, it felt like 2012. The feeling is overwhelming and I couldn't have asked for a better birthday gift. I am enjoying my cricket at the moment - batting, bowling and fielding. What helps is when the team is winning. We have a great bunch of  guys who put out a lot of work throughout the season. The fight they gave throughout the season was very good and it shows how good a team we are. (Batting) Getting the role to just go there and express myself, trying to get the team off to a flier, that's key. The backing of the support staff, especially GG just saying - \"go there and enjoy it, just try to win a few games for the team. I am not asking you to do the entire season, but just a few games.\" That was very good advice. Salty played an incredible season. We missed him but Gurbaz came in and filled that role. Once you have an opening partner with the same intent, it's good for the team and you always get a good start for the team as well. He (Varun Chakaravarthy) is a world-class bowler, he puts in the work. Whatever happens on the field, it's what he does off the field.The whole bowling line-up, we always pick early wickets, so we come to bowl under less pressure. As a total bowling unit, picking up wickets is key and it helped us win the title.",
        "timestamp": "2024-05-27 00:12:11",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Extremely honoured to receive the orange cap for this season. It was a roller-coaster of a ride, I was really pleased with the way I performed for my team throughout the season but more importantly in the latter half where we needed to win every game to qualify. Something that I hope to replicate in the 2025 season of the IPL as well. Thank you everyone for your support.",
        "timestamp": "2024-05-27 00:10:51",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ - 741 runs - is the B1$ winner. Shreyas Iyer collects it.",
        "timestamp": "2024-05-27 00:10:27",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Deeply honoured to be presented with the purple cap. It's been a very rewarding journey. I want to thank everyone who was part of my journey - my team-mates, my coaches and especially my family, my wife and my son. Without their support, it wouldn't have been possible. I look forward to the 2025 season.",
        "timestamp": "2024-05-27 00:09:26",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ - 24 wickets - is the B1$ winner. Bhuvi collects it on his behalf.",
        "timestamp": "2024-05-27 00:08:29",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ win the B1$",
        "timestamp": "2024-05-27 00:07:50",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ wins the B1$ award.",
        "timestamp": "2024-05-27 00:03:12",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Great night for KKR. What a game, what a series, what a season. Probably the two most exciting teams in the final, it was a great night. It was an upward journey from the start of the IPL till now. We've had a fantastic squad of bowlers and batters, our staff have been fantastic to get everyone peaking for the back end of the tournament. We've been such a consistent side, we haven't had one or two people standout, it's been contributions from everyone. Great to contribute personally, but the fact we had everyone contribute throughout has been a big part of the success. We lost the toss and got to use the ball first. Having watched the game a few nights ago here, not really sure what the wicket was going to do. We spoke about adapting to the conditions. Shreyas was fantastic with the way he used his bowlers and his fields, has been all season, so credit to him there. The bowling unit showed all the skills they have, the quicks and the spinners, their ability to adapt to find wicket-taking balls. that's what you need in finals. There's been jokes about the money. It's been a long time since I have played the IPL. I am older and an experienced player now, that's helped with managing all the expectations. I am certainly glad I am a bit more experienced and older to deal with all of that. We've got a fantastic squad of players and staff. It's been a lot of fun. Exciting bowling attack. We've got guys that have been in KKR for a long time. Full credit to the whole squad of players and staff.",
        "timestamp": "2024-05-26 23:58:26",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Starc has justified his big price tag, has silenced his critics: Manoj Tiwary",
        "timestamp": "2024-05-26 23:53:40",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Finally, the presentations are here...",
        "timestamp": "2024-05-26 23:53:40",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cricbuzz Live Hindi: IPL 2024 Final, Kolkata v Hyderabad, Post-match show",
        "timestamp": "2024-05-26 22:31:54",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cricbuzz Live: Final, Kolkata v Hyderabad, Post-match show",
        "timestamp": "2024-05-26 22:26:43",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Bhuvneshwar's street smartness an X factor for SRH: Virender Sehwag ",
        "timestamp": "2024-05-26 21:55:53",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$: \"Credit to the bowling coach of KKR, Bharat Arun, we have talked about only runs and batters this season, but he moulded as well rounded bowling attack this season, as many as 5 of their bowlers have picked 15+ wickets, that's incredible.\"",
        "timestamp": "2024-05-26 21:48:51",
        "over": "- over",
        "score": null
    },
    {
        "comms": "The players are walking out to the middle. SRH need a glut of wickets in the powerplay to put pressure on KKR. Bhuvi has the ball and Gurbaz will face him. Third man and fine-leg back. A wide slip in.",
        "timestamp": "2024-05-26 21:21:27",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Welcome back. Firework display going on at Chepauk right now. Not sure that is going to help with the amount of humidity that is there tonight. Anyway this should be an easy chase for KKR. But cricket and especially in IPL, you can't rule anything out.",
        "timestamp": "2024-05-26 21:21:24",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Very happy, very happy, especially getting three wickets in this game. We all know how important this game is. As big players, we all stood up tonight. Very happy with how I am bowling and very happy with how everyone's bowling. Just being disciplined, bowling to the plans and trying to bowl less bad balls. My fitness is a big part of that but mentally I am in a better space. I was mentally down for the last few years, going through a lot. At the end of the day, we stand firm, back ourselves and back the talent we have. My body is feeling very good, I want to stay this way for another couple of years. We are not going to take it (target) lightly. These guys (SRH) are going to come out and try to defend this total. We have to make sure that we get a good powerplay. If we get 40-50 without loss or even one wicket down, we are on our way. The bowlers set it up very well. We as batters have to get the job done.",
        "timestamp": "2024-05-26 21:20:53",
        "over": "- over",
        "score": null
    },
    {
        "comms": "This is the first instance of no player from a team reaching 30 in an IPL final across 33 innings (the highest being Pat Cummins' 24).",
        "timestamp": "2024-05-26 21:12:25",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Starc 2/14 \\nArora 1/24 \\nHarshit 2/24 \\nNarine 1/16 \\nRussell 3/19 \\nVarun 1/9 \\nOnly the second time six different bowlers have taken a wicket in an IPL final; the first being MI vs CSK at Eden Gardens in 2013.",
        "timestamp": "2024-05-26 21:12:25",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\n96 vs MI Hyderabad 2019 \\n113 vs MI Hyderabad 2015 \\n113 vs KKR Chennai 2024 * \\n114 vs PBKS Dubai 2020",
        "timestamp": "2024-05-26 21:12:25",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\n113 SRH vs KKR Chennai 2024 * \\n125/9 CSK vs MI Kolkata 2013 \\n128/6 RPS vs MI Hyderabad 2017 \\n129/8 MI vs RPS Hyderabad 2017",
        "timestamp": "2024-05-26 21:12:25",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cricbuzz Live Hindi: IPL 2024 Final, Kolkata v Hyderabad, Mid-innings show",
        "timestamp": "2024-05-26 21:12:25",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ What just happened? It will take a while to wrap our heads around this SRH innings. Yes, the surface was difficult and not a belter but surely it was not a 113 kind of pitch. There was swing, bounce and grip - KKR made the most of that by bowling in the right areas and never allowing SRH to get going. Starc once again struck in the first over and this time it was Abhishek who could got an absolute peach. Head managed to avoid Starc but succumbed to Vaibhav in the very next over. SRH's top order woes in the last few games came to the fore again as Tripathi too departed inside the powerplay. KKR didn't relent as they kept picking wickets at regular intervals, Markram and Klaasen got starts but could not convert them. Cummins played a cameo towards the end and got the total past 100. This is looking more like KKR's final to lose at the moment unless SRH come up with a magical bowling performance. Back soon with the chase..",
        "timestamp": "2024-05-26 21:12:25",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Russell to Cummins, B0$ Caught by Starc!! SRH are bowled out for 113. Starc makes amends for his earlier drop. Russell ends with a 3-fer. This was full and pace on, in the slot and hence Cummins was able to get under it, he connects cleanly but does not get the elevation, strikes it flat and straight to long-on, Starc barely had to move to take the catch. B1$ ",
        "timestamp": "2024-05-26 21:12:22",
        "over": "18.3 over",
        "score": null
    },
    {
        "comms": " Russell to Cummins, B0$ Caught!! ",
        "timestamp": "2024-05-26 21:12:19",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Russell to Cummins, no run, I0$ off-pace delivery and Cummins toe-ends the pull to deep mid-wicket. He denies the single ",
        "timestamp": "2024-05-26 21:11:49",
        "over": "18.2 over",
        "score": null
    },
    {
        "comms": "B0$ \\n17 Varun Chakravarthy (KKR) \\n13 Sunil Narine (KKR) \\n12 Andre Russell (KKR) \\n12 Yuzvendra Chahal (RR) \\n12 Kuldeep Yadav (DC)",
        "timestamp": "2024-05-26 21:11:09",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Russell to Cummins, no run, slower ball on the stumps, Cummins swings across the line and misses. He was early into the shot.. ",
        "timestamp": "2024-05-26 21:11:09",
        "over": "18.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 21:11:07",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Bhuvneshwar, no run, short of length delivery, Bhuvneshwar knocks it to a vacant point region and Cummins denies the single ",
        "timestamp": "2024-05-26 21:10:02",
        "over": "17.6 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 21:09:58",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Unadkat, B0$ Lbw!! KKR get the wicket. This was an off-break that turns in sharply, Unadkat leans forward to push it down the ground, gets beaten on the inside edge and struck on the pad, the ball then goes on to hit the off-stump but the bail does not dislodge. Shreyas decides to review for LBW and ball-tracking shows it to be smashing into leg-stump. One way or the other KKR have the wicket. B1$ ",
        "timestamp": "2024-05-26 21:08:31",
        "over": "17.5 over",
        "score": null
    },
    {
        "comms": " Narine to Unadkat, B0$ Lbw!! ",
        "timestamp": "2024-05-26 21:08:29",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ What happened there? The ball hit the stumps and light them up but the bails don't fall. So KKR have decided to review for LBW as the ball touched something before going on to hit the stumps. No bat as per UltraEdge. Ball-tracking shows it to be hitting leg-stump. OUT",
        "timestamp": "2024-05-26 21:06:47",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Cummins, 1 run, short of length carrom ball, Cummins opens the bat face and angles it to point ",
        "timestamp": "2024-05-26 21:06:44",
        "over": "17.4 over",
        "score": null
    },
    {
        "comms": " Narine to Cummins, 1 run, short of length carrom ball, Cummins opens the bat face and angles it to point ",
        "timestamp": "2024-05-26 21:06:44",
        "over": "17.4 over",
        "score": null
    },
    {
        "comms": " Narine to Cummins, 2 runs, fraction short and at the stumps, Cummins shuffles and pulls it behind square on the leg-side, couple more ",
        "timestamp": "2024-05-26 21:06:11",
        "over": "17.3 over",
        "score": null
    },
    {
        "comms": " Narine to Unadkat, 1 run, carrom ball around off, Unadkat goes for the reverse sweep and gloves it fine, Harshit with a diving stop ",
        "timestamp": "2024-05-26 21:05:42",
        "over": "17.2 over",
        "score": null
    },
    {
        "comms": "B0$: \"Unbelievable that the team which made the highest runs in this IPL is going down like this.\"",
        "timestamp": "2024-05-26 21:05:05",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Cummins, 1 run, slower off-break and Cummins nudges it to mid-wicket, Rinku keeps it to a single ",
        "timestamp": "2024-05-26 21:05:05",
        "over": "17.1 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Cummins, 1 run, slower ball outside off, Cummins allows it to arrive and guides it to third man ",
        "timestamp": "2024-05-26 21:04:03",
        "over": "16.6 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Cummins, B0$, fine effort from Russell but he can't prevent the six. Pace on full delivery, the line is outside off and Cummins had the room to free his hands, lofts it to deep extra cover and Russell sprints across from sweeper, gets there with a slide and hangs on, but the momentum takes him over the rope and he can't let go of the ball earlier. Much needed hit for SRH ",
        "timestamp": "2024-05-26 21:03:30",
        "over": "16.5 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Cummins, 2 runs, I0$ short and banged into the surface, Cummins slaps it in front of square and Russell tidies up from sweeper cover. SRH bring up their 100 ",
        "timestamp": "2024-05-26 21:02:26",
        "over": "16.4 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Cummins, no run, I0$ off-cutter and it grips the surface, Cummins once again checks his shot and angles it to point ",
        "timestamp": "2024-05-26 21:01:36",
        "over": "16.3 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Cummins, no run, another off-pace delivery and Cummins checks his push to cover ",
        "timestamp": "2024-05-26 21:00:54",
        "over": "16.2 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Unadkat, 1 run, I0$ slower ball outside off, Unadkat eases it wide of cover ",
        "timestamp": "2024-05-26 21:00:16",
        "over": "16.1 over",
        "score": null
    },
    {
        "comms": "B0$ SRH are in tatters and their goal from here would be to bat out 20 overs. If they can do that and get somewhere around 120-130 then there's at least something for the bowlers to work with. But KKR are looking like they will get the two wickets before that.",
        "timestamp": "2024-05-26 20:56:50",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Unadkat, 1 run, in the air and safe.. Unadkat goes for the reverse sweep and gets it off the top-edge, the ball balloons towards short third man and lands just in front of the fielder ",
        "timestamp": "2024-05-26 20:56:47",
        "over": "15.6 over",
        "score": null
    },
    {
        "comms": " Narine to Cummins, 1 run, B0$ Starc puts down a sitter. He's just given his Aussie mate a life. This was bowled slower and hence Cummins decided to go down town, gets more height than distance and Starc comes around from long-on, goes with both hands but is not able to hang on. That was a simple chance and Starc made a mess of it ",
        "timestamp": "2024-05-26 20:56:22",
        "over": "15.5 over",
        "score": null
    },
    {
        "comms": " Narine to Unadkat, 1 run, carrom ball and Unadkat shapes to play the scoop, gets it off the glove and Shreyas was left wrong-footed, he was moving to his left from slip expecting the ball to go there, but it lobs wide of silly point and drops safely ",
        "timestamp": "2024-05-26 20:55:38",
        "over": "15.4 over",
        "score": null
    },
    {
        "comms": " Narine to Unadkat, no run, off-break and Unadkat does not pick, he prods forward and is beaten on the inside edge, struck on the pad ",
        "timestamp": "2024-05-26 20:55:15",
        "over": "15.3 over",
        "score": null
    },
    {
        "comms": "Slip added",
        "timestamp": "2024-05-26 20:54:42",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Cummins, 1 run, spinning into the pads, Cummins works it backward of square leg ",
        "timestamp": "2024-05-26 20:54:39",
        "over": "15.2 over",
        "score": null
    },
    {
        "comms": " Narine to Cummins, byes, B0$, some bonus runs for SRH. The off-break and it spins a mile, Cummins attempts the reverse sweep and misses it by a long way, Gurbaz does not move down leg to glove it and the ball runs away ",
        "timestamp": "2024-05-26 20:53:57",
        "over": "15.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 20:53:50",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Gautam Gambhir has injected positivity, transformed KKR: Dinesh Karthik",
        "timestamp": "2024-05-26 20:52:52",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\n* Markram holes out to long-on off Russell, OUT for 20 \\n* Shahbaz gets going with a streaky maximum \\n* Varun strikes in his first over, Shahbaz OUT for 8 \\n* Another failure for Samad, edges behind for 4 \\n* Cummins gets going with a boundary past point \\n* Harshit delivers the killer blow, Klaasen OUT for 16 \\n* Unadkat survives a LBW review on 0",
        "timestamp": "2024-05-26 20:52:52",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\n* Markram holes out to long-on off Russell, OUT for 20 \\n* Shahbaz gets going with a streaky maximum \\n* Varun strikes in his first over, Shahbaz OUT for 8 \\n* Another failure for Samad, edges behind for 4 \\n* Cummins gets going with a boundary past point \\n* Harshit delivers the killer blow, Klaasen OUT for 16 \\n* Unadkat survives a LBW review on 0",
        "timestamp": "2024-05-26 20:52:52",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Unadkat, no run, B0$ Short ball outside off, Unadkat looks to pull and is nowhere close to connecting ",
        "timestamp": "2024-05-26 20:52:52",
        "over": "14.6 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Unadkat, no run, fuller now and drawing Unadkat into the drive, he still can't put bat on ball, beaten on the outside edge ",
        "timestamp": "2024-05-26 20:52:04",
        "over": "14.5 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Unadkat, no run, banged in short and gets it to climb sharply, Unadkat has a slash and is beaten on the top-edge ",
        "timestamp": "2024-05-26 20:51:33",
        "over": "14.4 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Unadkat, no run, B0$ Harshit's adrenaline took over there and he got support from Ramandeep. Gurbaz said not to go upstairs but Shreyas went with his bowler's word. Good length ball angled in, Unadkat is beaten on the inside edge and struck on the back pad, the impact was outside leg and the ball was missing leg-stump comfortably ",
        "timestamp": "2024-05-26 20:51:04",
        "over": "14.3 over",
        "score": null
    },
    {
        "comms": "B0$ Shreyas was not interested. But Harshit and Ramandeep from mid-wicket have forced him to send it upstairs. This is a poor one. The impact itself is outside leg-stump. Missing the stumps by a long way. Not Out",
        "timestamp": "2024-05-26 20:49:27",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Unadkat, no run, fullish delivery around off, Unadkat pushes it back to Harshit ",
        "timestamp": "2024-05-26 20:49:24",
        "over": "14.2 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 20:49:22",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, B0$ Bowled!! Dragged on! This is a massive moment in the game. Klaasen was the last recognised batter for SRH and he too is walking back to the dugout. Harshit is off on a celebratory run. Slower ball outside off, Klaasen reaches for the drive but the ball grips a tad, takes the inside edge and crashes into the stumps. KKR are two wickets away from bowling out SRH. B1$ ",
        "timestamp": "2024-05-26 20:47:39",
        "over": "14.1 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, B0$ Bowled!! ",
        "timestamp": "2024-05-26 20:47:35",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 20:47:34",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, no run, carrom ball and Cummins does not pick it, he looks to steer but the ball breaks away to beat the outside edge ",
        "timestamp": "2024-05-26 20:46:29",
        "over": "13.6 over",
        "score": null
    },
    {
        "comms": "B0$ \\n57/7 CSK vs MI Kolkata 2013 \\n77/7 SRH vs KKR Chennai 2024 * \\n79/7 MI vs RPS Hyderabad 2017 \\n92/7 RCB vs CSK Chennai 2011",
        "timestamp": "2024-05-26 20:46:00",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Klaasen, 1 run, flatter and quicker, Klaasen punches it firmly to long-off ",
        "timestamp": "2024-05-26 20:46:00",
        "over": "13.5 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Klaasen, 2 runs, brilliant work by Ramandeep. Short of length delivery, Klaasen makes room and punches it in front of square, Ramandeep runs across from sweeper and dives to make the stop - one-handed pick up and throw ",
        "timestamp": "2024-05-26 20:45:31",
        "over": "13.4 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Klaasen, no run, quicker and drifts in, Klaasen is rooted to the crease and ekes out an inside edge onto the pad ",
        "timestamp": "2024-05-26 20:45:03",
        "over": "13.3 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, byes, 1 run, shuffles a long way across to play the scoop, the ball spins past leg-stump and even Gurbaz does not glove it cleanly ",
        "timestamp": "2024-05-26 20:44:41",
        "over": "13.2 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, B0$, cheeky! Very unlike Cummins but he's come out with intent at least. He shapes to play the paddle but the line is outside off and he adjusts to reverse lap it fine of short third ",
        "timestamp": "2024-05-26 20:43:41",
        "over": "13.1 over",
        "score": null
    },
    {
        "comms": " Russell to Cummins, 1 run, I0$ slower ball around off, Cummins pats it into the off-side and retains strike ",
        "timestamp": "2024-05-26 20:42:17",
        "over": "12.6 over",
        "score": null
    },
    {
        "comms": " Russell to Cummins, B0$, short and outside off, Cummins plays the cut late and hence places it behind square on the off-side. The ball teased the third man fielder before beating him to the fence ",
        "timestamp": "2024-05-26 20:41:37",
        "over": "12.5 over",
        "score": null
    },
    {
        "comms": " Russell to Cummins, B0$, short and outside off, Cummins plays the cut late and hence places it behind square on the off-side. The ball teased the third man fielder before beating him to the fence ",
        "timestamp": "2024-05-26 20:41:37",
        "over": "12.5 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 20:40:23",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Russell to Abdul Samad, B0$ Caught by Gurbaz!! Second wicket for Russell. Excellent catch by Gurbaz. KKR on fire. Russell even does a little jig. The impact sub makes no impact and SRH slip further. Fullish delivery outside off, this ball did not move but Samad played it well away from the body, he reached for it and had a push, the ball flies off the outside edge and Gurbaz dives to his right to take the catch. B1$ ",
        "timestamp": "2024-05-26 20:39:38",
        "over": "12.4 over",
        "score": null
    },
    {
        "comms": " Russell to Abdul Samad, B0$ Caught!! ",
        "timestamp": "2024-05-26 20:39:36",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Russell to Abdul Samad, B0$, slips the slower ball down leg, Samad allows it to pass and collects the wide ",
        "timestamp": "2024-05-26 20:39:06",
        "over": "12.4 over",
        "score": null
    },
    {
        "comms": " Russell to Klaasen, 1 run, I0$ good length ball and Klaasen is rooted to the crease, brings his bat down and bunts it to long-on ",
        "timestamp": "2024-05-26 20:38:38",
        "over": "12.3 over",
        "score": null
    },
    {
        "comms": " Russell to Abdul Samad, 1 run, I0$ good length ball around off, Samad eases it to long-on ",
        "timestamp": "2024-05-26 20:38:04",
        "over": "12.2 over",
        "score": null
    },
    {
        "comms": " Russell to Abdul Samad, 2 runs, I0$ full delivery at the stumps, Samad flicks in front of square and picks up a brace ",
        "timestamp": "2024-05-26 20:37:35",
        "over": "12.1 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Abdul Samad, 1 run, googly that is bowled flatter, Samad stays back and knocks it to sweeper cover ",
        "timestamp": "2024-05-26 20:36:26",
        "over": "11.6 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 20:35:50",
        "over": "- over",
        "score": null
    },
    {
        "comms": "SRH have once again been forced to use their impact sub - Abdul Samad comes in for Travis Head. The Aussie's IPL final is done..",
        "timestamp": "2024-05-26 20:34:21",
        "over": "- over",
        "score": null
    },
    {
        "comms": "61/4 is the lowest total for SRH at the halfway mark of the innings this season.",
        "timestamp": "2024-05-26 20:34:18",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Shahbaz Ahmed, B0$ Caught by Narine!! Another bowler that strikes in his first over - Starc, Vaibhav, Harshit, Russell and now Varun. Full marks for captain Shreyas Iyer for his bowling changes. The sweep is a dangerous shot to play on a pitch that has some bounce, Shahbaz makes that mistake and pays the price. He tries his best to roll his wrist over and keep it down, but the ball balloons to short fine, Narine runs back and takes it as calmly. B1$ ",
        "timestamp": "2024-05-26 20:34:18",
        "over": "11.5 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Shahbaz Ahmed, B0$ Caught!! ",
        "timestamp": "2024-05-26 20:34:15",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Shahbaz Ahmed, no run, wrong 'un and Shahbaz picks it off the surface, stabs it to backward point ",
        "timestamp": "2024-05-26 20:33:43",
        "over": "11.4 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Shahbaz Ahmed, no run, drifts in with the angle, Shahbaz prods forward and defends ",
        "timestamp": "2024-05-26 20:33:10",
        "over": "11.3 over",
        "score": null
    },
    {
        "comms": "Round the wicket to Shahbaz",
        "timestamp": "2024-05-26 20:32:28",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Klaasen, 1 run, googly on the shorter side, Klaasen punches it wide of long-off and settles with a single ",
        "timestamp": "2024-05-26 20:32:25",
        "over": "11.2 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Klaasen, no run, flatter and fraction short, Klaasen cuts and picks out cover ",
        "timestamp": "2024-05-26 20:31:59",
        "over": "11.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 20:31:57",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 20:31:57",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Russell to Shahbaz Ahmed, B0$, streaky! But Shahbaz and SRH won't be complaining. They need a bit of luck to go their way. Well-directed short ball and Shahbaz goes for the pull instinctively, gets a big top-edge and the ball flies over Gurbaz, just clears the rope ",
        "timestamp": "2024-05-26 20:30:50",
        "over": "10.6 over",
        "score": null
    },
    {
        "comms": " Russell to Shahbaz Ahmed, no run, slanted outside off, Shahbaz had the width and he throws his bat, beaten on the outside edge ",
        "timestamp": "2024-05-26 20:30:15",
        "over": "10.5 over",
        "score": null
    },
    {
        "comms": " Russell to Shahbaz Ahmed, no run, bouncer angled across, Shahbaz sways out of the line and allows it to pass ",
        "timestamp": "2024-05-26 20:29:52",
        "over": "10.4 over",
        "score": null
    },
    {
        "comms": " Russell to Shahbaz Ahmed, 2 runs, leg-lined delivery, Shahbaz tucks it square on the leg-side and races back for the second ",
        "timestamp": "2024-05-26 20:29:17",
        "over": "10.3 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 20:29:06",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Russell to Markram, B0$ Caught by Starc!! Russell has done this all season. He has come on and struck almost immediately. This is a massive wicket as SRH's title hopes relied on this pair and he has split them apart. Short of length delivery and bit of extra bounce, Markram goes for the pull but because of the bounce he gets it high on the bat, straight to long-on and Starc makes no mistake. There is some spongy bounce on this wicket and Russell bowled the perfect length for that. B1$",
        "timestamp": "2024-05-26 20:27:43",
        "over": "10.2 over",
        "score": null
    },
    {
        "comms": " Russell to Markram, B0$ Caught!! ",
        "timestamp": "2024-05-26 20:27:40",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Russell to Klaasen, 1 run, back of a length delivery, Klaasen short-arm jabs it through mid-wicket ",
        "timestamp": "2024-05-26 20:27:09",
        "over": "10.1 over",
        "score": null
    },
    {
        "comms": "Cricbuzz Comm Box: Final, KKR v SRH, 1st innings",
        "timestamp": "2024-05-26 20:27:05",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\n- Vaibhav is smashed for 17 runs as SRH end the powerplay well \\n- Harshit strikes in his first over, Nitish nicks off \\n- Narine starts with a tidy over \\n- Harshit's slower balls are gripping the surface \\n- Another quiet over by Narine",
        "timestamp": "2024-05-26 20:27:05",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 20:27:05",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Markram, no run, flighted delivery on off, Markram can't beat backward point with the cut ",
        "timestamp": "2024-05-26 20:25:54",
        "over": "9.6 over",
        "score": null
    },
    {
        "comms": " Narine to Markram, no run, tossed up on off, defended back at the bowler ",
        "timestamp": "2024-05-26 20:25:31",
        "over": "9.5 over",
        "score": null
    },
    {
        "comms": "Narine to Markram, no run, the off-break, grips and turns off the pitch - Markram went back on the flick and missed, clipped the back thigh and dropped beside the stumps",
        "timestamp": "2024-05-26 20:25:12",
        "over": "9.4 over",
        "score": null
    },
    {
        "comms": " Narine to Klaasen, 1 run, tossed up on off, punched off the back-foot to long-on ",
        "timestamp": "2024-05-26 20:24:48",
        "over": "9.3 over",
        "score": null
    },
    {
        "comms": " Narine to Markram, 1 run, dropped short by Narine - Markram backs away and punches it to deep cover for a single ",
        "timestamp": "2024-05-26 20:24:27",
        "over": "9.2 over",
        "score": null
    },
    {
        "comms": " Narine to Klaasen, 1 run, tossed up on off, Klaasen closes the bat-face and works it to long-on ",
        "timestamp": "2024-05-26 20:23:59",
        "over": "9.1 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, 1 run, back of a length and well wide of off, steered away to deep cover for a single ",
        "timestamp": "2024-05-26 20:22:48",
        "over": "8.6 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, no run, another slower off-cutter, Klaasen hangs back and pushes it back at the bowler ",
        "timestamp": "2024-05-26 20:22:02",
        "over": "8.5 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, no run, another slower ball from Harshit, Klaasen pushes it to cover ",
        "timestamp": "2024-05-26 20:21:23",
        "over": "8.4 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, no run, another slower ball from Harshit, Klaasen pushes it to cover ",
        "timestamp": "2024-05-26 20:21:23",
        "over": "8.4 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Markram, 1 run, slower short ball outside off, cut away square on the off-side for a single ",
        "timestamp": "2024-05-26 20:20:44",
        "over": "8.3 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, 1 run, the slower cutter now, pushed into the gap wide of point for a single ",
        "timestamp": "2024-05-26 20:20:00",
        "over": "8.2 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, B0$, B1$, on a good length and just outside off, satys slightly low, so did Klaasen as he pushed forward, gets the edge and runs away through the vacant slip region ",
        "timestamp": "2024-05-26 20:19:22",
        "over": "8.1 over",
        "score": null
    },
    {
        "comms": " Narine to Klaasen, 1 run, fraction short and wide of off, cut away to deep cover for a single ",
        "timestamp": "2024-05-26 20:18:16",
        "over": "7.6 over",
        "score": null
    },
    {
        "comms": "B0$: \"SRH's Birthday Boy Departs and KKR's Birthday Boy Arrives. What a Timing!\"",
        "timestamp": "2024-05-26 20:17:52",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Markram, 1 run, flighted delivery on off, punched square on the off-side for a single ",
        "timestamp": "2024-05-26 20:17:52",
        "over": "7.5 over",
        "score": null
    },
    {
        "comms": " Narine to Markram, no run, flighted delivery on middle, stops onto Markram and forces the miscue, lobbed in the air and dropped wide of the fielder at mid-wicket - a lucky break for Markram ",
        "timestamp": "2024-05-26 20:17:32",
        "over": "7.4 over",
        "score": null
    },
    {
        "comms": " Narine to Klaasen, 1 run, tossed up on middle and leg, nudged down to long-on for a single ",
        "timestamp": "2024-05-26 20:17:08",
        "over": "7.3 over",
        "score": null
    },
    {
        "comms": "B0$ \\n37/2 vs RR Hyderabad  \\n40/3 vs PBKS Mullanpur \\n40/3 vs KKR Chennai * \\n45/4 vs KKR Ahmedabad",
        "timestamp": "2024-05-26 20:16:29",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Mitchell Starc   \\nWorld Cup 2023  \\nGroup stage: 10 wkts in 8 matches  \\nKnockouts: 6 wkts in 2 matches   \\nIPL 2024  \\nGroup stage:  12 wkts in 12 matches  \\nPlayoffs:  5* wkts in 2 matches",
        "timestamp": "2024-05-26 20:16:29",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Markram, 1 run, flighted delivery outside off, Markram stays back and punches it uppishly, to the left of cover for a single ",
        "timestamp": "2024-05-26 20:16:29",
        "over": "7.2 over",
        "score": null
    },
    {
        "comms": " Narine to Markram, no run, dropped short and wide of off, Markram backs away and cuts it to backward point ",
        "timestamp": "2024-05-26 20:16:15",
        "over": "7.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 20:16:14",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 20:16:13",
        "over": "- over",
        "score": null
    },
    {
        "comms": "They've taken the B0$. Assume it'll be Klaasen walking in next, SRH desperately need their two big overseas buys to get them out of trouble. This ain't a 200-run pitch, if there's no dew, anything more then 160 would be definitely competitive",
        "timestamp": "2024-05-26 20:12:21",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Harshit Rana to Nitish Reddy, B0$ Caught by Gurbaz!! Edged and caught! Change of pace has completely undone Nitish here - after three slower ones, Harshit bowls the perfect awayswinger, pitched on off and nips away slightly - Nitish's feet went nowhere, he's waiting on the back-foot for the slower ball to arrive, shapes for the drive and nicks off to the keeper. Second catch of the night for Gurbaz and KKR are firmly on top at the moment. B1$",
        "timestamp": "2024-05-26 20:12:18",
        "over": "6.6 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Nitish Reddy, B0$ Caught!! ",
        "timestamp": "2024-05-26 20:12:17",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Nitish Reddy, no run, on a good length and just outside off - Nitish stays on the back-foot and finds cover with the drive, was the slower ball once again ",
        "timestamp": "2024-05-26 20:11:33",
        "over": "6.5 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Markram, 1 run, another slower ball from Harshit - width on offer and Markram went hard on the cut, mistiming it to the off-side for a single ",
        "timestamp": "2024-05-26 20:11:06",
        "over": "6.4 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Markram, no run, the slower cutter, grips the surface and angles back into the right-hander - Markram is cramped for room and is beaten on the inside edge ",
        "timestamp": "2024-05-26 20:10:15",
        "over": "6.3 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Markram, no run, the slower cutter, grips the surface and angles back into the right-hander - Markram is cramped for room and is beaten on the inside edge ",
        "timestamp": "2024-05-26 20:10:15",
        "over": "6.3 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Markram, B0$, too short and too wide from Harshit, Markram threw his hands on the cut and missed, called as a wide ",
        "timestamp": "2024-05-26 20:09:38",
        "over": "6.3 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Nitish Reddy, 1 run, on a length and just outside off, dabbed down towards third man for a single ",
        "timestamp": "2024-05-26 20:08:57",
        "over": "6.2 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Nitish Reddy, B0$, B1$, a friendly start from Harshit - short and wide of off, Nitish rides the bounce and cracks it square past point for a boundary ",
        "timestamp": "2024-05-26 20:08:16",
        "over": "6.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 20:08:12",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Nitish Reddy, 1 run, fuller length delivery on off, driven to the left of mid-off for a quick single, B0$ ",
        "timestamp": "2024-05-26 20:07:11",
        "over": "5.6 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Nitish Reddy, B0$, B1$, banged in short and down leg, Nitish swivels across, picks the length and then pulls it into the stands at long leg, must give him plenty of confidence ",
        "timestamp": "2024-05-26 20:06:25",
        "over": "5.5 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Nitish Reddy, no run, the slower bouncer from Vaibhav, Nitish watches it closely, drops his hands and lets it go, on the bounce to the keeper ",
        "timestamp": "2024-05-26 20:05:57",
        "over": "5.4 over",
        "score": null
    },
    {
        "comms": "Vaibhav Arora to Markram, 1 run, a direct hit and Markram B0$, despite the big dive - punched it sweetly towards mid-off and set-off for a quick single, the ball bounced nicely into Shreyas's hands, he shies and misses - a direct hit would've sent Markram packing",
        "timestamp": "2024-05-26 20:04:12",
        "over": "5.3 over",
        "score": null
    },
    {
        "comms": "Vaibhav Arora to Markram, B0$, B1$, Vaibhav doesn't learn, bowls one short and wide of off - Markram rides the bounce and then hammers the cut over cover-point, did it hit the cushions on the full? No, it's on the half-volley and it's a four, but back-to-back boundaries for Markram",
        "timestamp": "2024-05-26 20:03:54",
        "over": "5.2 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Markram, B0$, B1$, that'll relieve some pressure off Markram - width on offer, he gets on top of the bounce and then clatters the cut over cover, bounces away to the ropes ",
        "timestamp": "2024-05-26 20:02:10",
        "over": "5.1 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Markram, B0$, loose from Vaibhav, drags the length back, but it's miles wide of off, called by the umpire ",
        "timestamp": "2024-05-26 20:01:35",
        "over": "5.1 over",
        "score": null
    },
    {
        "comms": "Answered: What will be key for SRH or KKR to win IPL 2024?",
        "timestamp": "2024-05-26 20:00:42",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\n- Starc strikes in the first over and knocks over Abhishek \\n- Vaibhav sends Head packing for a golden duck \\n- Couple of fours in Starc's 2nd over to get SRH going \\n- Vaibhav bowls 3 wides in his 2nd over but still goes for just 6 runs \\n- Tripathi runs out of patience and becomes Starc's second wicket",
        "timestamp": "2024-05-26 20:00:42",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Nitish Reddy, no run, on a good length and angling across the right-hander, left alone ",
        "timestamp": "2024-05-26 20:00:42",
        "over": "4.6 over",
        "score": null
    },
    {
        "comms": " Starc to Nitish Reddy, no run, fuller length delivery and well wide of off, Nitish shapes for the drive and is beaten on the outside edge ",
        "timestamp": "2024-05-26 20:00:06",
        "over": "4.5 over",
        "score": null
    },
    {
        "comms": " Starc to Markram, 1 run, on a good length and well wide of off, a punchy drive past cover for a single ",
        "timestamp": "2024-05-26 19:59:31",
        "over": "4.4 over",
        "score": null
    },
    {
        "comms": " Starc to Nitish Reddy, 1 run, back of a length and angling across the right-hander, Nitish makes use of Starc's pace and runs it down to third man ",
        "timestamp": "2024-05-26 19:58:54",
        "over": "4.3 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 19:58:49",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, B0$ Caught by Ramandeep Singh !! A massive leading edge,  high into the night sky - Ramandeep calls for the catch, goes reverse cup and held on with ease. B1$ - wrong choice of shot from Tripathi, was looking to counter Starc, but this was a low percentage shot, on a length and angling across the right-hander - Tripathi was shaping for the whip, but he's played against the angle, closed the face of the bat and the edge went straight up. B2$ ",
        "timestamp": "2024-05-26 19:56:40",
        "over": "4.2 over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, B0$ Caught!! ",
        "timestamp": "2024-05-26 19:56:37",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, B0$ Caught!! ",
        "timestamp": "2024-05-26 19:56:37",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, no run, Starc pushes this one wide of off and gets it to shape away further, a loose waft as Tripathi flays at that and misses ",
        "timestamp": "2024-05-26 19:55:18",
        "over": "4.1 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Markram, no run, short of a good length and shaping back into the right-hander, Markram has no room to free his arms and pushes it back at the bowler ",
        "timestamp": "2024-05-26 19:53:45",
        "over": "3.6 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, 1 run, tight line from Vaibhav - short of a good length and angling into the right-hander, dropped in front of point for a quick single ",
        "timestamp": "2024-05-26 19:53:04",
        "over": "3.5 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, B0$, Vaibhav loses his line and pushes one down the leg-side, called as a wide ",
        "timestamp": "2024-05-26 19:52:31",
        "over": "3.5 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, no run, Vaibhav drags the length back and shortens the length - Tripathi charged down the track, has a slash and is beaten on the inside edge ",
        "timestamp": "2024-05-26 19:51:51",
        "over": "3.4 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Markram, 1 run, fraction fuller and angling into the right-hander, tucked to the left of mid-wicket for a single ",
        "timestamp": "2024-05-26 19:51:18",
        "over": "3.3 over",
        "score": null
    },
    {
        "comms": "B0$ \\n0(1) vs PBKS \\n0(2) vs KKR \\n34(28) vs RR \\n0(1) vs KKR",
        "timestamp": "2024-05-26 19:50:44",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$: \"The first over is the epitome of experience vs inexperience in a big match. The calmness from Starc and the visible nervousness from Abhishek.\"",
        "timestamp": "2024-05-26 19:50:44",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Markram, no run, on a good length and nipping back into the right-hander, Markram gets right behind the line and punches it to mid-off ",
        "timestamp": "2024-05-26 19:50:44",
        "over": "3.2 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, 1 run, tad fuller and just outside off, dropped in front of cover-point and he's off for a quick single ",
        "timestamp": "2024-05-26 19:49:46",
        "over": "3.1 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, B0$, Vaibhav slips one full and down leg, was the attempted cutter which went wrong, called as a wide ",
        "timestamp": "2024-05-26 19:49:23",
        "over": "3.1 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, B0$, on a length and sliding down leg, Tripathi shuffled a long way across on the lap and missed, called as a wide ",
        "timestamp": "2024-05-26 19:48:43",
        "over": "3.1 over",
        "score": null
    },
    {
        "comms": " Starc to Markram, no run, fuller length delivery at the stumps, driven straight to the fielder at mid-on ",
        "timestamp": "2024-05-26 19:47:36",
        "over": "2.6 over",
        "score": null
    },
    {
        "comms": " Starc to Markram, no run, the big inswinger and B0$, full and shaping back into the right-hander, Markram was looking to flick, closed the face of the bat and squeezes an under-edge onto the pad ",
        "timestamp": "2024-05-26 19:46:57",
        "over": "2.5 over",
        "score": null
    },
    {
        "comms": "B0$ \\n250.94 Jake Fraser McGurk (2024) \\n209.29 Travis Head (2024) \\n208.33 Ajinkya Rahane (2023) \\n202.95 Abhishek Sharma (2024) \\n198.59 Sunil Narine (2018)",
        "timestamp": "2024-05-26 19:46:12",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Markram, B0$, edged and four, fuller length delivery and pushed across the right-hander, Markram saw the width and went hard on the drive, gets a thick edge that races away past the lone slip ",
        "timestamp": "2024-05-26 19:46:12",
        "over": "2.4 over",
        "score": null
    },
    {
        "comms": "B0$ \\n13.46 Head - Abhishek in 2024 \\n12.46 Narine - Salt in 2024 \\n11.49 Du Plessis - Maxwell in 2023 \\n10.55 Kohli - De Villiers in 2016",
        "timestamp": "2024-05-26 19:45:30",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Markram, no run, on a good length and at the stumps, Markram gets right behind the line and defends it to the on-side ",
        "timestamp": "2024-05-26 19:45:30",
        "over": "2.3 over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, 1 run, fuller length delivery on the pads, clipped behind square on the on-side for a single ",
        "timestamp": "2024-05-26 19:44:53",
        "over": "2.2 over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, B0$, nicely played, too straight from Starc, on the pads and it's flicked away nonchalantly, races away to the long leg boundary ",
        "timestamp": "2024-05-26 19:44:23",
        "over": "2.1 over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, B0$, nicely played, too straight from Starc, on the pads and it's flicked away nonchalantly, races away to the long leg boundary ",
        "timestamp": "2024-05-26 19:44:23",
        "over": "2.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 19:44:09",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Head, B0$ Caught by Gurbaz!! Edged and caught! SRH have lost both openers now, this is some start from Vaibhav - on a good length and seaming across the left-hander, Head's feet hardly went anywhere, stayed leg-side and ended up feeling for the ball, a thin edge and Gurbaz does the rest, moving across to his left. Shocker of a start and SRH's fans are already looking downcast. B1$ ",
        "timestamp": "2024-05-26 19:43:04",
        "over": "1.6 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Head, B0$ Caught!! ",
        "timestamp": "2024-05-26 19:43:01",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, 1 run, short of a good length and angling into the right-hander, nudged behind square on the on-side for a single ",
        "timestamp": "2024-05-26 19:41:42",
        "over": "1.5 over",
        "score": null
    },
    {
        "comms": "A break in play, will allow SRH to relax and get grip on the situation. Gurbaz is getting his pads changed and hence the break in play",
        "timestamp": "2024-05-26 19:40:09",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, leg byes, 2 runs, on a good length and angling into the pads, past Tripathi's flick and rolls off the pads towards square leg - Gurbaz with the chase, but he can't prevent the batters from coming back for the second ",
        "timestamp": "2024-05-26 19:40:06",
        "over": "1.4 over",
        "score": null
    },
    {
        "comms": "Vaibhav Arora to Tripathi, no run, this is a good start from KKR - Vaibhav bowls into the surface and follows Tripathi as he backed away, hit high on the bat and lobbed wide of the bowler",
        "timestamp": "2024-05-26 19:39:09",
        "over": "1.3 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, no run, nice channels from Vaibhav - short of a good length and just outside off, Tripathi is very fidgety as he pushes forward, gets a soft edge that rolls through to slip ",
        "timestamp": "2024-05-26 19:38:21",
        "over": "1.2 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, no run, edged, but the ball drops well in front of the keeper - was the cutter from Vaibhav, stopped onto Tripathi as he shaped for the back-foot poke, hit very high on the bat and lands in front of the keeper ",
        "timestamp": "2024-05-26 19:37:53",
        "over": "1.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 19:37:39",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, 1 run, on a good length and just outside off, dropped in front of cover-point for a quick single ",
        "timestamp": "2024-05-26 19:36:23",
        "over": "0.6 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 19:36:15",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Shreyas Iyer becomes the first captain to lead two different franchises in IPL grand finals - Delhi Capitals in 2020 and Kolkata Knight Riders in 2024.",
        "timestamp": "2024-05-26 19:34:23",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Starc to Abhishek Sharma, B0$ Bowled!! Peach, an absolute peach and Abhishek has no answers - this is some start from Starc once again, big game player and he's come to the fore once again. Outlandish stuff from the Aussie legend, angled in, drew Abhishek forward and then nipped away wickedly, opened up the left-hander like a can of beans and clips the outside of his off-stump. Don't think Abhishek could've done anything about it, he just puts his head down and walks away. B1$",
        "timestamp": "2024-05-26 19:34:23",
        "over": "0.5 over",
        "score": null
    },
    {
        "comms": " Starc to Abhishek Sharma, B0$ Bowled!! ",
        "timestamp": "2024-05-26 19:34:20",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Abhishek Sharma, 2 runs, a run-out chance? A better throw would've had Abhishek well short - might've been struggling had Gurbaz thrown down the stumps, he was well away and misses his shy - on a good length and well wide of off, Abhishek leans across, plays with an open face and then guides it backward of square on the off-side - his call for the second, was always a risky one and he was struggling, but Ramandeep's throw is well wide of the stumps ",
        "timestamp": "2024-05-26 19:33:41",
        "over": "0.4 over",
        "score": null
    },
    {
        "comms": " Starc to Abhishek Sharma, no run, short and wide of off, would've been called as a wide had Abhishek let it go, he went chasing after that and toe-ended it to cover, was in the air, but bounced short of the fielder ",
        "timestamp": "2024-05-26 19:32:53",
        "over": "0.3 over",
        "score": null
    },
    {
        "comms": " Starc to Abhishek Sharma, no run, a nervy poke, short of a good length and slanting across the left-hander - Abhishek plays away from his body, hangs his bat out to dry and is beaten on the outside edge ",
        "timestamp": "2024-05-26 19:32:15",
        "over": "0.2 over",
        "score": null
    },
    {
        "comms": " Starc to Abhishek Sharma, no run, fuller length delivery and shaping away from wide of off, Abhishek saw the width and went hard on the drive, beaten by the awayswinging delivery ",
        "timestamp": "2024-05-26 19:31:46",
        "over": "0.1 over",
        "score": null
    },
    {
        "comms": " Starc to Abhishek Sharma, no run, fuller length delivery and shaping away from wide of off, Abhishek saw the width and went hard on the drive, beaten by the awayswinging delivery ",
        "timestamp": "2024-05-26 19:31:46",
        "over": "0.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 19:31:32",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 19:31:32",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Head isn't taking strike, it'll be Abhishek Sharma, one slip in place.",
        "timestamp": "2024-05-26 19:31:06",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Pat Cummins won the toss in QF1, batted first and was left to regret that call. He has opted to bat first once again and he'll hope that the dew doesn't come. Always good to bat first in a big final, the onus is on SRH to put up a total on the board. The players are out in the middle for the national anthem of India. The two on-field umpires walk out to the middle - Jayaraman Madanagopal and Nitin Menon, KKR are quick onto the field, it'll be Starc v Head once again, a big sub-plot and one which could decide which way this final goes.",
        "timestamp": "2024-05-26 19:24:12",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$: It's another final. It's nice to be here, it's been a very enjoyable couple of months, so hopefully we can top it off tonight and please a lot of fans. (On losing 4 & 3 wickets in the powerplay in the last two matches) We'd obviously like to lose a little bit less. We got to 170 both times without hitting the marks that we wanted to hit. That's exciting as a group and we spoke about that - we want to go out and continue to play aggressive, play positively and do what we've done the whole time. The positive is that we've been able to get to totals that's given us half a chance with a powerplay like that. So hopefully tonight we can get off to a really good start and get to a really big score. (Any advantage having played Qualifier 2 at this venue?) We'll say yes and they'll say no. We have to come prepared and we are ready to go. We had a look at it the other day, it'll be completely different. It's about making sure that we sum those conditions up as quickly as we can and communicate that well. If it's with the bat, get off to the best start we can with me and Abhi (Abhishek Sharma). If it's the ball, then Bhuvi will kickstart that for us. (Battle against Starc) We have had our battles over the years and he's won a fair few of them, hopefully knock the shine off him tonight and then we get off to a good start.",
        "timestamp": "2024-05-26 19:17:33",
        "over": "- over",
        "score": null
    },
    {
        "comms": "We've made no changes to our pre-toss expert XI. Do have a look before you finalize your fantasy picks.",
        "timestamp": "2024-05-26 19:15:04",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 19:07:12",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$Umran Malik,  Glenn Phillips, Mayank Markande, Abdul Samad, Washington Sundar",
        "timestamp": "2024-05-26 19:06:49",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$Anukul Roy, Manish Pandey, Nitish Rana, KS Bharat, Sherfaine Rutherford",
        "timestamp": "2024-05-26 19:06:41",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 19:06:22",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ (Playing XI): Rahmanullah Gurbaz(w), Sunil Narine, Venkatesh Iyer, Shreyas Iyer(c), Rinku Singh, Andre Russell, Ramandeep Singh, Mitchell Starc, Vaibhav Arora, Harshit Rana, Varun Chakaravarthy",
        "timestamp": "2024-05-26 19:05:39",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ (Playing XI): Travis Head, Abhishek Sharma, Rahul Tripathi, Aiden Markram, Nitish Reddy, Heinrich Klaasen(w), Shahbaz Ahmed, Pat Cummins(c), Bhuvneshwar Kumar, Jaydev Unadkat, T Natarajan",
        "timestamp": "2024-05-26 19:05:04",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$We would have bowled, we'll get a fair idea about how the pitch will play. It's a red soil and we played our last game on a similar surface. We need to stay with the present, stick to the basics and execute all our plans. Every individual is taking responsibility, this is a big game, we've plenty of people who're playing in a  final for the first time, nervous, but this is also a good chance. We're going with the same team",
        "timestamp": "2024-05-26 19:04:04",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$We will bat first. Looks like a good wicket, played on a different wicket the other night. There was no dew on the other night's game, we have a style which doesn't work always, but when it does, it's very damaging. I want to crack with the bat first. We have done well defending scores. Pretty much the same, Shahbaz comes in for Samad.",
        "timestamp": "2024-05-26 19:03:04",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-26 19:01:04",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cricbuzz Live Hindi: IPL 2024 Final, Kolkata v Hyderabad, Pre-match show",
        "timestamp": "2024-05-26 18:57:14",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ We had one (practice session) interrupted by rain last night. We all got warmed up and ready to go and then the rain came, so hopefully that's not the case tonight. It was nice to get here early after our game in Ahmedabad, obviously we watched the other game (Qualifier 2) here last night unfold which resulted in us playing the Sunrisers, everyone is ready to go. Sunrisers played here a couple of nights ago but it is a different wicket, it will be about adapting with the bat and ball, I think powerplay in both innings is going to be what shapes the game, we were on the better side of that in Ahmedabad and hopefully it is the same here, but we know in T20 cricket anything can happen. I missed that game with a cut on my finger, I felt that my rhythm was building up being back into T20 cricket after a fair while, so thankfully that has been the case and got back into rhythm - the intensity and how quickly you need to adapt in T20 to conditions or how the batting team goes about it. Our bowling unit has been fantastic throughout, the openers at the top order have been phenomenal as well and we have just gone about our business as a group, trying to improve game on game and find ourselves in the final. It has been nice personally to contribute to that and hopefully it is another successful night tonight.",
        "timestamp": "2024-05-26 18:57:14",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ (Secret behind KKR's success) Team atmosphere is superb. Whenever we enter the dressing room, Ramandeep Singh plays Punjabi songs and it changes the environment. GG (Gautam Gambhir) sir and Chandru (Chandrakant Pandit) sir have given us a lot of freedom. The thought process remains the same (for the final), playing according to the match situation. It'll be a dream come true to win a senior trophy. I'll try to give my best. Hopefully we win the match. We have played a match here as well, so we know how the wicket plays. I never look too far ahead, I always stay in the present.",
        "timestamp": "2024-05-26 18:56:23",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$: It's a humid evening and slightly overcast. Game today on pitch #4 which is more central of all the pitches. It's also a red soil wicket. CSK lost to PBKS on it on May 1. Some bowling on the side for Markram. Might be an option against the left-handers in KKR's line-up. Meanwhile, Umran Malik just marked his run-up. He's done it in previous games too but wasn't brought on as an impact sub.",
        "timestamp": "2024-05-26 18:49:07",
        "over": "- over",
        "score": null
    },
    {
        "comms": "It's a red soil pitch, 63m and 70m square boundaries, the straight boundary is at 77m. Red clay tends to have a lot of bounce, this is a well prepared pitch and we should have a high scoring game. The scores could range anywhere around 175-190. This is the third final at this venue and there have been high scores in both the previous games. Not a lot of spin, but significant bounce. Unconventional shots, horizontal bat shots is what the batters will look to do against spin. The groundsmen have assured that B0$, say B1$, in their pitch report.",
        "timestamp": "2024-05-26 18:37:03",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Our man at the ground, B0$, has some early info regarding the game and the conditions. 'It's a humid evening and slightly overcast. Game today on pitch #4 which is more central of all the pitches. It's also a red soil wicket. CSK lost to PBKS on it on May 1', he says.",
        "timestamp": "2024-05-26 18:29:10",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ - It has been a collective effort from the Knight Riders and they've got contributions from the unlikeliest sources as well. Sunil Narine was back as an opener and he's their leading run-scorer with 482 runs. Phil Salt was brought in as Jason Roy's replacement and he finished with 435 runs. As many as four others topped at least 200+ runs. In the bowling front, as many as 6 players took 10 or more wickets. A complete team effort and it's no wonder that they were easily the best team of the season. On the other hand, the Sunrisers have depended heavily on their powerful batting line-up. With 567 runs and a SR of 192.2, Travis Head tops the charts. Five others have gone past at least 200+ runs, but only three bowlers have entered double digits in the wickets column. But tonight's completely different - one good batting performance or one good bowling spell could lead to a title dash.",
        "timestamp": "2024-05-26 18:18:19",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Road to the final - It has been plain sailing as far as the Knight Riders are concerned in this season's tournament. They suffered only 3 losses and haven't been beaten by any team for exactly one month. On the other hand, the Sunrisers had to wait until their 13th game to confirm a playoff position and then won their last match to secure a top-2 spot. In the big scheme of things, they've never beaten the Knight Riders this season. They were beaten by a 4-run margin in a close opening encounter, but there was nothing close to their hammering in Qualifier 1.",
        "timestamp": "2024-05-26 18:10:04",
        "over": "- over",
        "score": null
    }
]