[
    {
        "comms": "So that ends this series. These two sides will again meet in a World Cup warm-up in a few days' time. All this is preparation ahead of the big event. USA as I previously mentioned will be over the moon to grab a series win against a full-member team while Bangladesh would be bitterly disappointed. But still cricket ahead for both these sides before they go into the big event. We close our coverage here of this game. We will be back with more cricket soon. See you and till then don't forget to take care. Bye.",
        "timestamp": "2024-05-25 23:38:21",
        "over": "- over",
        "score": null
    },
    {
        "comms": "The winning trophy is presented to Monank Patel who accepts it.",
        "timestamp": "2024-05-25 23:37:02",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ We had a bad game today. We did not assess the conditions as we should have, kudos to Bangladesh for the great win today. It's tough to bat first sometimes here and it comes down to shot selection and we played some poor shots. We are still trying to get the right combination for the World Cup and those two warm-up games are very important for us. We are definitely confident, we have a strong team and we go back to the drawing board, draw up plans, play our best cricket and hopefully we can do well.",
        "timestamp": "2024-05-25 23:37:02",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Boys showed a lot of character and everyone executed their plans. It's very disappointing to lose the series, we did not play well to be honest. But to finish on a high today will help us ahead of the World Cup. We know the conditions and how it will be and we are looking forward.",
        "timestamp": "2024-05-25 23:35:59",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Very happy with the way I bowled. I tried a lot of variations and mixed it up. Feeling really good for winning these awards.",
        "timestamp": "2024-05-25 23:34:59",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ What a statement win from Bangladesh. Only that it came in a consolatory way. The series has already been lost and this is just a face-saving win. USA can be saved criticism for this loss as they are on a high. And they made changes to this game to give their reserve players a chance. Bangladesh with Mustafizur set the tone with the ball and the target was chased down without loss by the openers. The real Bangladesh turned up today and that gave USA no chance. The target of 105 was never going to be enough and Tanzid and Sarkar helped themselves to good morale-boosting knocks ahead of the T20 World Cup. While the USA will be over the moon with the series win, Bangladesh will know that they have a lot of work to do ahead of the World Cup. They would be shocked and gutted to lose this series, when in their minds they would have come here thinking this is going to be an easy series. Stay tuned for the presentations...",
        "timestamp": "2024-05-25 23:08:46",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Nisarg Patel to Soumya Sarkar, B0$, all over. B1$ Full and wide outside off, driven to extra-cover and the fielder lets it go, sloppy way to end the game ",
        "timestamp": "2024-05-25 23:08:43",
        "over": "11.4 over",
        "score": null
    },
    {
        "comms": " Nisarg Patel to Tanzid Hasan, 1 run, full outside off, pushed wide of cover and B0$ ",
        "timestamp": "2024-05-25 23:07:57",
        "over": "11.3 over",
        "score": null
    },
    {
        "comms": " Nisarg Patel to Soumya Sarkar, 1 run, tossed up full outside off, driven to long-off ",
        "timestamp": "2024-05-25 23:07:31",
        "over": "11.2 over",
        "score": null
    },
    {
        "comms": " Nisarg Patel to Soumya Sarkar, no run, flat and short outside off, skids on and beats Soumya Sarkar's cut ",
        "timestamp": "2024-05-25 23:07:13",
        "over": "11.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 23:07:04",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Nosthush Kenjige to Tanzid Hasan, B0$, dragged short outside off, Tanzid Hasan pulls massively over wide long-on, that went into the beaches ",
        "timestamp": "2024-05-25 23:05:56",
        "over": "10.6 over",
        "score": null
    },
    {
        "comms": " Nosthush Kenjige to Soumya Sarkar, B0$, down leg, Soumya Sarkar sweeps and misses, Gous misses too ",
        "timestamp": "2024-05-25 23:05:27",
        "over": "10.6 over",
        "score": null
    },
    {
        "comms": " Nosthush Kenjige to Tanzid Hasan, 1 run, tossed up outside the leg-stump, flicked to deep mid-wicket ",
        "timestamp": "2024-05-25 23:05:02",
        "over": "10.5 over",
        "score": null
    },
    {
        "comms": " Nosthush Kenjige to Soumya Sarkar, 1 run, short down leg, pulled to deep sq ",
        "timestamp": "2024-05-25 23:04:36",
        "over": "10.4 over",
        "score": null
    },
    {
        "comms": " Nosthush Kenjige to Tanzid Hasan, 1 run, slower good length on the stumps, tucked to deep mid-wicket and that's B0$ ",
        "timestamp": "2024-05-25 23:04:03",
        "over": "10.3 over",
        "score": null
    },
    {
        "comms": " Nosthush Kenjige to Soumya Sarkar, 1 run, Soumya Sarkar comes down the track and heaves that with the turn to deep square leg ",
        "timestamp": "2024-05-25 23:03:35",
        "over": "10.2 over",
        "score": null
    },
    {
        "comms": " Nosthush Kenjige to Tanzid Hasan, 1 run, good length on leg-stump, Tanzid Hasan goes on the back foot to tuck to deep square leg ",
        "timestamp": "2024-05-25 23:03:07",
        "over": "10.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 23:03:01",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Time for a B0$",
        "timestamp": "2024-05-25 22:59:37",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Welcome back. Should be an easy chase this for Bangladesh. Let's see how this unfolds. Netravalkar to start things off.",
        "timestamp": "2024-05-25 22:15:15",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ This is a pretty tacky wicket to bat on but USA are still significantly under par. Despite getting a solid start and a fruitful powerplay, the innings fell off a cliff when the spinners came into action. Gous gave a fiery start, but USA got barely anything from the rest of their batters. Rishad Hossain was brilliant with his leg spin on a track that was quite helpful, ending with figures of 1/7. There were three maidens in the innings which highlighted how tough it was for batting, and how tight the Bangla bowlers kept things. The star of the show for the visitors was Mustafizur Rahman who ended with career best figures of 6/10. Bangladesh would fancy chasing this down early, back shortly for the second innings...",
        "timestamp": "2024-05-25 22:04:04",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to Nisarg Patel, B0$ Caught by Rishad Hossain!! B1$A full delivery angling outside off. Nisarg gets a leading edge on a big heave that flies towards backward point. USA end with a paltry score of 104.  B2$ ",
        "timestamp": "2024-05-25 22:04:01",
        "over": "19.6 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Nisarg Patel, B0$ Caught!! ",
        "timestamp": "2024-05-25 22:03:59",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to Nosthush Kenjige, 1 run, length ball onto leg stump, clipped to square leg for a single ",
        "timestamp": "2024-05-25 22:03:29",
        "over": "19.5 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 22:02:52",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to Jessy Singh, B0$ Bowled!! Fifer for Mustafizur Rahman!! Jasdeep Singh shuffles in and Mustafizur goes for a yorker that goes between the boots of the batter and takes out the leg stump. Too good for a tailender.  B1$ ",
        "timestamp": "2024-05-25 22:01:42",
        "over": "19.4 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Jessy Singh, B0$ Bowled!! ",
        "timestamp": "2024-05-25 22:01:39",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to Jessy Singh, no run, dipping wide yorker, sneaks under the bat ",
        "timestamp": "2024-05-25 22:01:02",
        "over": "19.3 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Jessy Singh, no run, full and angling across, was pace off. A swing and a miss as Singh tried to heave it leg side ",
        "timestamp": "2024-05-25 22:00:04",
        "over": "19.2 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Jessy Singh, B0$, full outside off, too wide again ",
        "timestamp": "2024-05-25 21:59:32",
        "over": "19.2 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Jessy Singh, B0$, back of length but angles across well wide outside off ",
        "timestamp": "2024-05-25 21:59:00",
        "over": "19.2 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Nisarg Patel, 1 run, slower delivery outside off, Nisarg chips it towards long-on after a couple of bounces ",
        "timestamp": "2024-05-25 21:58:28",
        "over": "19.1 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Jessy Singh, no run, pitched up delivery outside off, Jasdeep Singh can't connect ",
        "timestamp": "2024-05-25 21:57:28",
        "over": "18.6 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Jessy Singh, B0$, half volley onto middle. Jasdeep Singh clears the front leg and smokes it over mid-wicket for a boundary. The team score touches three figures ",
        "timestamp": "2024-05-25 21:56:49",
        "over": "18.5 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Nisarg Patel, 1 run, slower full delivery on off, pushed out to mid-off ",
        "timestamp": "2024-05-25 21:55:52",
        "over": "18.4 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Nisarg Patel, no run, very full just outside off, a swing and a miss for Nisarg ",
        "timestamp": "2024-05-25 21:55:08",
        "over": "18.3 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Nisarg Patel, no run, slower bouncer. Nisarg Patel swings too early ",
        "timestamp": "2024-05-25 21:54:27",
        "over": "18.2 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Jessy Singh, 1 run, full on leg stump, slammed towards deep mid-wicket ",
        "timestamp": "2024-05-25 21:53:44",
        "over": "18.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:53:24",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:53:24",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to Nisarg Patel, no run, hits the deck hard onto middle and leg. Defended ",
        "timestamp": "2024-05-25 21:52:39",
        "over": "17.6 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:52:35",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to Corey Anderson, B0$ Bowled!! Chopped on!! A back of length delivery at the stumps. Too close to cut but Anderson tried to run it down but chops it back onto his stumps. Not the batter USA wanted to see walk back with two overs to go. They sink further! B1$ ",
        "timestamp": "2024-05-25 21:51:07",
        "over": "17.5 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Corey Anderson, B0$ Bowled!! ",
        "timestamp": "2024-05-25 21:51:05",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to Corey Anderson, B0$, slower delivery, ends down leg ",
        "timestamp": "2024-05-25 21:49:52",
        "over": "17.5 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Jessy Singh, 1 run, full outside off, slammed down the ground and shatters the non-striker's stumps. Mustafizur didn't get a hand and that'll be a single ",
        "timestamp": "2024-05-25 21:49:05",
        "over": "17.4 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:48:23",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to van Schalkwyk, B0$ Bowled!! a ripper from Mustafizur Rahman!! On a length and angling away to the left hander from round the wicket. Skids through and hurries the batter with his pace. Knocks back the off pole before the batter could get his handle down. B1$ ",
        "timestamp": "2024-05-25 21:47:50",
        "over": "17.3 over",
        "score": null
    },
    {
        "comms": " Mustafizur to van Schalkwyk, B0$ Bowled!! ",
        "timestamp": "2024-05-25 21:47:49",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to van Schalkwyk, B0$, down the leg side ",
        "timestamp": "2024-05-25 21:46:38",
        "over": "17.3 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Corey Anderson, 1 run, full outside off, run down to third-man ",
        "timestamp": "2024-05-25 21:46:05",
        "over": "17.2 over",
        "score": null
    },
    {
        "comms": " Mustafizur to van Schalkwyk, leg byes, 1 run, good length from round the wicket onto the thigh pad. Deflects towards backward point fpr a leg bye ",
        "timestamp": "2024-05-25 21:45:25",
        "over": "17.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:45:00",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to van Schalkwyk, 1 run, pace off on leg stump, turned to short fine ",
        "timestamp": "2024-05-25 21:44:05",
        "over": "16.6 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Corey Anderson, 1 run, pace off and on a length, run down to third-man ",
        "timestamp": "2024-05-25 21:43:37",
        "over": "16.5 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Corey Anderson, B0$, slower delivery, pitched up. Anderson reads it off the hand and slams it over deep mid-wicket for a maximum ",
        "timestamp": "2024-05-25 21:42:57",
        "over": "16.4 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Corey Anderson, B0$, low full toss on leg, tickled away towards the fine leg boundary ",
        "timestamp": "2024-05-25 21:42:02",
        "over": "16.3 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Corey Anderson, no run, bouncer that goes over leg stump as Anderson ducks under ",
        "timestamp": "2024-05-25 21:41:45",
        "over": "16.2 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to van Schalkwyk, 1 run, slower delivery, pushed to point for a single ",
        "timestamp": "2024-05-25 21:40:57",
        "over": "16.1 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to van Schalkwyk, 1 run, slower delivery, pushed to point for a single ",
        "timestamp": "2024-05-25 21:40:57",
        "over": "16.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:40:44",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mahmudullah to Corey Anderson, no run, fuller and with the arm to off stump, Anderson sweeps it into the pitch ",
        "timestamp": "2024-05-25 21:39:56",
        "over": "15.6 over",
        "score": null
    },
    {
        "comms": " Mahmudullah to van Schalkwyk, 1 run, flat outside off, punched to deep extra cover ",
        "timestamp": "2024-05-25 21:39:28",
        "over": "15.5 over",
        "score": null
    },
    {
        "comms": " Mahmudullah to van Schalkwyk, B0$, half tracker, very slow as well. Van Schalkwyk rocks away and slaps it down the ground. Wide of long-on for a boundary. A much needed one! ",
        "timestamp": "2024-05-25 21:38:55",
        "over": "15.4 over",
        "score": null
    },
    {
        "comms": " Mahmudullah to van Schalkwyk, no run, with the arm onto middle stump, defended ",
        "timestamp": "2024-05-25 21:38:36",
        "over": "15.3 over",
        "score": null
    },
    {
        "comms": " Mahmudullah to van Schalkwyk, 2 runs, spinning outside off from a length, cut in front of square for a couple of runs ",
        "timestamp": "2024-05-25 21:38:16",
        "over": "15.2 over",
        "score": null
    },
    {
        "comms": " Mahmudullah to Corey Anderson, 1 run, at the stumps, pushed down to long-on ",
        "timestamp": "2024-05-25 21:37:51",
        "over": "15.1 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to van Schalkwyk, no run, tossed up on off, pushed back to the bowler. B0$ ",
        "timestamp": "2024-05-25 21:36:57",
        "over": "14.6 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to van Schalkwyk, no run, tossed up on off, driven to covers ",
        "timestamp": "2024-05-25 21:36:38",
        "over": "14.5 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to van Schalkwyk, no run, leg spinner at the stumps, pushed back to Rishad ",
        "timestamp": "2024-05-25 21:36:20",
        "over": "14.4 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Corey Anderson, 1 run, on leg stump, swept behind square ",
        "timestamp": "2024-05-25 21:35:58",
        "over": "14.3 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to van Schalkwyk, 1 run, pushed through on a length, another googly. Turned to square leg from the crease ",
        "timestamp": "2024-05-25 21:35:23",
        "over": "14.2 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Corey Anderson, 1 run, length ball, was the googly. Anderson plays a switch hit that goes uppishly to sweeper cover on the bounce ",
        "timestamp": "2024-05-25 21:34:58",
        "over": "14.1 over",
        "score": null
    },
    {
        "comms": " Mahmudullah to van Schalkwyk, no run, lovely off spinner. Pitches and spins outside off, beats the outside edge ",
        "timestamp": "2024-05-25 21:33:40",
        "over": "13.6 over",
        "score": null
    },
    {
        "comms": " Mahmudullah to Corey Anderson, 1 run, arm ball onto off, swept towards deep mid-wicket ",
        "timestamp": "2024-05-25 21:33:18",
        "over": "13.5 over",
        "score": null
    },
    {
        "comms": " Mahmudullah to Corey Anderson, no run, pushed quicker onto off, cut to covers ",
        "timestamp": "2024-05-25 21:32:54",
        "over": "13.4 over",
        "score": null
    },
    {
        "comms": " Mahmudullah to Corey Anderson, no run, tossed up on off, Anderson underedges the sweep onto the back pad ",
        "timestamp": "2024-05-25 21:32:36",
        "over": "13.3 over",
        "score": null
    },
    {
        "comms": " Mahmudullah to van Schalkwyk, 1 run, flat on off stump, punched down to long-on ",
        "timestamp": "2024-05-25 21:32:03",
        "over": "13.2 over",
        "score": null
    },
    {
        "comms": "The last 5.1 overs have yielded 9 runs. Just a reminder, this is a T20I",
        "timestamp": "2024-05-25 21:31:36",
        "over": "- over",
        "score": null
    },
    {
        "comms": "The last 5.1 overs have yielded 9 runs. Just a reminder, this is a T20I",
        "timestamp": "2024-05-25 21:31:36",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mahmudullah to Corey Anderson, 1 run, tossed up on middle, driven to long-on ",
        "timestamp": "2024-05-25 21:31:33",
        "over": "13.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:31:24",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Corey Anderson, 1 run, loopy delivery onto leg, a premeditated sweep towards deep backward square leg to get off the mark ",
        "timestamp": "2024-05-25 21:30:31",
        "over": "12.6 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to van Schalkwyk, 1 run, tossed up closer to off, pushed down to long-off ",
        "timestamp": "2024-05-25 21:29:38",
        "over": "12.5 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to van Schalkwyk, no run, full delivery on leg. turned to mid-wicket ",
        "timestamp": "2024-05-25 21:29:18",
        "over": "12.4 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to van Schalkwyk, no run, flighted up and doesn't spin. Lobs off the front pad, beating the inside edge onto first slip. An appeal for caught behind, but no bat and too high for LBW ",
        "timestamp": "2024-05-25 21:28:59",
        "over": "12.3 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:28:06",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Milind Kumar, B0$ Caught by Tanzid Hasan!! Another one bites the dust. A bit of a half tracker onto middle and leg. Milind Kumar rocks away for a pull, ends up top edging it. Deep mid-wicket runs in to complete the catch. Half the team back in the hut now for the hosts. B1$ ",
        "timestamp": "2024-05-25 21:27:29",
        "over": "12.2 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Milind Kumar, B0$ Caught!! ",
        "timestamp": "2024-05-25 21:27:26",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Milind Kumar, no run, length ball outside off, cut into the pitch and onto first slip ",
        "timestamp": "2024-05-25 21:26:39",
        "over": "12.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:26:32",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Corey Anderson, no run, slower delivery, on a length on leg side. Turned to mid-wicket. B0$ ",
        "timestamp": "2024-05-25 21:25:35",
        "over": "11.6 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Corey Anderson, no run, short ball and doesn't rise as much. Anderson arches his back to get out of harm's away, cops a blow on his chest ",
        "timestamp": "2024-05-25 21:24:39",
        "over": "11.5 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Corey Anderson, no run, full on the boots. Blocked to mid-wicket ",
        "timestamp": "2024-05-25 21:24:10",
        "over": "11.4 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:23:15",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Aaron Jones, B0$ Caught by Rishad Hossain!! The stand-in skipper falls after a tepid stay in the middle. A short ball from Tanzim and Aaron Jones takes it on with a pull shot. Top edges it and holes out to Rishad at deep backward square leg. Nicely judged by the fielder with the sun in his face. B1$ ",
        "timestamp": "2024-05-25 21:22:21",
        "over": "11.3 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Aaron Jones, B0$ Caught!! ",
        "timestamp": "2024-05-25 21:22:18",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Aaron Jones, no run, fuller delivery just missing off stump as Aaron Jones dances down for a blind swing, misses ",
        "timestamp": "2024-05-25 21:21:25",
        "over": "11.2 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Aaron Jones, no run, hard length outside off, inside edge onto the ground towards the keeper ",
        "timestamp": "2024-05-25 21:21:01",
        "over": "11.1 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Aaron Jones, no run, hard length outside off, inside edge onto the ground towards the keeper ",
        "timestamp": "2024-05-25 21:21:01",
        "over": "11.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:20:59",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Shakib to Aaron Jones, 1 run, pushed through flat at the stumps as Jones backed away. Cut to the left of cover ",
        "timestamp": "2024-05-25 21:20:01",
        "over": "10.6 over",
        "score": null
    },
    {
        "comms": " Shakib to Milind Kumar, 1 run, dances out and gets a thick inside edge on the slog. Beats mid-wicket for a single ",
        "timestamp": "2024-05-25 21:19:34",
        "over": "10.5 over",
        "score": null
    },
    {
        "comms": " Shakib to Aaron Jones, 1 run, on a length on leg stump, tucked to deep backward square leg ",
        "timestamp": "2024-05-25 21:19:11",
        "over": "10.4 over",
        "score": null
    },
    {
        "comms": " Shakib to Milind Kumar, 1 run, dances down the track for a slog, inside halves it to deep backward square leg ",
        "timestamp": "2024-05-25 21:18:34",
        "over": "10.3 over",
        "score": null
    },
    {
        "comms": " Shakib to Milind Kumar, no run, pushed through and straighter, hit back to Shakib ",
        "timestamp": "2024-05-25 21:18:13",
        "over": "10.2 over",
        "score": null
    },
    {
        "comms": " Shakib to Milind Kumar, no run, pitched up and gets a bit of extra bounce. The defence from Milind lobs up and just short of the catching cover ",
        "timestamp": "2024-05-25 21:18:05",
        "over": "10.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:17:59",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to Aaron Jones, no run, fuller and angling across. A drive and a miss ",
        "timestamp": "2024-05-25 21:16:56",
        "over": "9.6 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Aaron Jones, no run, fuller onto off stump, driven to mid-off ",
        "timestamp": "2024-05-25 21:16:38",
        "over": "9.5 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:16:32",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:13:33",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to Nitish Kumar, B0$ Caught by Litton Das!! The pressure was building, the wicket was coming! A lovely length delivery that angles across the batter. Nitish Kumar tried to cut but the ball takes a faint edge. Dies down onto keeper Litton who has to dive forward to his right to complete a neat catch. B1$ ",
        "timestamp": "2024-05-25 21:13:30",
        "over": "9.4 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Nitish Kumar, B0$ Caught!! ",
        "timestamp": "2024-05-25 21:13:26",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to Milind Kumar, 1 run, fuller and angling outside off, run down to third-man ",
        "timestamp": "2024-05-25 21:12:50",
        "over": "9.3 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Milind Kumar, no run, slower delivery, pitched up outside off. Pushed towards the cover fielder ",
        "timestamp": "2024-05-25 21:12:16",
        "over": "9.2 over",
        "score": null
    },
    {
        "comms": " Mustafizur to Nitish Kumar, 1 run, pitched up outside off, driven to sweeper cover ",
        "timestamp": "2024-05-25 21:11:40",
        "over": "9.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:11:32",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Milind Kumar, no run, peach of a delivery!! Pitched on off and then spun away fiercely. Past the outside edge, nothing the batter could do there. B0$ ",
        "timestamp": "2024-05-25 21:09:42",
        "over": "8.6 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Milind Kumar, no run, peach of a delivery!! Pitched on off and then spun away fiercely. Past the outside edge, nothing the batter could do there. B0$ ",
        "timestamp": "2024-05-25 21:09:42",
        "over": "8.6 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Milind Kumar, no run, spinning away outside off, dabbed to backward point ",
        "timestamp": "2024-05-25 21:09:25",
        "over": "8.5 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Milind Kumar, no run, tossed up on off, driven neatly but straight to Shanto at covers ",
        "timestamp": "2024-05-25 21:09:02",
        "over": "8.4 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Milind Kumar, no run, on a length onto off, Milind defends it leg side and wants a single. Sent back and almost run out as the keeper went after it ",
        "timestamp": "2024-05-25 21:08:28",
        "over": "8.3 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Milind Kumar, no run, tossed up on off, driven to covers ",
        "timestamp": "2024-05-25 21:08:11",
        "over": "8.2 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Milind Kumar, no run, pushed fuller and gets sharp turn again. Leading edge towards backward point ",
        "timestamp": "2024-05-25 21:07:49",
        "over": "8.1 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Milind Kumar, 1 run, back of length outside off, Milind opens the bat face towards third-man ",
        "timestamp": "2024-05-25 21:06:36",
        "over": "7.6 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Milind Kumar, B0$, short pitched and ends down the leg side ",
        "timestamp": "2024-05-25 21:05:57",
        "over": "7.6 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Milind Kumar, no run, very full outside off, driven into the pitch and towards covers ",
        "timestamp": "2024-05-25 21:05:19",
        "over": "7.5 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Milind Kumar, 2 runs, rolls the hands on that one, gets it to angle to off stump. Milind defends it onto the pitch and scampers for a single. Hasan Mahmud runs in and tries to kick it back onto the stumps, ends up shooting it wide of the keeper and giving an extra run ",
        "timestamp": "2024-05-25 21:04:50",
        "over": "7.4 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Nitish Kumar, 1 run, short pitched, pulled towards deep backward square leg for a single ",
        "timestamp": "2024-05-25 21:03:47",
        "over": "7.3 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Nitish Kumar, no run, length ball that skids through onto the pads. A half appeal but sliding down leg ",
        "timestamp": "2024-05-25 21:03:04",
        "over": "7.2 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to Milind Kumar, leg byes, 1 run, fuller and angling onto the pads, skids through. Deflects to the left of the keeper who makes a diving stop ",
        "timestamp": "2024-05-25 21:02:54",
        "over": "7.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 21:02:20",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Nitish Kumar, no run, sharp spin once again from a fuller length. Nitish lets it pass after watching it all the way ",
        "timestamp": "2024-05-25 21:01:11",
        "over": "6.6 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Nitish Kumar, no run, goes on after pitching on a length. Nitish gets a leading edge towards point as he tried to turn it leg side ",
        "timestamp": "2024-05-25 21:00:56",
        "over": "6.5 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Nitish Kumar, no run, sharp turn from a fuller length, beats the outside edge ",
        "timestamp": "2024-05-25 21:00:33",
        "over": "6.4 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Milind Kumar, 1 run, tossed up onto off, driven to deep extra ",
        "timestamp": "2024-05-25 21:00:13",
        "over": "6.3 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Nitish Kumar, 1 run, flighted up outside off, driven to sweeper cover ",
        "timestamp": "2024-05-25 20:59:43",
        "over": "6.2 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Nitish Kumar, no run, turns away sharply from a length. Nitish Kumar gets behind it and defends ",
        "timestamp": "2024-05-25 20:59:16",
        "over": "6.1 over",
        "score": null
    },
    {
        "comms": " Rishad Hossain to Nitish Kumar, no run, turns away sharply from a length. Nitish Kumar gets behind it and defends ",
        "timestamp": "2024-05-25 20:59:16",
        "over": "6.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 20:59:06",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to Milind Kumar, no run, B0$ Very full onto off stump, defended tepidly towards covers ",
        "timestamp": "2024-05-25 20:57:38",
        "over": "5.6 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 20:57:29",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to S Jahangir, B0$ Caught by Tanzim Hasan Sakib!! Four dot balls and now a wicket! A short delivery that doesn't bounce as well, arrives a bit slower than expected. Pulled away but lands straight down the throat of deep backward square leg. B1$ ",
        "timestamp": "2024-05-25 20:55:54",
        "over": "5.5 over",
        "score": null
    },
    {
        "comms": " Mustafizur to S Jahangir, B0$ Caught!! ",
        "timestamp": "2024-05-25 20:55:52",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Mustafizur to S Jahangir, no run, fraction short of length and across the batter. Cut to backward point ",
        "timestamp": "2024-05-25 20:54:53",
        "over": "5.4 over",
        "score": null
    },
    {
        "comms": " Mustafizur to S Jahangir, no run, good length angling to off stump, dabbed towards backward point ",
        "timestamp": "2024-05-25 20:54:19",
        "over": "5.3 over",
        "score": null
    },
    {
        "comms": " Mustafizur to S Jahangir, no run, pitched up and moves back in slightly from off. Jahangir defends into his pads ",
        "timestamp": "2024-05-25 20:53:42",
        "over": "5.2 over",
        "score": null
    },
    {
        "comms": " Mustafizur to S Jahangir, no run, lovely delivery to start off!! Angling across outside off, almost kisses the outside edge ",
        "timestamp": "2024-05-25 20:53:10",
        "over": "5.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 20:52:54",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 20:52:47",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Shakib to Gous, B0$ Caught by Soumya Sarkar!! Pitched up and gets it to turn away. Gous goes for a big slog sweep which he toe-ends. Goes high in the air and almost a collision between mid-on running back and long-off running ahead. Sarkar from long-off keeps his eyes on it and takes a steady catch as Rishad moved away at the last instant. B1$ ",
        "timestamp": "2024-05-25 20:51:11",
        "over": "4.6 over",
        "score": null
    },
    {
        "comms": " Shakib to Gous, B0$ Caught!! ",
        "timestamp": "2024-05-25 20:51:09",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Shakib to Gous, B0$, short and wide, Gous punches it square of the wicket with a lot from vigour to beat the infield! ",
        "timestamp": "2024-05-25 20:50:25",
        "over": "4.5 over",
        "score": null
    },
    {
        "comms": " Shakib to Gous, no run, in the air....just short!! Sharp turn and this one just holds its length on off. Gous punches it uppishly but just short of extra cover ",
        "timestamp": "2024-05-25 20:50:19",
        "over": "4.4 over",
        "score": null
    },
    {
        "comms": " Shakib to S Jahangir, 1 run, fuller and turning away from middle, punched to mid-on for a single ",
        "timestamp": "2024-05-25 20:49:33",
        "over": "4.3 over",
        "score": null
    },
    {
        "comms": " Shakib to S Jahangir, B0$, pitched fuller at the stumps, Jahangir shuffles both direction and then hoists his flick over deep square for a maximum. He's taking on the veteran Bangladeshi bowler here! ",
        "timestamp": "2024-05-25 20:48:57",
        "over": "4.2 over",
        "score": null
    },
    {
        "comms": " Shakib to S Jahangir, no run, pitched fuller and gets some turn from off. Punched to mid-wicket ",
        "timestamp": "2024-05-25 20:48:28",
        "over": "4.1 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Gous, B0$, angling onto the pads, flicked away effortlessly behind square for a boundary. An expensive over for Bangladesh ",
        "timestamp": "2024-05-25 20:47:22",
        "over": "3.6 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Gous, B0$, angling onto the pads, flicked away effortlessly behind square for a boundary. An expensive over for Bangladesh ",
        "timestamp": "2024-05-25 20:47:22",
        "over": "3.6 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Gous, no run, pace off and was fuller. Driven into the ground towards the point fielder ",
        "timestamp": "2024-05-25 20:46:13",
        "over": "3.5 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Gous, B0$, a hat-trick of overs!! Short of length and width. slashed through backward point for a boundary ",
        "timestamp": "2024-05-25 20:45:40",
        "over": "3.4 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Gous, B0$, back of length onto the body, pulled behind square for a boundary ",
        "timestamp": "2024-05-25 20:45:05",
        "over": "3.3 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Gous, B0$, length ball onto off stump, Gous opens the bat face late to squeeze it through backward point for a boundary ",
        "timestamp": "2024-05-25 20:44:22",
        "over": "3.2 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to S Jahangir, 1 run, short pitched onto off stump, Shayan with a swivel pull towards backward square ",
        "timestamp": "2024-05-25 20:44:03",
        "over": "3.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 20:44:00",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Shakib to S Jahangir, 1 run, pushed quicker onto middle and leg, Jahangir with a soft push towards mid-on for a single ",
        "timestamp": "2024-05-25 20:42:36",
        "over": "2.6 over",
        "score": null
    },
    {
        "comms": " Shakib to S Jahangir, no run, on a length onto off, punched to mid-on ",
        "timestamp": "2024-05-25 20:42:15",
        "over": "2.5 over",
        "score": null
    },
    {
        "comms": " Shakib to Gous, 1 run, sliding onto leg stump, turned to the right of square leg ",
        "timestamp": "2024-05-25 20:41:52",
        "over": "2.4 over",
        "score": null
    },
    {
        "comms": " Shakib to Gous, no run, pitched up with some flight onto off, defended ",
        "timestamp": "2024-05-25 20:41:30",
        "over": "2.3 over",
        "score": null
    },
    {
        "comms": " Shakib to Gous, no run, pushed fuller and cramming the batter on leg stump. Nudged to mid-wicket ",
        "timestamp": "2024-05-25 20:41:14",
        "over": "2.2 over",
        "score": null
    },
    {
        "comms": " Shakib to Gous, B0$, short, slow and coming on with the arm. Gous rocks back and plenty of time for the weight transfer onto the backfoot to then slam it over deep mid-wicket for a maximum! ",
        "timestamp": "2024-05-25 20:40:54",
        "over": "2.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 20:40:27",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Early introduction of spin. Shakib into the attack",
        "timestamp": "2024-05-25 20:39:15",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to S Jahangir, B0$, back of length and wide, swinging further. Jahangir judges the length quickly and cuts it square of the wicket for a boundary ",
        "timestamp": "2024-05-25 20:39:12",
        "over": "1.6 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to S Jahangir, no run, Mahmud shortens the length and gets it just outside off. Jahangir shuffles in for a big pull shot, beating on the inside edge ",
        "timestamp": "2024-05-25 20:38:32",
        "over": "1.5 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to S Jahangir, B0$, overpitched and offering width. Jahangir gets a powerful drive on that through extra cover for the first boundary of the game ",
        "timestamp": "2024-05-25 20:37:59",
        "over": "1.4 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to S Jahangir, no run, good length outside off, swings away. A slash and a miss for Shayan ",
        "timestamp": "2024-05-25 20:37:14",
        "over": "1.3 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to S Jahangir, no run, good length and hurries onto the batter. Jahangir looks to slash it away and is late on his contact. The ball ambles towards the cover fielder ",
        "timestamp": "2024-05-25 20:36:40",
        "over": "1.2 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to S Jahangir, no run, good length and hurries onto the batter. Jahangir looks to slash it away and is late on his contact. The ball ambles towards the cover fielder ",
        "timestamp": "2024-05-25 20:36:40",
        "over": "1.2 over",
        "score": null
    },
    {
        "comms": " Hasan Mahmud to S Jahangir, no run, good length skiddy delivery onto off stump. Defended into the pitch ",
        "timestamp": "2024-05-25 20:35:59",
        "over": "1.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 20:35:26",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Gous, no run, fuller and jags back in off the seam. Beats the inside edge and a whisker away from off stump ",
        "timestamp": "2024-05-25 20:34:21",
        "over": "0.6 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Gous, no run, good length onto off stump, defended towards covers ",
        "timestamp": "2024-05-25 20:33:34",
        "over": "0.5 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Gous, no run, good length delivery that gets plenty of outswing. Gous lets it pass ",
        "timestamp": "2024-05-25 20:33:00",
        "over": "0.4 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to Gous, B0$, banged in short and ends down the leg side ",
        "timestamp": "2024-05-25 20:32:28",
        "over": "0.4 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to S Jahangir, 1 run, angling onto leg stump on a length, glanced to fine leg ",
        "timestamp": "2024-05-25 20:32:00",
        "over": "0.3 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to S Jahangir, no run, fuller and angles onto off stump. Defended by Shayan ",
        "timestamp": "2024-05-25 20:31:06",
        "over": "0.2 over",
        "score": null
    },
    {
        "comms": " Tanzim Hasan Sakib to S Jahangir, no run, full and gets a bit of shape away from off stump, pushed out to the point fielder ",
        "timestamp": "2024-05-25 20:30:58",
        "over": "0.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 20:30:55",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 20:30:55",
        "over": "- over",
        "score": null
    },
    {
        "comms": "The players are out in the middle. Tanzim Hasan with the new ball against a changed USA opening line-up. Shayan Jahangir to take stirke. Let's play...",
        "timestamp": "2024-05-25 20:29:12",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 20:18:21",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ (Playing XI): Andries Gous(w), Aaron Jones(c), Corey Anderson, Milind Kumar, Nitish Kumar, Shadley van Schalkwyk, Shayan Jahangir, Nisarg Patel, Jasdeep Singh, Nosthush Kenjige, Saurabh Netravalkar",
        "timestamp": "2024-05-25 20:18:19",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ (Playing XI): Litton Das(w), Soumya Sarkar, Tanzid Hasan, Najmul Hossain Shanto(c), Towhid Hridoy, Shakib Al Hasan, Mahmudullah, Rishad Hossain, Tanzim Hasan Sakib, Hasan Mahmud, Mustafizur Rahman",
        "timestamp": "2024-05-25 20:15:09",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-25 20:06:41",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Hosts USA have shown that they aren’t there to just make up the numbers at the World Cup, with some enterprising performances from Harmeet Singh, Ali Khan and Corey Anderson. They have a golden opportunity to claim a 3-0 win against the Bangla Tigers, rousing the home fans ahead of some big days in the lives of all those American cricketers. We’re not too far away from the toss, stick around…",
        "timestamp": "2024-05-24 20:50:58",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Since then, Bangladesh have lost a game against Zimbabwe and two games against USA, relinquishing a series in the process. With the series already decided, all that Bangladesh are playing for today is avoiding the ignominy of being whitewashed by an associate nation. They have found the going tough in Houston, as their tepid batting approach has cost them in both games.",
        "timestamp": "2024-05-24 20:50:58",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$  A couple of weeks back, Shakib Al Hasan claimed that Bangladesh won’t adequately prepared for this T20 World Cup because they are playing weaker teams in the lead up. \"In Australia (T20 World Cup in 2022) we went after playing against New Zealand and Pakistan and so certainly we went to the World Cup on the back of very good preparation and taking that into consideration this is not ideal,” he was quoted as saying to the media.",
        "timestamp": "2024-05-24 20:50:58",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-24 20:50:58",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Squad: Tanzid Hasan, Soumya Sarkar, Najmul Hossain Shanto(c), Towhid Hridoy, Shakib Al Hasan, Mahmudullah, Jaker Ali(w), Rishad Hossain, Tanzim Hasan Sakib, Shoriful Islam, Mustafizur Rahman, Litton Das, Mahedi Hasan, Taskin Ahmed, Tanvir Islam",
        "timestamp": "2024-05-24 20:50:55",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Squad: Steven Taylor, Monank Patel(w/c), Andries Gous, Aaron Jones, Corey Anderson, Harmeet Singh, Nitish Kumar, Shadley van Schalkwyk, Ali Khan, Jasdeep Singh, Saurabh Netravalkar, Milind Kumar, Nisarg Patel, Shayan Jahangir, Nosthush Kenjige",
        "timestamp": "2024-05-24 20:49:21",
        "over": "- over",
        "score": null
    }
]