[
    {
        "comms": "Giants like Mitchell Starc deliver on the big stage, form doesn't matter: Manoj Tiwary",
        "timestamp": "2024-05-21 23:18:57",
        "over": "- over",
        "score": null
    },
    {
        "comms": "That brings an end to our first playoff game of IPL 2024. Proved to be a one-sided affair in the end, but KKR fans won't mind it. They move one step closer to lifting that trophy. Been 10 long years since the Knights last won that title. It's not the end of SRH's journey though as they will face the winner of tomorrow's game in Qualifier 2. Expecting the Eliminator (B0$) game to be much more exciting than tonight's clash. RCB have been on a roll and have won six games on the trot. Will they make it 7 in a row against Rajasthan Royals? We shall find out tomorrow. For now, it's goodbye from B1$ and B2$. Peace out!",
        "timestamp": "2024-05-21 23:18:57",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ We know how important the powerplay is. These were the two sides who have dominated in the powerplay with the bat. We needed to pick early wickets and get into their middle-order. The way Head and Abhishek have been playing thoughout the tournament, they like width and free their arms. We just tried to swing the ball and not provide them width. Bowl stump to stump and tried the hard length. The spinners were effective and the whole bowling department was great. Got lucky I guess (on taking Head's wicket), was nice to see his back early, not always the case. We have been playing against each other in recent times. They (Arora and Harshit) are exciting to watch and are talented, they are skillful. It's good to see how hard they train. Harshit has been phenomenal this year. Our bowling attack has been great, it's hard to single anyone out. As an older and overseas player, it's good to see. No doubt they'll take many wickets in the IPL and for India as well.",
        "timestamp": "2024-05-21 23:10:40",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Elated by the performance, the responsibility was important, we stood up for each other, extremely happy with the performances. The rejuvenation was important for us. When you travel so much. It's important to stay in the present. Today was the day we had to maximise, we did it and that's what we thrive on. I think the way every bowler stood up to this occasion, the way they came in and took wickets, that was imperative. The attitude and approach of all bowlers was to take wickets and they did. When you have a variety in the bowling line-up, it's mesmerising. They have been true in terms of their work ethics, hopefully we keep performing. It was Gurbaz's first game and he gave an impactful start. We had to make sure we carry forward the same run rate. I don't know tamil, but I understand. Venky speaks in tamil, I reply in hindi (talking about the communication between him and Venkatesh Iyer). We need to be in our zone in the final and make sure we give our best.",
        "timestamp": "2024-05-21 23:07:00",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 22:54:38",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Since 2018, the team that won Qualifier 1 went onto win the IPL trophy every single time.",
        "timestamp": "2024-05-21 22:54:38",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$  \\n2 - MS Dhoni \\n2 - Rohit Sharma \\n2 - David Warner \\n2 - Shreyas Iyer*",
        "timestamp": "2024-05-21 22:54:38",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$  \\n10 - CSK  \\n6 - MI  \\n4 - KKR*  \\n3 - RCB",
        "timestamp": "2024-05-21 22:54:38",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\n136 - M Bisla & J Kallis vs CSK, Chennai, 2012  \\n97* - Shreyas Iyer & V Iyer vs SRH, Ahmedabad, 2024* \\n96 - Shubman Gill & V Iyer vs DC, Sharjah, 2021",
        "timestamp": "2024-05-21 22:54:38",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$   \\n26 (30) vs RCB, Sharjah, 2021   \\n55 (41) vs DC, Sharjah, 2021   \\n50 (32) vs CSK, Dubai, 2021   \\n51* (28) vs SRH, Ahmedabad, 2024*",
        "timestamp": "2024-05-21 22:54:38",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\n62 - SRH vs LSG, Hyderabad, 2024 (Target: 166)  \\n38 - KKR vs SRH, Ahmedabad, 2024 (Target: 160) \\n34 - KKR vs SRH, Kolkata, 2014 (Target: 161) \\n32 - MI vs RR, Wankhede, 2014 (Target: 190)",
        "timestamp": "2024-05-21 22:54:38",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cricbuzz Live Hindi: Qualifier 1, Kolkata v Hyderabad, Post-match show",
        "timestamp": "2024-05-21 22:54:38",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ More than the confidence I was really wanting to go out and bat, we last played a game on 11th, so we all were eager to go out and showcase our talent. The wicket was really good, credit goes to our bowlers for bowling them out for 160 odd. In a tournament like this, momentum is really important, we have seen that with RCB winning their matches continuously and gaining the momentum even we wanted that momentum, so we wanted to go out and wanted the rain to stop but it was disappointing. But, we were the table toppers and we have got a lot of support from the management,  credit to the owners, SRK and Jay sir were also there tonight to support us. It is always special for players like us to play in the IPL final, it’s a dreamy moment for us, going to Chennai and looking forward to it. We have a realistic chance to win the trophy now. We were raring to go out there, when you have the momentum you want to really go out there. You saw Rinku fielding in hotspots and taking those catches. It’s the excitement we have to go out there and perform.",
        "timestamp": "2024-05-21 22:54:38",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Yeah we will try to put this behind quickly, good thing we will have a crack at it (second qualifier). You have those days in T20 cricket where things doesn't quite work out. We weren't where we wanted with the bat and obviously couldn't do much with the ball. Felt that extra batting was important (picking the impact sub) on this wicket. Thought KKR bowled really well, there was a little bit in it early on and the surface got better. We all have played enough cricket, and going to a new venue (Chennai) helps us as well, so we gotta keep this behind and move on.",
        "timestamp": "2024-05-21 22:54:38",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cricbuzz Live: Qualifier 1, Kolkata v Hyderabad, Post-match show",
        "timestamp": "2024-05-21 22:46:36",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ 2012. 2014. 2021. 2024. KKR set to play their fourth final in the history of IPL. They finished the league stage as the number 1 team and they have played like the best team of the season tonight. Couldn't have been anymore convincing. Mitchell Starc got the Knights off to a dream start by dismissing Head for a duck and he bowled a magnificent spell in the powerplay to reduce SRH to 39/4. Tripathi and Klaasen added some pivotal runs, however, the KKR bowlers choked them in the middle overs as Sunrisers finished with a mediocre total. In reply, the KKR openers gave a perfect start, while the two Iyers (Shreyas and Venkatesh) finished off the run chase with an excellent partnership for the third wicket. Head who had a great outing here in the final of 2023 World Cup had a horrible game tonight. Was dismissed for a duck earlier in the evening and was smashed all around the park by Shreyas towards the end.",
        "timestamp": "2024-05-21 22:46:36",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Head to Shreyas Iyer, B0$, B1$ A tossed up delivery and Shreyas Iyer launches it over long-on to draw curtains to the game. B2$ The players are quick to exchange handshakes",
        "timestamp": "2024-05-21 22:44:08",
        "over": "13.4 over",
        "score": null
    },
    {
        "comms": " Head to Shreyas Iyer, B0$, this is carnage by the KKR skipper. Tossed up delivery on leg and Shreyas Iyer has smashed it over deep mid-wicket for half-a-dozen more. Head getting a taste of his own medicine ",
        "timestamp": "2024-05-21 22:43:30",
        "over": "13.3 over",
        "score": null
    },
    {
        "comms": " Head to Shreyas Iyer, B0$, spanks this away to the deep mid-wicket fence as Head bowls a loosener. B1$ ",
        "timestamp": "2024-05-21 22:43:05",
        "over": "13.2 over",
        "score": null
    },
    {
        "comms": " Head to Shreyas Iyer, B0$, Shreyas Iyer doesn't hold back either. A tossed up delivery on leg and Shreyas Iyer has swiped this over deep mid-wicket for half-a-dozen ",
        "timestamp": "2024-05-21 22:42:44",
        "over": "13.1 over",
        "score": null
    },
    {
        "comms": " Nitish Reddy to Venkatesh Iyer, B0$, B1$ What a fantastic knock this has been. Clearly the best knock of this game. Nails it over deep mid-wicket for half-a-dozen ",
        "timestamp": "2024-05-21 22:41:40",
        "over": "12.6 over",
        "score": null
    },
    {
        "comms": " Nitish Reddy to Venkatesh Iyer, no run, played back to the bowler by Venkatesh Iyer ",
        "timestamp": "2024-05-21 22:41:03",
        "over": "12.5 over",
        "score": null
    },
    {
        "comms": " Nitish Reddy to Shreyas Iyer, 1 run, drifting on the pads, Shreyas Iyer flicks it through the on-side for a single ",
        "timestamp": "2024-05-21 22:40:36",
        "over": "12.4 over",
        "score": null
    },
    {
        "comms": "Nitish Reddy to Shreyas Iyer, <b>FOUR</b>, another rollicking boundary by the skipper. Nitish Reddy goes short and Shreyas Iyer nails the pull through backward square leg, away to the fence at the rate of knots",
        "timestamp": "2024-05-21 22:39:52",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Head to Shreyas Iyer, <b>FOUR</b>, easy pickings! Down the leg-side as Shreyas Iyer paddles this away to the fine leg boundary, runs coming thick and fast",
        "timestamp": "2024-05-21 22:35:53",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Head to Venkatesh Iyer, <b>FOUR</b>, on the shorter side outside off, Venkatesh Iyer rocks back and carves it through backward point for four runs",
        "timestamp": "2024-05-21 22:34:29",
        "over": "- over",
        "score": null
    },
    {
        "comms": "T Natarajan to Shreyas Iyer, <b>FOUR</b>, banged in short by T Natarajan, Shreyas Iyer arches back and guides it away to the third man fence. KKR rapidly hunting this down as the 50-run stand comes up",
        "timestamp": "2024-05-21 22:33:03",
        "over": "- over",
        "score": null
    },
    {
        "comms": "T Natarajan to Shreyas Iyer, <b>SIX</b>, <b>insult to injury!</b> This was pitched up by Natarajan and Shreyas Iyer lofts it over long-off for a well timed six. Sunrisers look down and out",
        "timestamp": "2024-05-21 22:30:01",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cricbuzz Comm Box: Qualifier 1, KKR v SRH, 2nd innings",
        "timestamp": "2024-05-21 22:29:22",
        "over": "- over",
        "score": null
    },
    {
        "comms": "V Viyaskanth to Venkatesh Iyer, <b>SIX</b>, Venkatesh Iyer wants to get done with this quickly. He's wasting no time, playing with authority and confidence. This was fraction short and Venkatesh Iyer rocks back in the crease and hammers the pull over deep mid-wicket for a flat six",
        "timestamp": "2024-05-21 22:27:48",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cummins to Shreyas Iyer, <b>FOUR</b>, <b>Shreyas Iyer joins the act!</b> Short ball outside off, Shreyas Iyer carves this away to the square third man fence. Used the pace and put it away by placing it into the gap",
        "timestamp": "2024-05-21 22:22:51",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cummins to Venkatesh Iyer, <b>FOUR</b>, <b>equation down to 70 ioff 70.</b> Just a run-a-ball from this point. Venkatesh Iyer walks across in the crease, makes room and pulls the short ball over mid-wicket as the ball races away to the fence",
        "timestamp": "2024-05-21 22:21:02",
        "over": "- over",
        "score": null
    },
    {
        "comms": "V Viyaskanth to Venkatesh Iyer, <b>SIX</b>, <b>Venky Iyer on the charge!</b> Right into the slot on off, Venkatesh Iyer goes down on his knee and smokes it over deep mid-wicket for a clean six",
        "timestamp": "2024-05-21 22:17:11",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$: KKR should send Rinku up the order tonight to give him some game-time & make sure they have all bases covered before the final.",
        "timestamp": "2024-05-21 22:14:34",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cummins to Venkatesh Iyer, <b>SIX</b>, great response from Venkatesh Iyer! He uses his feet and Cummins shortens his length a bit. Good extension of the arms from Venkatesh Iyer and he smashes it over mid-off for a boundary",
        "timestamp": "2024-05-21 22:14:34",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cummins to Narine, <b>out</b> Caught by V Viyaskanth!! The short ball ploy has worked for Cummins & Co! Three fielders in the deep on the leg-side and Narine has picked out one of them. A shortish delivery in line of the stumps, Narine doesn't have much space to free his arms but goes through his pull shot. Hasn't got the power behind it as the ball flies towards deep square leg. Viyaskanth stationed there takes it safely. <b>Narine c V Viyaskanth b Cummins 21(16) [4s-4]</b>",
        "timestamp": "2024-05-21 22:11:52",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cummins to Narine, <b>FOUR</b>, just over the leaping keeper! A back of a length ball outside off, Narine throws his bat at it and gets a thick outside edge. Klaasen leaps to his left but it evades him and races through to the fence",
        "timestamp": "2024-05-21 22:10:57",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$: I don't know why but this just seems to be KKR's season. They have been dominant against every team they have faced. Their West Indies' all rounders have come through for them",
        "timestamp": "2024-05-21 22:06:14",
        "over": "- over",
        "score": null
    },
    {
        "comms": "T Natarajan to Narine, <b>FOUR</b>, this boundary spoils the over somewhat! A back of a length ball angling in, this time it sits up nicely for him. He pulls it over mid-wicket and bisects long-on and deep mid-wicket to perfection",
        "timestamp": "2024-05-21 22:06:14",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Rinku no flash in the pan, bad form just a phase: Michael Vaughan",
        "timestamp": "2024-05-21 21:59:36",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Bhuvneshwar to Venkatesh Iyer, <b>FOUR</b>, shot! Venkatesh Iyer is showing intent from the start! He skips down the track, converts it into a half-volley and hits it over the mid-off fielder to get the desired result",
        "timestamp": "2024-05-21 21:56:59",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Bhuvneshwar to Venkatesh Iyer, <b>FOUR</b>, easy pickings! Fullish ball swinging towards the pads, Venkatesh Iyer glances it and the ball races to the fine leg fence",
        "timestamp": "2024-05-21 21:56:25",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$: Nothing against Arshdeep, but this edition, Natarajan looked better in terms of control and nailing those yorkers, should have at least made the reserves list for the WC.",
        "timestamp": "2024-05-21 21:55:52",
        "over": "- over",
        "score": null
    },
    {
        "comms": "T Natarajan to Venkatesh Iyer, <b>FOUR</b>, Venkatesh Iyer opens his account with a first ball boundary. Drifting on the pads and Venkatesh Iyer has glanced it away to the fine leg fence to get going. Natarajan looks utterly disappointed with himself",
        "timestamp": "2024-05-21 21:52:45",
        "over": "- over",
        "score": null
    },
    {
        "comms": "T Natarajan to Gurbaz, <b>out</b> Caught by V Viyaskanth!! Natarajan strikes in his first over. Gurbaz shimmies down the wicket and slashes it straight to the fielder at cover. Taken comfortably by Viyaskanth and Gurbaz departs after playing a cameo. Just the breakthrough SRH were looking for. <b>Gurbaz c V Viyaskanth b T Natarajan 23(14) [4s-2 6s-2]</b>",
        "timestamp": "2024-05-21 21:51:29",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Bhuvneshwar to Gurbaz, <b>FOUR</b>, to long-on",
        "timestamp": "2024-05-21 21:47:32",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Bhuvneshwar to Gurbaz, <b>SIX</b>, what a hit! Gurbaz once again shimmies down the track and gets close to the pitch of it. The connection is great as he tonks it over long-on for a big maximum",
        "timestamp": "2024-05-21 21:46:40",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cummins to Gurbaz, <b>SIX</b>, Gurbaz swings and gets lucky! He dances down the track and looks to slog across the line to the back of a length delivery. Ends up getting a big top-edge and away she flies over the third man fence for a flat maxiimum",
        "timestamp": "2024-05-21 21:41:39",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cummins to Narine, <b>FOUR</b>, not the correct length to bowl to Narine. Straighter this time and it's full again. In the slot for Narine and he heaves it past the left side of mid-on to pick up another boundary",
        "timestamp": "2024-05-21 21:37:43",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cummins to Narine, <b>FOUR</b>, Narine gets off the mark in style! Pitched up around off, right in Narine's eyeline and he loves it there. He clears his front leg and smashes it over the leaping fielder at mid-off to find the fence",
        "timestamp": "2024-05-21 21:37:16",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Bhuvneshwar to Gurbaz, <b>FOUR</b>, lovely shot! Pitched up outside off, swinging away, Gurbaz leans into it and essays a lovely drive through covers to get the desired result. Good way to get off the mark",
        "timestamp": "2024-05-21 21:33:01",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Welcome back for the run-chase! Narine has a new opening partner in Gurbaz tonight. The former's form with the bat has dipped off late but if he can get going, he will be difficult to stop. Bhuvneshwar to start off with the new ball. A slip in place. Here we go...",
        "timestamp": "2024-05-21 21:15:51",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\nOvers 1-7: 50/4 (RR: 7.14) \\nOvers 8-12: 60/1 (RR: 12.00) \\nOvers 13-19.3: 49/5 (RR: 6.53)",
        "timestamp": "2024-05-21 21:15:48",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ this season is the joint-most for him in an IPL edition. Last year he took 20 wickets as well.",
        "timestamp": "2024-05-21 21:15:48",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$  \\n55* - Shikhar Dhawan & M Rathee (PBKS) vs SRH, Hyderabad, 2023  \\n33 - Pat Cummins & V Viyaskanth (SRH) vs KKR, Ahmedabad, 2024*  \\n31* - Tom Curran & Ankit Rajpoot (RR) vs KKR, Dubai, 2020 \\n31 - Andre Russell & CV Varun (KKR) vs DC, Delhi, 2023",
        "timestamp": "2024-05-21 21:15:48",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\n4/21 - Sunil Narine vs RCB, Sharjah, 2021 \\n3/13 - Umesh Yadav vs PBKS, Kolkata, 2014 \\n3/20 - Nathan Coulter-Nile vs SRH, Bengaluru, 2017 \\n3/34 - Mitchell Starc vs SRH, Ahmedabad, 2024* \\n3/35 - Kuldeep Yadav vs SRH, Delhi, 2016",
        "timestamp": "2024-05-21 21:15:48",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$I have been fortunate enough to play on some big occasions, nice to get our team off to a good start, we know how SRH matched us in terms of attacking with the bat in the powerplay. Their (Head and Abhishek) partnership has been the key for them and to get both of them out cheaply, it's really pleasing. The wicket's got a bit skidier and there is some swing as well, I feel the wicket will get better with dew and the  powerplay will be really key for us.",
        "timestamp": "2024-05-21 21:15:48",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cricbuzz Live Hindi: Qualifier 1, Kolkata v Hyderabad, Mid-innings show",
        "timestamp": "2024-05-21 21:15:48",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ SRH have only managed to post a middling total in an important match. Perhaps, the decision to win the toss and bat first backfired on them. Starc was in his elements from the get-go and knocked over Head for a duck. Abhishek also departed cheaply as he holed out to covers to Arora. The Australian should have got his second wicket as well when Tripathi was trapped in front but KKR didn't review. But, Starc was relentless and picked up two more wickets in two balls to push SRH into a tangle at 39/4. It was in the 9th over that SRH got some momentum with Narine leaking 18 runs. But soon after that, Chakravarthy struck in his first over to send the dangerous Klaasen packing. Tripathi continued to play well from the other end and scored a fine fifty but a needless run-out sent him packing. The Impact sub flopped and the wickets continued to tumble. Chakravarthy once again bowled a top spell to choke SRH. Cummins played a good cameo but 159 is below-par on a surface which is pretty good for batting. The odd-ball is sticking and there's some extra bounce too but KKR have the firepower to chase this down...",
        "timestamp": "2024-05-21 21:15:48",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Russell to Cummins, B0$ Caught by Gurbaz!! Cummins falls after playing a cameo! Fuller length ball angling in, Cummins clears his front leg and swings at it but only manages to edge it to his right. It's high in the night sky. Gurbaz calls for it and takes a fine running catch. SRH are bowled out for 159. B1$ ",
        "timestamp": "2024-05-21 21:15:45",
        "over": "19.3 over",
        "score": null
    },
    {
        "comms": " Russell to Cummins, B0$ Caught!! ",
        "timestamp": "2024-05-21 21:15:41",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Russell to Cummins, no run, a fine yorker tailing in on middle and leg, Cummins digs it out to the left of Russell ",
        "timestamp": "2024-05-21 21:15:04",
        "over": "19.2 over",
        "score": null
    },
    {
        "comms": " Russell to V Viyaskanth, 3 runs, lazy work in the field! A short of length ball well outside off, Viyaskanth upper cuts it over backward point and Cummins calls his partner through for the second. Rana takes it casual and underarms the throw to the keeper which allows Cummins to take the third run ",
        "timestamp": "2024-05-21 21:14:17",
        "over": "19.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 21:14:04",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Cummins, B0$, smart from Cummins! Fuller length ball outside off, Cummins knows where the gap is. He opens his bat-face and carves it past the left side of backward point to find the fence ",
        "timestamp": "2024-05-21 21:12:54",
        "over": "18.6 over",
        "score": null
    },
    {
        "comms": " Starc to Cummins, B0$, straight up but it not only clears short third but also the fence! A length ball shaping in, Cummins swings hard across the line but gets a big top-edge. The fielder tracks back but he can only see it flying over the fence ",
        "timestamp": "2024-05-21 21:12:13",
        "over": "18.5 over",
        "score": null
    },
    {
        "comms": " Starc to Cummins, no run, almost chopped on! Full ball tailing back in nicely, Cummins pushes at it with minimal foot movement and gets an inside edge onto the pads. The ball then lobs over the stumps ",
        "timestamp": "2024-05-21 21:11:28",
        "over": "18.4 over",
        "score": null
    },
    {
        "comms": " Starc to V Viyaskanth, 1 run, Starc tucks Viyaskanth with a back of a length bal that shoots off the deck. He hops and somehow manages to run it down to third man ",
        "timestamp": "2024-05-21 21:10:49",
        "over": "18.3 over",
        "score": null
    },
    {
        "comms": " Starc to Cummins, 1 run, fuller length ball angling in on off, Cummins hits it off the inner half towards wide long-on ",
        "timestamp": "2024-05-21 21:10:07",
        "over": "18.2 over",
        "score": null
    },
    {
        "comms": " Starc to Cummins, no run, hat-trick ball but Starc doesn't get it. Was a yorker length ball that tailed in from outside off, Cummins looks to carve it through point but gets an inside edge onto the pads ",
        "timestamp": "2024-05-21 21:09:24",
        "over": "18.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 21:09:20",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, 1 run, full ball drifting in from outside off, driven against the angle to sweeper cover. B0$ ",
        "timestamp": "2024-05-21 21:07:52",
        "over": "17.6 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, 1 run, full ball drifting in from outside off, driven against the angle to sweeper cover. B0$ ",
        "timestamp": "2024-05-21 21:07:52",
        "over": "17.6 over",
        "score": null
    },
    {
        "comms": "Chakaravarthy to V Viyaskanth, 1 run, quick and full this time, drifting in, Viyaskanth seems to have got an inside edge onto his pads and the ball deflects towards short fine",
        "timestamp": "2024-05-21 21:07:33",
        "over": "17.5 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, 1 run, floated delivery on off, Cummins drags his slog sweep to deep backward square leg. Shouts of catch it but it falls short of the man there ",
        "timestamp": "2024-05-21 21:06:50",
        "over": "17.4 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to V Viyaskanth, 1 run, tossed up outside off, Viyaskanth strokes it to long-off to get off strike ",
        "timestamp": "2024-05-21 21:06:21",
        "over": "17.3 over",
        "score": null
    },
    {
        "comms": "A slip in place for No. 11",
        "timestamp": "2024-05-21 21:05:47",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, 1 run, quicker through the air on off, Cummins slogs it off the inner half to deep squar leg ",
        "timestamp": "2024-05-21 21:05:44",
        "over": "17.2 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, B0$, that's an audacious stroke! Cummins premeditates and switches his stance. Employs the reverse hit to perfection to the back of a length ball on off and plays it over the third man fence ",
        "timestamp": "2024-05-21 21:05:14",
        "over": "17.1 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Cummins, 1 run, an off-cutter on a good length outside off, dabbed to short third to retain strike ",
        "timestamp": "2024-05-21 21:04:09",
        "over": "16.6 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Cummins, B0$, nicely played! A back of a length ball outside off, Cummins stays leg-side of the ball and opens the face of his bat to guide the cut nicely past the left side of the diving backward point fielder. Gets the desired result ",
        "timestamp": "2024-05-21 21:03:27",
        "over": "16.5 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to V Viyaskanth, 1 run, fuller length ball outside off, Viyaskanth pushes it off the outer half of his bat to the right of third man ",
        "timestamp": "2024-05-21 21:02:49",
        "over": "16.4 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Cummins, 1 run, another off-pace ball outside off, Cummins dabs it towards short third and calls his partner through for a brisk single ",
        "timestamp": "2024-05-21 21:01:58",
        "over": "16.3 over",
        "score": null
    },
    {
        "comms": "B0$ Sunil Narine conceded in an inning this IPL. He conceded 1/40 against RCB at Bengaluru earlier this season.",
        "timestamp": "2024-05-21 21:01:14",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Cummins, no run, another off-cutter on a length that grips, Cummins is early into his slog and misses again and the ball flies over the stumps ",
        "timestamp": "2024-05-21 21:01:14",
        "over": "16.2 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Cummins, no run, A slower length ball angling in, Cummins looks to slog across the line but only meets thin air. That wasn't far from the leg-stump and Harshit Rana has his hands on his head ",
        "timestamp": "2024-05-21 21:00:44",
        "over": "16.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 21:00:33",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Bhuvneshwar, B0$ Lbw!! Bhuvneshwar has been trapped in front but he takes the review! Looked adjacent to the naked eye. The only thing that can save him if it slides down leg. Was a length ball on off that spun in sharply, Bhuvneshwar played down the wrong line and was pinged on the pads. Time for the replays. There's a flat line on Ultra Edge. Over to ball-tracking and hitting is umpire's call. Would have clipped the top of leg-stump. SRH in danger of being bowled out. B1$ ",
        "timestamp": "2024-05-21 20:58:56",
        "over": "15.6 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Bhuvneshwar, B0$ Lbw!! ",
        "timestamp": "2024-05-21 20:58:55",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:57:17",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Bhuvneshwar, no run, an appeal for an lbw cut short! Tossed up outside off, Bhuvneshwar plays around it and is struck on the pads. The impact was probably outside off ",
        "timestamp": "2024-05-21 20:57:14",
        "over": "15.5 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, 1 run, just short of long-on! Cummins leans ahead and goes for an expansive stroke but gets it off the toe-end. The fielder runs in but it reaches him on the bounce ",
        "timestamp": "2024-05-21 20:56:38",
        "over": "15.4 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, 1 run, just short of long-on! Cummins leans ahead and goes for an expansive stroke but gets it off the toe-end. The fielder runs in but it reaches him on the bounce ",
        "timestamp": "2024-05-21 20:56:38",
        "over": "15.4 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, no run, defensive bowling this time as Chakaravarthy fires it on a back of a length well outside off, Cummins lets it go ",
        "timestamp": "2024-05-21 20:56:10",
        "over": "15.3 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, no run, on a back of a length around off, Cummins steers it straight to the slip fielder ",
        "timestamp": "2024-05-21 20:55:49",
        "over": "15.2 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Cummins, no run, oh, almost sneaked through! An in-drifter on a fuller length around off, Cummins goes for a slog sweep but gets an inside edge onto the pads ",
        "timestamp": "2024-05-21 20:55:27",
        "over": "15.1 over",
        "score": null
    },
    {
        "comms": "Varun & Narine performing in tandem best news for KKR: Joy Bhattacharjya",
        "timestamp": "2024-05-21 20:55:26",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:55:26",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\n-> Chakravathy strikes in his first over, gets the big fish - Klaasen \\n-> Samad opens his account with a maximum against Sunil Narine \\n-> An excellent effort by Russell results in Tripathi's run-out \\n-> Impact player Sanvir walks back without troubling the scorers \\n-> Samad is the 8th wicket down, departs after playing a cameo",
        "timestamp": "2024-05-21 20:54:08",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Bhuvneshwar, no run, back of a length ball in the off-stump channel, Bhuvneshwar hops and keeps it out ",
        "timestamp": "2024-05-21 20:54:08",
        "over": "14.6 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Bhuvneshwar, no run, pacy short of length ball outside off and there's room on offer, Bhuvneshwar slashes and misses ",
        "timestamp": "2024-05-21 20:53:36",
        "over": "14.5 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:53:26",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Abdul Samad, B0$ Caught by Shreyas Iyer!! Another one bites the dust! SRH are falling like a pack of cards! A slower length ball outside off, Abdul Samad uses his feet and makes a bit of room but he is not to the pitch of it. Still goes through with his swing and mistimes it towards long-off. Shreyas Iyer near the ropes is cool as a cucumber and pouches it safely. B1$ ",
        "timestamp": "2024-05-21 20:52:10",
        "over": "14.4 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Abdul Samad, B0$ Caught!! ",
        "timestamp": "2024-05-21 20:52:07",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$: To be fair on Samad, Tripathi was backing up too much so both the batters were at the fault in that Run-Out...",
        "timestamp": "2024-05-21 20:51:17",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Cummins, 1 run, Cummins makes room and Harshit Rana follows him with a back of a length ball. He hops and works it through wide mid-on ",
        "timestamp": "2024-05-21 20:51:17",
        "over": "14.3 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Abdul Samad, 1 run, slower good length ball outside off, Abdul Samad punches it to sweeper cover ",
        "timestamp": "2024-05-21 20:50:38",
        "over": "14.2 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Abdul Samad, no run, skiddy back of a length ball outside off, Abdul Samad looks to force it through covers but only meets thin air ",
        "timestamp": "2024-05-21 20:49:52",
        "over": "14.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:49:51",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Cummins, no run, well bowled! Quick and flat just outside off, turns the other way this time, Cummins pokes at it and gets beaten ",
        "timestamp": "2024-05-21 20:48:11",
        "over": "13.6 over",
        "score": null
    },
    {
        "comms": " Narine to Cummins, no run, a bit quicker through the air, Cummins keeps it out watchfully ",
        "timestamp": "2024-05-21 20:47:45",
        "over": "13.5 over",
        "score": null
    },
    {
        "comms": " Narine to Cummins, 2 runs, tossed up on off, Cummins works it through square leg and rushes back for the second run ",
        "timestamp": "2024-05-21 20:47:15",
        "over": "13.4 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:47:07",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Sanvir Singh, B0$ Bowled!! Two wickets in two balls and the momentum has swung once more! 92.6kph length ball on middle, pitches and turns and grips, Sanvir Singh leans ahead tentatively to counter it but leaves a bat-pad gap. The ball deflects off his pads and crashes into the stumps. B1$ ",
        "timestamp": "2024-05-21 20:45:46",
        "over": "13.3 over",
        "score": null
    },
    {
        "comms": " Narine to Sanvir Singh, B0$ Bowled!! Two wickets in two balls and the momentum has swung once more! 92.6kph length ball on middle, pitches and turns and grips, Sanvir Singh leans ahead tentatively to counter it but leaves a bat-pad gap. The ball deflects off his pads and crashes into the stumps. B1$ ",
        "timestamp": "2024-05-21 20:45:46",
        "over": "13.3 over",
        "score": null
    },
    {
        "comms": " Narine to Sanvir Singh, B0$ Bowled!! ",
        "timestamp": "2024-05-21 20:45:43",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:45:10",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ comes in as the Impact sub for Abhishek Sharma for SRH",
        "timestamp": "2024-05-21 20:43:31",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Abdul Samad, B0$ Tripathi Run Out!! Brilliant stuff from Russell and KKR get the well-set Tripathi! On a back of a length outside off, Abdul Samad chops it to the left of Russell at backward point who dives to make a great stop. Abdul Samad continues to run while Tripathi is ball-watching. Abdul Samad has crossed Tripathi and the latter is stranded in the middle. The throw comes in and Gurbaz does the rest. An unnecessary dismissal this but KKR won't mind one bit. B1$ ",
        "timestamp": "2024-05-21 20:43:28",
        "over": "13.2 over",
        "score": null
    },
    {
        "comms": " Narine to Abdul Samad, B0$ Run Out!! ",
        "timestamp": "2024-05-21 20:43:27",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Abdul Samad, B0$, what a shot! Narine continues to leak runs. Abdul Samad uses his feet, converts this one into a slot ball and smashes it over deep mid-wicket for a maximum. He hit that so well ",
        "timestamp": "2024-05-21 20:42:28",
        "over": "13.1 over",
        "score": null
    },
    {
        "comms": "B0$ Wickets column, the biggest concern for SRH. KKR are not complaining though. They would be keen to keep SRH under 170 which appears to be a below par total on this wicket...",
        "timestamp": "2024-05-21 20:39:04",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Abdul Samad, 1 run, floated full on the stumps, Samad slogs to the right of Starc at long-on. Shouts of \"Catch it\", but Starc decided to save the boundary and sat back to cover the line of the ball ",
        "timestamp": "2024-05-21 20:39:01",
        "over": "12.6 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Tripathi, 1 run, full outside off, Tripathi advances and forces the drive to the right of long-off ",
        "timestamp": "2024-05-21 20:38:30",
        "over": "12.5 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Tripathi, no run, short outside off, punched away to the left of backward point ",
        "timestamp": "2024-05-21 20:38:04",
        "over": "12.4 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Abdul Samad, 1 run, flat and just outside off, clipped away into the mid-wicket pocket ",
        "timestamp": "2024-05-21 20:37:36",
        "over": "12.3 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Abdul Samad, no run, comes down the track and slices the drive to the right of short third. Thinks of a quick single, but sent back! ",
        "timestamp": "2024-05-21 20:36:57",
        "over": "12.2 over",
        "score": null
    },
    {
        "comms": "B0$ Klaasen got out to spin 5 times in his last 7 matches. He was out to spin only once in the first six matches of the season.",
        "timestamp": "2024-05-21 20:36:30",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Tripathi, 1 run, full and fast just outside off, flicked away to the right of deep mid-wicket ",
        "timestamp": "2024-05-21 20:36:30",
        "over": "12.1 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Tripathi, B0$, spins down leg from a length, Tripathi doesn't bother with it ",
        "timestamp": "2024-05-21 20:36:04",
        "over": "12.1 over",
        "score": null
    },
    {
        "comms": " Narine to Tripathi, 1 run, short on off, punched down to long-on ",
        "timestamp": "2024-05-21 20:35:14",
        "over": "11.6 over",
        "score": null
    },
    {
        "comms": "B0$ \\nInns: 13  \\nRuns: 184  \\nBalls: 95 \\nDismissals: 6  \\nAvg: 30.7 \\nSR: 193.7 \\n4s/6s: 4/20",
        "timestamp": "2024-05-21 20:34:50",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Abdul Samad, 1 run, quicker and just outside off, pushed away to the right of mid-wicket ",
        "timestamp": "2024-05-21 20:34:50",
        "over": "11.5 over",
        "score": null
    },
    {
        "comms": " Narine to Abdul Samad, no run, short on the stumps, punched to the right of the bowler ",
        "timestamp": "2024-05-21 20:34:28",
        "over": "11.4 over",
        "score": null
    },
    {
        "comms": " Narine to Abdul Samad, no run, short on the stumps, punched to the right of the bowler ",
        "timestamp": "2024-05-21 20:34:28",
        "over": "11.4 over",
        "score": null
    },
    {
        "comms": " Narine to Abdul Samad, no run, quicker on leg stump, gently worked away into the leg-side ",
        "timestamp": "2024-05-21 20:34:09",
        "over": "11.3 over",
        "score": null
    },
    {
        "comms": " Narine to Abdul Samad, B0$, no sighters needed says Abdul Samad. With a solid base at the crease, watches this full delivery dip in his arc and he's marmalized it into the cow corner orbit for a maximum ",
        "timestamp": "2024-05-21 20:33:35",
        "over": "11.2 over",
        "score": null
    },
    {
        "comms": " Narine to Tripathi, 1 run, flat on off, Tripathi knocks it to the right of the bowler and a slight fumble allows the batters to sneak a quick single ",
        "timestamp": "2024-05-21 20:33:08",
        "over": "11.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:33:02",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:32:57",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Chakaravarthy to Klaasen, B0$ Caught by Rinku Singh!! KKR get the big fish. Chakaravarthy goes fast and full just outside off, lured Klaasen into a slog but also forced him to hit to the longer part of the ground. Klaasen's slog didn't find the desired connection and Rinku makes no mistake at deep mid-wicket. Runs across to his right and completes the catch with ease. B1$",
        "timestamp": "2024-05-21 20:31:16",
        "over": "10.6 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Klaasen, B0$ Caught!! ",
        "timestamp": "2024-05-21 20:31:13",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Tripathi, 1 run, floated up just outside off, clipped away to mid-wicket for a quick single ",
        "timestamp": "2024-05-21 20:30:37",
        "over": "10.5 over",
        "score": null
    },
    {
        "comms": "B0$: So good to see Rahul Tripathi again and in form. Huge game for him.",
        "timestamp": "2024-05-21 20:29:54",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Tripathi, B0$, goes for the reverse sweep and hits the gap to perfection. Rahul Tripathi brings up his B1$ and one that he'll remember for a long time given the situation of the game. He stayed low and got enough contact to beat Russell at backward point to his right ",
        "timestamp": "2024-05-21 20:29:54",
        "over": "10.4 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Klaasen, 1 run, quicker and wider of off, Klaasen slaps it off the back foot to deep cover ",
        "timestamp": "2024-05-21 20:29:20",
        "over": "10.3 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Tripathi, 1 run, short outside off, Tripathi opens the bat face and punches to the left of sweeper cover ",
        "timestamp": "2024-05-21 20:28:48",
        "over": "10.2 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Tripathi, no run, excellent follow-up delivery from Varun Chakaravarthy. A yorker length delivery on the stumps and Tripathi can only squeeze it back to the bowler ",
        "timestamp": "2024-05-21 20:28:16",
        "over": "10.1 over",
        "score": null
    },
    {
        "comms": " Chakaravarthy to Klaasen, B0$, 1 run, gee! It's a front foot no ball from a spinner. A full delivery on the stumps and Klaasen has flicked it along the ground to deep mid-wicket ",
        "timestamp": "2024-05-21 20:27:58",
        "over": "10.1 over",
        "score": null
    },
    {
        "comms": "Cricbuzz Comm Box: Qualifier 1, KKR v SRH, 1st innings",
        "timestamp": "2024-05-21 20:26:28",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:26:28",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\n-> 50 up for Sunrisers Hyderabad in the 7th over \\n-> Counterattack by Klaasen and Tripathi \\n-> Narine proving to be expensive, concedes 18 runs in an over \\n-> 50-run stand up between Tripathi and Klaasen \\n-> Match getting interesting, Sunrisers back in it",
        "timestamp": "2024-05-21 20:26:28",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Russell to Klaasen, 1 run, short of length outside off, punched down to the left of long-on ",
        "timestamp": "2024-05-21 20:26:28",
        "over": "9.6 over",
        "score": null
    },
    {
        "comms": " Russell to Tripathi, 1 run, I0$ short outside off, Tripathi seeks to pull and the top-edge falls in no-man's land around the mid-wicket area ",
        "timestamp": "2024-05-21 20:25:56",
        "over": "9.5 over",
        "score": null
    },
    {
        "comms": " Russell to Tripathi, B0$, B1$ Bumper outside off, Tripathi leaps up on his toes and helps it over the keeper with a well-timed ramp ",
        "timestamp": "2024-05-21 20:25:09",
        "over": "9.4 over",
        "score": null
    },
    {
        "comms": " Russell to Klaasen, 1 run, cut away to deep backward point ",
        "timestamp": "2024-05-21 20:24:41",
        "over": "9.3 over",
        "score": null
    },
    {
        "comms": " Russell to Klaasen, 1 run, cut away to deep backward point ",
        "timestamp": "2024-05-21 20:24:41",
        "over": "9.3 over",
        "score": null
    },
    {
        "comms": " Russell to Klaasen, B0$, short and wide of off, Klaasen stands tall and flays it over backward point for a near-maximum. SRH gaining some much-needed momentum... ",
        "timestamp": "2024-05-21 20:24:38",
        "over": "9.2 over",
        "score": null
    },
    {
        "comms": " Russell to Tripathi, 1 run, slower length delivery on off, punched down to long-on ",
        "timestamp": "2024-05-21 20:23:23",
        "over": "9.1 over",
        "score": null
    },
    {
        "comms": "B0$ \\nInns: 4  \\nRuns: 38  \\nBalls: 23  \\nDismissals: 4  \\nAvg: 9.5  \\nSR: 165.2",
        "timestamp": "2024-05-21 20:23:19",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:23:19",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Klaasen, B0$, beats Russell once again - this time along the ground. B1$ Not too many teams did that to Narine this season, remember. Once again it was the pace and width on the delivery that allowed Klaasen to smack it along the ground to beat long-off to his left ",
        "timestamp": "2024-05-21 20:21:42",
        "over": "8.6 over",
        "score": null
    },
    {
        "comms": " Narine to Klaasen, B0$, shouts of \"catch it\" and all the SRH fans had their hearts in their mouth for a moment. It was quick and short from Narine, Klaasen stands on the back foot and lofts it high into the night sky and manages to clear the fielder at long-off quite comfortably... ",
        "timestamp": "2024-05-21 20:21:09",
        "over": "8.5 over",
        "score": null
    },
    {
        "comms": " Narine to Klaasen, 2 runs, allows the ball to spin and crunches it to the left of Russell at long-on. Early call for a second and they complete it without any fuss ",
        "timestamp": "2024-05-21 20:20:37",
        "over": "8.4 over",
        "score": null
    },
    {
        "comms": " Narine to Tripathi, 1 run, full and wide of off, Tripathi drags the sweep off the thick inside half to the right of deep square ",
        "timestamp": "2024-05-21 20:20:09",
        "over": "8.3 over",
        "score": null
    },
    {
        "comms": " Narine to Tripathi, B0$, goes full and fast on the stumps, Tripathi gets really low and paddle-scoops it really fine over the keeper. The quick outfield takes care of the rest... ",
        "timestamp": "2024-05-21 20:19:30",
        "over": "8.2 over",
        "score": null
    },
    {
        "comms": " Narine to Klaasen, 1 run, quicker on the stumps, Klaasen goes on the back foot and punches it to the right of long-on ",
        "timestamp": "2024-05-21 20:18:57",
        "over": "8.1 over",
        "score": null
    },
    {
        "comms": "B0$: There certainly is something with Aussies in big matches, it wasn't head's day but starc has showed his class again. Onus on cummins now!!",
        "timestamp": "2024-05-21 20:15:30",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Not the ideal start for SRH after winning the toss, and a lot will rely on this partnership if they are to post a competitive total. As for KKR, they will look to squeeze through the middle overs with spin and won't make it any easy for the team in Orange.",
        "timestamp": "2024-05-21 20:15:30",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, 1 run, I0$ length outside off, punched down the ground towards long-on ",
        "timestamp": "2024-05-21 20:15:27",
        "over": "7.6 over",
        "score": null
    },
    {
        "comms": "B0$ this season after 37/2 vs RR at Hyderabad and 40/3 vs PBKS at Mullanpur.",
        "timestamp": "2024-05-21 20:14:44",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Tripathi, 1 run, I0$ length outside off, stabbed away to deep cover ",
        "timestamp": "2024-05-21 20:14:44",
        "over": "7.5 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Tripathi, B0$, connects with the ramp this time around. Another bumper and Tripathi's both feet went up in the air as he helped it over the keeper for a maximum ",
        "timestamp": "2024-05-21 20:14:19",
        "over": "7.4 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Tripathi, B0$, I0$ lifter outside off, Tripathi looks for a ramp but that was well wide of his reach. Too high... ",
        "timestamp": "2024-05-21 20:13:21",
        "over": "7.4 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, 1 run, I0$ back of a length outside off, punched away to the left of deep backward point ",
        "timestamp": "2024-05-21 20:12:39",
        "over": "7.3 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Tripathi, 1 run, I0$ short of length outside off, Tripathi opens the bat face and steers it fine of third man ",
        "timestamp": "2024-05-21 20:11:56",
        "over": "7.2 over",
        "score": null
    },
    {
        "comms": "This is the second time SRH has lost four wickets inside the powerplay this season. They were 62/4 after 6 overs against RCB at Hyderabad.",
        "timestamp": "2024-05-21 20:11:14",
        "over": "- over",
        "score": null
    },
    {
        "comms": "This is the second time SRH has lost four wickets inside the powerplay this season. They were 62/4 after 6 overs against RCB at Hyderabad.",
        "timestamp": "2024-05-21 20:11:14",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, 1 run, I0$ short and wide of off, Klaasen drags the pull to the right of long-on ",
        "timestamp": "2024-05-21 20:11:14",
        "over": "7.1 over",
        "score": null
    },
    {
        "comms": " Narine to Klaasen, 1 run, shortish on off-stump, Klaasen punches it to the right of the bowler and Narine palms it away to the left of long-on ",
        "timestamp": "2024-05-21 20:09:51",
        "over": "6.6 over",
        "score": null
    },
    {
        "comms": " Narine to Tripathi, 1 run, fired in on leg stump, flicked away into the mid-wicket pocket ",
        "timestamp": "2024-05-21 20:09:25",
        "over": "6.5 over",
        "score": null
    },
    {
        "comms": " Narine to Klaasen, 1 run, flat outside off, punched down the ground to long-off ",
        "timestamp": "2024-05-21 20:08:57",
        "over": "6.4 over",
        "score": null
    },
    {
        "comms": " Narine to Klaasen, no run, short on off, punched back to the left of the bowler ",
        "timestamp": "2024-05-21 20:08:38",
        "over": "6.3 over",
        "score": null
    },
    {
        "comms": " Narine to Tripathi, 1 run, sits deep inside the crease and opens the bat face really late to dab the offbreak to the left of short third ",
        "timestamp": "2024-05-21 20:08:12",
        "over": "6.2 over",
        "score": null
    },
    {
        "comms": "B0$ \\n10 - Bhuvneshwar Kumar (13 inns) \\n9 - Mitchell Starc (12 inns)*  \\n8 - Vaibhav Arora (9 inns)*  \\n8 - Khaleel Ahmed (14 inns) \\n8 - Trent Boult (13 inns)",
        "timestamp": "2024-05-21 20:07:41",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Narine to Klaasen, 1 run, quicker on the stumps, Klaasen camps back and tucks it to the left of backward square ",
        "timestamp": "2024-05-21 20:07:41",
        "over": "6.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:07:37",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, 1 run, I0$ short outside off, Klaasen jumps on the back foot and guides it down to third man ",
        "timestamp": "2024-05-21 20:06:12",
        "over": "5.6 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, no run, bumper outside off at I0$, Klaasen looks to pull and gets beaten on the top-edge ",
        "timestamp": "2024-05-21 20:05:32",
        "over": "5.5 over",
        "score": null
    },
    {
        "comms": "B0$: Big Match and Starc is back !!!",
        "timestamp": "2024-05-21 20:04:42",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, no run, good length outside off, punched away to the left of extra cover ",
        "timestamp": "2024-05-21 20:04:42",
        "over": "5.4 over",
        "score": null
    },
    {
        "comms": " Harshit Rana to Klaasen, B0$, width on offer outside off, Klaasen opts for the drive and gets a thick outside edge that flies fine of the third man fence ",
        "timestamp": "2024-05-21 20:04:19",
        "over": "5.3 over",
        "score": null
    },
    {
        "comms": "Harshit Rana to Tripathi, 1 run, back of a length outside off, steered away to the left of backward point",
        "timestamp": "2024-05-21 20:04:16",
        "over": "5.2 over",
        "score": null
    },
    {
        "comms": "Harshit Rana to Tripathi, no run, good length outside off, Tripathi hops and punches to cover",
        "timestamp": "2024-05-21 20:04:13",
        "over": "5.1 over",
        "score": null
    },
    {
        "comms": "B0$ \\n-> Starc strikes in the first over, Head is clean bowled \\n-> Abhishek Sharma is gone early too, Arora gets his wicket \\n-> Tripathi survives an lbw scare, KKR don't review it \\n-> Mitchell Starc at his best, SRH reduced to 39/4 in 5 overs!",
        "timestamp": "2024-05-21 20:04:11",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:04:11",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Varun's blitz a bit late; could've been a T20 WC contender: Sehwag",
        "timestamp": "2024-05-21 20:02:25",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Shahbaz Ahmed, B0$ Bowled!! Mitch Starc is on fire. He's B1$ Bowls a pacy length delivery around off and Shahbaz's lack of feet on the poke meant he got a thick inside edge that flew back to dislodge the middle stump. A nothing shot and SRH are 4 down inside 5 overs. B2$ ",
        "timestamp": "2024-05-21 20:00:38",
        "over": "4.6 over",
        "score": null
    },
    {
        "comms": " Starc to Shahbaz Ahmed, B0$ Bowled!! ",
        "timestamp": "2024-05-21 20:00:35",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Shahbaz Ahmed, B0$ Bowled!! ",
        "timestamp": "2024-05-21 20:00:35",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 20:00:33",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Nitish Reddy, B0$ Caught by Gurbaz!! Too easy. Mitchell Starc has played enough cricket to understand what and when to bowl inside the powerplay. After trying out a few length balls, he goes for the bumper outside off. Cramps Nitish Reddy up for room and induces a thick top-edge that's been safely snaffled by the keeper to his left.  B1$ ",
        "timestamp": "2024-05-21 19:58:56",
        "over": "4.5 over",
        "score": null
    },
    {
        "comms": " Starc to Nitish Reddy, B0$ Caught!! ",
        "timestamp": "2024-05-21 19:58:55",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Nitish Reddy, no run, short of length outside off, Nitish Reddy gets up on his toes and punches to Andre Russell at backward point ",
        "timestamp": "2024-05-21 19:58:15",
        "over": "4.4 over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, 1 run, goes wide of the crease and angles it in on a length around off, Tripathi hops and nudges into the leg-side for a quick single ",
        "timestamp": "2024-05-21 19:57:41",
        "over": "4.3 over",
        "score": null
    },
    {
        "comms": " Starc to Nitish Reddy, 1 run, short of length outside off, Nitish Reddy opens the bat face and punches into the off-side ",
        "timestamp": "2024-05-21 19:56:59",
        "over": "4.2 over",
        "score": null
    },
    {
        "comms": "Starc to Nitish Reddy, B0$, one bounce and over the ropes! Nitish Reddy loves playing in pressure situations. A I0$ length ball from round the wicket, Nitish Reddy frees his arms and flays it up and over backward point for his first boundary",
        "timestamp": "2024-05-21 19:56:16",
        "over": "4.1 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Nitish Reddy, 1 run, 129ks good length on the stumps, flicked away to the right of mid-wicket and Nitish Reddy calls his partner through for a quick single. A B0$ ",
        "timestamp": "2024-05-21 19:54:41",
        "over": "3.6 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Nitish Reddy, B0$, full and angling away wide of off, Nitish Reddy looks to drive initially and decides to leave it at the last moment ",
        "timestamp": "2024-05-21 19:54:02",
        "over": "3.6 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Nitish Reddy, 2 runs, I0$ back of a length angled in at the hip, Nitish Reddy flicks it square on the leg-side and hustles real quick to complete the second ",
        "timestamp": "2024-05-21 19:53:23",
        "over": "3.5 over",
        "score": null
    },
    {
        "comms": "B0$ \\nInns: 14 \\nRuns: 277 \\nBalls: 144 \\nDismissals: 10 \\nAvg: 27.7 \\nSR: 192.4",
        "timestamp": "2024-05-21 19:52:36",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, 1 run, I0$ length delivery angled in on the stumps, Tripathi punches off the thick inside half to the left of mid-on ",
        "timestamp": "2024-05-21 19:52:36",
        "over": "3.4 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, no run, I0$ bumper on the stumps, Tripathi looks to pull and gets beaten on the top-edge ",
        "timestamp": "2024-05-21 19:51:57",
        "over": "3.3 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, B0$, B1$, oversteps and bowls a I0$ full delivery at the pads, Tripathi says thank you and whips it nonchalantly for a one-bounce boudnary over mid-wicket ",
        "timestamp": "2024-05-21 19:51:14",
        "over": "3.3 over",
        "score": null
    },
    {
        "comms": "B0$ For first time in this season, both SRH openers got out in the single-digit score",
        "timestamp": "2024-05-21 19:50:21",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, no run, I0$ back of a length delivery on the stumps, Tripathi jumps across and blocks ",
        "timestamp": "2024-05-21 19:50:21",
        "over": "3.2 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, 2 runs, advances and chips the length delivery over mid-off, more off the inside half but good enough to fetch him a couple of runs ",
        "timestamp": "2024-05-21 19:49:50",
        "over": "3.1 over",
        "score": null
    },
    {
        "comms": " Starc to Nitish Reddy, no run, short of length outside off, Nitish Reddy pushes it to the left of backward point ",
        "timestamp": "2024-05-21 19:48:46",
        "over": "2.6 over",
        "score": null
    },
    {
        "comms": " Starc to Nitish Reddy, no run, short and wide of off, Nitish Reddy doesn't bother with it ",
        "timestamp": "2024-05-21 19:48:12",
        "over": "2.5 over",
        "score": null
    },
    {
        "comms": " Starc to Nitish Reddy, no run, short and wide of off, Nitish Reddy doesn't bother with it ",
        "timestamp": "2024-05-21 19:48:12",
        "over": "2.5 over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, 1 run, oh dear! Looks like B0$ Starc wasn't sure and Shreyas Iyer wasn't convinced either. It B1$ Full inswinging toe-crusher from Starc, Tripathi was late in getting his bat down and the ball hit the boot before catching the inside edge. Starc went up in appeal, but didn't get a great deal of support frim the close-in fielders... ",
        "timestamp": "2024-05-21 19:47:34",
        "over": "2.4 over",
        "score": null
    },
    {
        "comms": "B0$ Will they go for the review? Oops! Nope. Shreyas Iyer has a chat with the bowler and decides against it....",
        "timestamp": "2024-05-21 19:46:29",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ \\nInns: 8  \\nRuns: 186  \\nAvg: 23.25  \\nSR: 164.6  \\nHS: 46",
        "timestamp": "2024-05-21 19:46:26",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, B0$, Tripathi is not gonna let the wickets column impact his shot-selection. He shuffles early, gets low and scoops a length delivery with decent timing past the leaping keeper to his left ",
        "timestamp": "2024-05-21 19:46:26",
        "over": "2.3 over",
        "score": null
    },
    {
        "comms": " Starc to Nitish Reddy, 1 run, full and swinging into the pads, Nitish Reddy flicks to the left of Narine at mid-wicket and a slight fumble enables a quick single ",
        "timestamp": "2024-05-21 19:45:49",
        "over": "2.2 over",
        "score": null
    },
    {
        "comms": " Starc to Nitish Reddy, B0$, length delivery swinging down leg, Nitish Reddy tries for a glance and misses ",
        "timestamp": "2024-05-21 19:45:06",
        "over": "2.2 over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, 1 run, pitched up swinging away outside off, Tripathi leans into the drive and hits it to the left of mid-off for a quick single ",
        "timestamp": "2024-05-21 19:44:18",
        "over": "2.1 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Nitish Reddy, no run, I0$ short just outside off, Nitish Reddy hops and fends it off the splice into the off-side ",
        "timestamp": "2024-05-21 19:43:16",
        "over": "1.6 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 19:43:12",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Vaibhav Arora to Abhishek Sharma, B0$ Caught by Russell!! Both SRH openers are back in the hut. KKR are off to a dream start with the ball. This length delivery stuck a little and didn't come as quickly as Abhishek expected. Tried to force the drive through the off-side and ends up slicing it off the top half towards cover where Dre Russ times his jump to absolute perfection to claim a well-judged catch above his head. B1$",
        "timestamp": "2024-05-21 19:41:34",
        "over": "1.5 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Abhishek Sharma, B0$ Caught!! ",
        "timestamp": "2024-05-21 19:41:31",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Abhishek Sharma, no run, good length outside off. Abhishek Sharma opens the bat face and punches to cover ",
        "timestamp": "2024-05-21 19:40:54",
        "over": "1.4 over",
        "score": null
    },
    {
        "comms": "B0$: Fun Fact: The Last time KKR qualified for the Playoffs (2021), Pat Cummins and Rahul Tripathi, were part of KKR Camp. Who can forget Tripathi's match winning six against DC in the final over to take KKR to the Final. Now both are on the opposite side !!",
        "timestamp": "2024-05-21 19:40:18",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Tripathi, 1 run, Tripathi hops across and taps the length delivery to the left of cover for a quick single ",
        "timestamp": "2024-05-21 19:40:18",
        "over": "1.3 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Abhishek Sharma, 1 run, back of a length outside off, guided away to the left of backward point ",
        "timestamp": "2024-05-21 19:39:19",
        "over": "1.2 over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Abhishek Sharma, B0$, jumps down the track looking to smash it down the ground, but the line is well wide from Vaibhav Arora ",
        "timestamp": "2024-05-21 19:39:02",
        "over": "1.2 over",
        "score": null
    },
    {
        "comms": "B0$ \\nInns: 7  \\nRuns: 99 \\nBalls: 48  \\nDismissals: 3  \\nAvg: 33.0 \\nSR: 206.2",
        "timestamp": "2024-05-21 19:38:02",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Vaibhav Arora to Abhishek Sharma, 2 runs, on a length wide of off stump, Abhishek Sharma cuts it to the right of sweeper cover ",
        "timestamp": "2024-05-21 19:38:02",
        "over": "1.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 19:37:56",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, B0$, short and wide of off, Tripathi leaps across and slaps it through backward point, the fielder there tried his best with an outstretched left hand, but only managed fingertips on that ",
        "timestamp": "2024-05-21 19:36:28",
        "over": "0.6 over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, B0$, short and wide of off, Tripathi leaps across and slaps it through backward point, the fielder there tried his best with an outstretched left hand, but only managed fingertips on that ",
        "timestamp": "2024-05-21 19:36:28",
        "over": "0.6 over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, no run, dug in short outside off, Tripathi lets it pass ",
        "timestamp": "2024-05-21 19:35:48",
        "over": "0.5 over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, B0$, gee, he just pushed at it. Too full and veering away outside off, Tripathi squeezes it by bringing the bat down at the right time and it beats the diving fielder to his left at backward point ",
        "timestamp": "2024-05-21 19:35:07",
        "over": "0.4 over",
        "score": null
    },
    {
        "comms": "B0$ \\n0(1) vs PBKS (bowled Arshdeep SIngh)  \\n0(2) vs KKR (bowled Mitchell Starc)*",
        "timestamp": "2024-05-21 19:34:28",
        "over": "- over",
        "score": null
    },
    {
        "comms": " Starc to Tripathi, no run, mild appeal for leg before but there's a B0$ Starc gets this full delivery to nip back late around off and Tripathi manages to get inside edge onto pad on the attempted push ",
        "timestamp": "2024-05-21 19:34:28",
        "over": "0.3 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 19:34:18",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Starc to Head, B0$ Bowled!! Knocks him over with an absolute beauty. Bowled first ball in the previous game and now the second ball. Full ball getting a hint of late outward movement around off. Head was in no mood to hang around, looks to force it down the ground and leaves enough bat-pad gap for the ball to sneak through and smash middle and off.  B1$",
        "timestamp": "2024-05-21 19:32:22",
        "over": "0.2 over",
        "score": null
    },
    {
        "comms": " Starc to Head, B0$ Bowled!! ",
        "timestamp": "2024-05-21 19:32:21",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Starc to Head, no run, oh dear! Shreyas missed the direct hit at the bowling end, but reckon B0$ It was driven firmly to the right of cover and the KKR skipper was alert enough to target the right end...",
        "timestamp": "2024-05-21 19:31:31",
        "over": "0.1 over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 19:31:13",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 19:31:13",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Right! The fireworks go up as the players stride out to the centre. Shreyas Iyer having a conflab with Starc and Rinku regarding field placements. As ever, the swinging Mitch Starc to kickstart proceedings with the new ball. B0$ Off we go...",
        "timestamp": "2024-05-21 19:27:59",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ (On the excitement of playing in the playoffs) As an individual, it happens a lot but the way the environment is in the team, we all are taking it as a next game and it’s a special thing of a champion team. We knew our roles very well from the start, we decided to play aggressive cricket and dominate be it in batting or bowling. The management is really supportive and that helps us to play our natural game. It feels good to watch their match as they have a very competitive team, they are without one of their players so that can be an advantage for us as we are playing with the same combination. It’s mixed soil, black and red and that suits our team, whenever we come to Ahmedabad it’s usually a high-scoring game.",
        "timestamp": "2024-05-21 19:18:55",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 19:09:15",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$Anukul Roy, Manish Pandey, Nitish Rana, KS Bharat, Sherfaine Rutherford",
        "timestamp": "2024-05-21 19:08:03",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Sanvir Singh, Umran Malik, Glenn Phillips, Washington Sundar, Jaydev Unadkat",
        "timestamp": "2024-05-21 19:07:57",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 19:07:07",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ (Playing XI): Rahmanullah Gurbaz(w), Sunil Narine, Venkatesh Iyer, Shreyas Iyer(c), Rinku Singh, Andre Russell, Ramandeep Singh, Mitchell Starc, Vaibhav Arora, Harshit Rana, Varun Chakaravarthy",
        "timestamp": "2024-05-21 19:07:06",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ (Playing XI): Travis Head, Abhishek Sharma, Rahul Tripathi, Nitish Reddy, Heinrich Klaasen(w), Abdul Samad, Shahbaz Ahmed, Pat Cummins(c), Bhuvneshwar Kumar, Vijayakanth Viyaskanth, T Natarajan",
        "timestamp": "2024-05-21 19:07:03",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ I would have loved to bowl. I had a chat with the curator and he said it's a mixed soil, let's see how it plays, hoping for a good game. Important that we keep the momentum going and stay in the present. Great achievement (finising at the top of the table) and everyone is proud of it, we are taking one match at a time and we need to be positive about what's going to happen here. We are going with the B1$",
        "timestamp": "2024-05-21 19:01:52",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ We gonna have a bat, looks like a good wicket and expect a high-scoring game. The batting group has been amazing for us and hopefully more of the same tonight. We are playing pretty much the B1$.",
        "timestamp": "2024-05-21 19:00:53",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-21 18:55:20",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Cricbuzz Live Hindi: Qualifier 1, Kolkata v Hyderabad, Pre-match show",
        "timestamp": "2024-05-21 18:49:48",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Feeling very good, I think we have been having a tremendous season, this is where all the teams strive to reach, we have a good thing going, I hope tonight we can keep playing some good positive cricket. (Having not played a game after 11th May due to inclement weather) We are still focused, we have no control over the weather, we were prepared to play warm-up and everything, the energy was still there. It looks like it’s going to be an amazing night tonight, no weather around, we are ready to play some cricket. I’m in good nick, I have been hitting the ball well, I missed out on a few innings where I could have pushed the score more. With the balance in the team, it gives me the confidence to go out and play my shots. We have Rinku and Ramandeep behind, who can hit sixes and do what I do, it gives me freedom. Bowling as well, I’m happy to come on when the captain needs me and I’m doing a decent job with the ball. We have done some homework and we need to keep things simple. When you are under the pump as a bowling group, the opponent want you to try too many things and with a six-hitting team like this, they expect you to do something different. Once we stick to our lengths, big ground here tonight, we are going to utilise as much as we can and restrict them.",
        "timestamp": "2024-05-21 18:49:48",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ The outfield is green and lush. The square boundaries are 63 metres each while it is 70 metres down the ground. The pitch looks a touch dry. Will suit bowlers who will use the off-pace deliveries. In some areas, around the good length, there's a bit of moisture, but it is hard. The power-hitters will play a major role here, looks like a good batting wicket. Won't spin much, reckons Matthew Hayden.",
        "timestamp": "2024-05-21 18:37:59",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Mayank Agarwal received a flying kiss from Harshit Rana. That's how most SRH fans would like to remember, as the contest saw both teams pushed into a nervy corner for most parts of the game. In the end, when SRH had a mountain to climb in the last 4 overs, Klaasen went berserk and nearly pulled off the chase for his side. Inexperienced and under pressure, Harshit Rana didn't panic as he bowled a splendid final over to help his side get off to a winning start to the season. It was that victory that started KKR's rise and they barely looked back after that, with 9 wins from 14 games (2 were washed out).",
        "timestamp": "2024-05-21 18:15:12",
        "over": "- over",
        "score": null
    },
    {
        "comms": "Standing in their way are the men from the city of joy, the B0$. A team that has a rich history of making 6 playoffs from 8 seasons (2011-2018). Quite interestingly, KKR never finished at the bottom of the table and to put the icing on the cake, this is the first team they finished number one on the table in their history. And a reminder that, this is only their second entry into playoffs in the last 6 seasons. The last time they made it to the playoffs, they reached the IPL final only to end runners up to CSK. Can they go one step better this time around and bring home their 3rd title? It's been 10 years since they won the trophy. And the \"I0$\" fans have an extra reason to cheer this season. Gautam Gambhir, the mentor of KKR. His association with the franchise holds a special slot for every Purple fan. Is this the season for KKR?",
        "timestamp": "2024-05-21 18:06:27",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ - The mood of all SRH fans over the last three years. While the fact that their franchise didn't make it to the playoffs stung real hard, it's the 'I0$' tag (2021 & 2023) that left the biggest scar. How could a franchise that once had a history of \"five successive playoff seasons\" sink that low? David Warner controversy. Change of captaincy. Change of coaches. Change of jersey. Team going from bad to worse with each passing season. It surely wasn't a pleasant phase for any Sunrisers' fan. And here comes the best part. Despite all those lows, the fans turned in great numbers this season in Hyderabad and rallied behind the team like those 3 years never existed. One of the promising superstars of Indian cricket, Abhishek Sharma, was so moved (acknowledged it on SM) by the support he received from the SRH fans, that he along with many other players made sure they offered something in return for the fans by B1$ (one game was a washout) home games this year. Now that they made it to the playoffs, how about winning the qualifier 1 and claim the \"finals slot\" for the third time in their 12-year history?",
        "timestamp": "2024-05-21 17:57:22",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Hello, there? We have officially entered the B1$ in the IPL. This territory is quite slippery, mind, and teams that blink will have to pay a heavy price. It's I0$ phase of the tournament where players' mental strength and management's composure gain greater attention than ever. Righto! Time to switch on the crunch-gear, then I1$",
        "timestamp": "2024-05-21 17:50:01",
        "over": "- over",
        "score": null
    },
    {
        "comms": "IPL 2024 | Kolkata v Hyderabad: Qualifier 1 Preview",
        "timestamp": "2024-05-20 19:42:08",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ by B1$ \\n \\nAhmedabad has been burning and boiling, with the mercury soaring above 45 degrees celsius lately, but amusingly enough, that may not be all bad news. With a slew of recent Indian Premier League matches affected by rain, the current trend of scorching heat is unlikely to be unwelcomed by those associated with the IPL. Ironically, it may offer a refreshing relief to the two remaining teams at the venue. \\n \\nThe weather forecast for both Tuesday and Wednesday, when Qualifier 1 and the Eliminator will be played, is for more of the same sweltering heat, ensuring the matches proceed without interruption. According to the local Meteorological Department, the weather will be 'hot with plenty of sun' - a massive understatement of the season. The heat has been both infernal and searing. But just try asking the Kolkata Knight Riders, who experienced two consecutive washouts, including one at the Narendra Modi Stadium on May 13. They may not mind the heat. \\n \\nHeading into a crucial fixture, the Knight Riders, two-time champions who finished at the top of the points table for the first time in 17 seasons, are short on match practice, having last played a full 40-over game on May 5. This could be a concern for Shreyas Iyer's side, who have engineered and pioneered a new approach to the IPL, almost similar to the style of their opponents, Sunrisers Hyderabad, in Qualifier 1. Both teams have redefined the game with a high-risk, no-holds-barred, take-no-prisoners attitude. \\n \\nThus, it will be a clash of two bold, fearless, in-form teams with a slight edge tilted towards the Hyderabad side, who are also looking for their third IPL championship. Kolkata have their season's regular opener, Phil Salt, who combined well with other opener Sunil Narine, missing since the Englishman has left for home for national duties. Narine may partner Rahmanullah Gurbaz in the game. The Afghan is yet to hit a ball in a game this season. \\n \\nOn the other hand, SRH's go-for-broke opening combination of Travis Head and Abhishek Sharma is very much intact. Strange things have certainly happened in cricket, particularly in the IPL, but the success or failure of the opening combinations of the sides could determine the result of the game. \\n \\nThen there is this bowling factor that gives Pat Cummins's side some advantage. The Hyderabad team has largely depended on its pacers - T Natarajan, Bhuvneshwar Kumar and Cummins himself with Jaydev Unadkat and Marco Jansen to fall back on - and the Narendra Modi Stadium has mostly aided the pacers. The Knight Riders' arsenal has been their spinners, chiefly Narine and Varun Chakaravarthy. \\n \\nA big plus for Hyderabad has been that Bhuvneshwar Kumar, who opens the attack, had been off colour initially but has found his mojo in the second half of the league while the Knight Riders have not exactly had their spearhead, Mitchell Starc, firing on all cylinders. Kolkata will need Starc (12 wickets in 11 innings), the costliest buy in the IPL history, to come to the party. If that's not enough, KKR need to be wary of the happy memories that Cummins and Head have at this venue - of winning the ODI World Cup last year. \\n \\nBut the only issue that may not work for SRH is the neutrality in the stands. Cummins had famously said before the World Cup final last year that nothing is more satisfying than silencing 1.3 lakh people. There may be as many people on Tuesday night as well, but they may not support the opposition as fervently as they did on November 19, 2023. \\n \\nB2$ Kolkata Knight Riders vs SunRisers Hyderabad, IPL 2024, May 21, 19:30 IST \\n \\nB3$ Narendra Modi Stadium, Ahmedabad \\n \\nB4$ It is not a do-or- die game but neither team wants to be in that situation as a defeat will put them there. With the pitch expected to assist the batters, it will be a high-scoring game with the captain winning the toss choosing to field, as most captains have done this season. \\n \\nB5$ KKR 17 - 9 SRH. The Knight Riders have been even more dominating since 2020, having won seven of their nine face-offs. The playoffs records of the two sides are almost similar, with KKR winning eight and losing five while SRH have won 5 and lost six. \\n \\nB6$ \\n \\nB7$ \\n \\nB8$ All players, barring Phil Salt, are available. \\n \\nB9$ Travis Head and Abhishek Sharma are among the rare few batters who have enjoyed an upperhand in the battle against Sunil Narine. The veteran spinner could be held back to be utilised in the middle and late overs in a bid to control Heinrich Klassen, who enjoys a favourable matchup against the other KKR spinner - Varun Chakravarthy. \\n \\nAndre Russell has dismissed Abhishek twice in 10 balls, and conceded only 11 runs. Don't be surprised if the West Indian has an early go against the in-form southpaw \\n \\nB10$ Rahamanullah Gurbaz (wk), Sunil Narine, Angkrish Raghuvanshi/Nitish Rana, Shreyas Iyer (c), Venkatesh Iyer, Rinku Singh, Andre Russell, Ramandeep Singh , Mitchell Starc, Harshit Rana, Varun Chakaravarthy [Impact substitute: Vaibhav Arora] \\n \\nB11$ \\n \\nB8$ They have a clean slate on this front \\n \\nB9$ Andre Russell hasn't enjoyed a high-scoring rate in Ahmedabad, striking at just under 140 in four innings at the venue. SRH bowlers will look to force him to hit towards the long square boundaries \\n \\nB10$ Travis Head, Abhishek Sharma, Nitish Reddy, Rahul Tripathi, Heinrich Klaasen (wk), Abdul Samad, Shahbaz Ahmed, Pat Cummins (c), Sanvir Singh, Bhuvneshwar Kumar, Vijayakanth Viyaskanth [Impact substitute: T Natarajan] \\n \\nB15$ \\n \\n- Sunil Narine is yet to score a run in an IPL game in Ahmedabad, having been dismissed thrice on ducks previously \\n \\n- In the four IPL matches Andre Russell has played in Ahmedabad, he hasn't picked up a wicket \\n \\n- Bhuvneshwar Kumar has snapped nine wickets in three games in Ahmedabad, and conceded at less than run-a-ball",
        "timestamp": "2024-05-20 19:42:08",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$",
        "timestamp": "2024-05-20 19:42:08",
        "over": "- over",
        "score": null
    },
    {
        "comms": "B0$ Squad: Travis Head, Abhishek Sharma, Rahul Tripathi, Nitish Reddy, Heinrich Klaasen(w), Shahbaz Ahmed, Abdul Samad, Sanvir Singh, Pat Cummins(c), Bhuvneshwar Kumar, Vijayakanth Viyaskanth, T Natarajan, Umran Malik, Glenn Phillips, Washington Sundar, Jaydev Unadkat, Mayank Agarwal, Aiden Markram, Anmolpreet Singh, Upendra Yadav, Mayank Markande, Jhatavedh Subramanyan, Fazalhaq Farooqi, Marco Jansen, Akash Maharaj Singh",
        "timestamp": "2024-05-20 19:42:06",
        "over": "- over",
        "score": null
    }
]