[
    {
        "message": "The team is walking onto the field to start the match. It is a large and passionate crowd.",
        "start_time": "0:03:00",
        "end_time": "0:03:10"
    },
    {
        "message": "The players are acknowledging the crowd and are visibly excited to start the game.",
        "start_time": "0:03:10",
        "end_time": "0:03:20"
    },
    {
        "message": "The players are greeting each other and sharing some lighthearted moments before the match.",
        "start_time": "0:03:20",
        "end_time": "0:03:30"
    },
    {
        "message": "A group of players in green jerseys with the words \"1XBET\" on their shirts are walking off the field. The commentators are talking about the road safety week series and the importance of raising awareness about road safety.",
        "start_time": "0:03:30",
        "end_time": "0:03:40"
    },
    {
        "message": "A person in the crowd is wearing a wig with red, blue, and yellow hair. The wig is on top of their bare head. The person is waving the Indian flag in the crowd. The commentators are still talking about the importance of road safety.",
        "start_time": "0:03:40",
        "end_time": "0:03:50"
    },
    {
        "message": "The crowd is waving the Indian flag.  They are very excited and cheering. The commentators are talking about the number of road accidents that take place all over India.",
        "start_time": "0:03:50",
        "end_time": "0:04:00"
    },
    {
        "message": "The match is taking place in India and the crowd is cheering. Two umpires, Rajesh Deshpande and Virender Kumar are walking towards the pitch.",
        "start_time": "0:04:00",
        "end_time": "0:04:10"
    },
    {
        "message": "The umpires are walking towards the pitch and the crowd is cheering. They are going to officiate the match.",
        "start_time": "0:04:10",
        "end_time": "0:04:20"
    },
    {
        "message": "The umpires are walking towards the pitch with a trophy in the middle of the walkway. They are going to officiate the match.",
        "start_time": "0:04:20",
        "end_time": "0:04:30"
    },
    {
        "message": "The two teams met last year. India batted first and scored 204 for 3. Suchint Tendulkar led the way with 60 off 37. He also picked up a couple of wickets. In the end, South Africa won this match.",
        "start_time": "0:04:30",
        "end_time": "0:04:40"
    },
    {
        "message": "Two of the Durban Super Giants players are having a conversation with each other. They had only managed to post 148 runs and they're looking to set a bigger total.",
        "start_time": "0:04:40",
        "end_time": "0:04:50"
    },
    {
        "message": "Two players in blue are walking onto the field, with fireworks going off around them, to start their batting innings. One player has a helmet on, the other doesn't, both have bats.",
        "start_time": "0:04:50",
        "end_time": "0:05:00"
    },
    {
        "message": "Two players are walking towards the pitch, and one of them is wearing pads. They're getting ready to bat.",
        "start_time": "0:05:00",
        "end_time": "0:05:10"
    },
    {
        "message": "The players are walking out to the field. They are ready to start their innings.",
        "start_time": "0:05:10",
        "end_time": "0:05:20"
    },
    {
        "message": "The players are talking to each other. They are getting ready for the match. The commentator is talking about Sachin Tendulkar, who recently retired from international and first-class cricket. He says that he is active in the scene. He has played well in the legend series, and the people are here to watch him bat.",
        "start_time": "0:05:20",
        "end_time": "0:05:30"
    },
    {
        "message": "A wide shot of the stadium. Sachin Tendulkar's T20 career stats are displayed on the screen. The commentator says that he is one cricketer who always prepares, and he is sure he has done that even for this season,  even for the road safety",
        "start_time": "0:05:30",
        "end_time": "0:05:40"
    },
    {
        "message": "The score is 114 for 5 wickets lost. The batsman is playing a defensive shot. The bowler is bowling a good length delivery and the batsman is waiting for a good ball to hit.",
        "start_time": "0:05:40",
        "end_time": "0:05:50"
    },
    {
        "message": "The batsman is playing a defensive shot. The bowler is bowling a good length delivery and the batsman is waiting for a good ball to hit.",
        "start_time": "0:05:50",
        "end_time": "0:06:00"
    },
    {
        "message": "The batsman is playing a defensive shot. The bowler is bowling a good length delivery and the batsman is waiting for a good ball to hit.",
        "start_time": "0:06:00",
        "end_time": "0:06:10"
    },
    {
        "message": "The batsman has scored 118 runs and has a best of 94. He has been playing in cricket tournaments. The commentary is highlighting the player's career statistics.",
        "start_time": "0:06:10",
        "end_time": "0:06:20"
    },
    {
        "message": "A player is shown in the video, getting ready to bat. The commentary is saying he is in form.",
        "start_time": "0:06:20",
        "end_time": "0:06:30"
    },
    {
        "message": "Garnett Kruger, the bowler, is shown walking towards the pitch. The commentator is talking about how Kruger loves to get on the field.",
        "start_time": "0:06:30",
        "end_time": "0:06:40"
    },
    {
        "message": "The first ball is bowled by Garnett Kruger to the batsman, Stuart Binny.  Kruger bowls a straight ball, Stuart Binny defends the ball.  The score remains 0 runs for 0 wickets.",
        "start_time": "0:06:40",
        "end_time": "0:06:50"
    },
    {
        "message": "Garnett Kruger bowls the second ball, the ball goes down the leg side, Binny  doesn't go for the shot, The score remains 0 runs for 0 wickets.",
        "start_time": "0:06:50",
        "end_time": "0:07:00"
    },
    {
        "message": "The score remains 0 runs for 0 wickets.",
        "start_time": "0:07:00",
        "end_time": "0:07:10"
    },
    {
        "message": "The score is 1 - 0. The batsman on strike is N Ojha and the non-striker is Sachin Tendulkar. The bowler is Kruger. A pretty attacking field set here by the South African Legends.",
        "start_time": "0:07:10",
        "end_time": "0:07:20"
    },
    {
        "message": "The first ball of the match is bowled by Kruger to Ojha.  It's a wide delivery and Ojha has no shot at it. The umpire signals a wide ball.",
        "start_time": "0:07:20",
        "end_time": "0:07:30"
    },
    {
        "message": "This is match one of season two.  It's a big game: India Legends versus South Africa Legends.  ",
        "start_time": "0:07:30",
        "end_time": "0:07:40"
    },
    {
        "message": "The batsman is standing at the crease. The bowler is running in to bowl. The bowler bowls a good line and length ball, the batsman leaves the ball and the score is 0-1 after 0.1 overs.",
        "start_time": "0:07:40",
        "end_time": "0:07:50"
    },
    {
        "message": "The bowler is looking intense, he is putting a lot of effort to get the batsman out.  The batsman is still at the crease. The score is still 0-1 after 0.1 overs.",
        "start_time": "0:07:50",
        "end_time": "0:08:00"
    },
    {
        "message": "The bowler is running in to bowl again, he bowls a good ball, the batsman leaves the ball. The score is still 0-1 after 0.1 overs.",
        "start_time": "0:08:00",
        "end_time": "0:08:10"
    },
    {
        "message": "The score is 0-0 for South Africa legends after 0.2 overs. The batsman is  Kruger and the bowler is Ojha. Ojha is bowling a right arm off-break and has gotten into a good rhythm.",
        "start_time": "0:08:10",
        "end_time": "0:08:20"
    },
    {
        "message": "The batsman, Kruger, is facing the bowler, Ojha.  Ojha is bowling a right arm off break.  The score is 0-0 for South Africa legends after 0.2 overs.",
        "start_time": "0:08:20",
        "end_time": "0:08:30"
    },
    {
        "message": "The score is 0-0 for South Africa legends after 0.2 overs. The batsman is  Kruger and the bowler is Ojha. The batsman Kruger and the bowler, Ojha, both are right hand batsman.",
        "start_time": "0:08:30",
        "end_time": "0:08:40"
    },
    {
        "message": "The batsman Kruger is on strike. The bowler is Jonty Rhodes. The score is 0-1. The over is 0.3. Jonty Rhodes bowls a wide ball, the batsman hits a cut shot towards the point region, a fielder dives to his left but the ball goes for a wide. ",
        "start_time": "0:08:40",
        "end_time": "0:08:50"
    },
    {
        "message": "The batsman Kruger is on strike. The bowler is Jonty Rhodes. The score is 0-1. The over is 0.3. Jonty Rhodes bowls a slower ball, the batsman Kruger hits a cut shot to the point region, the fielder Jonty Rhodes dives to his left but the ball goes for four runs. ",
        "start_time": "0:08:50",
        "end_time": "0:09:00"
    },
    {
        "message": "The batsman Kruger is on strike. The bowler is Jonty Rhodes. The score is 0-5. The over is 0.3. Jonty Rhodes bowls a delivery outside off, the batsman plays a defensive shot. Jonty Rhodes bowls another delivery, the batsman plays a defensive shot. ",
        "start_time": "0:09:00",
        "end_time": "0:09:10"
    },
    {
        "message": "The batsman plays a shot that goes for a boundary. The score is now 4 - 0. The batsman, N Ojha, is on 4 runs, and the bowler, Kruger, has bowled 0.4 overs.",
        "start_time": "0:09:10",
        "end_time": "0:09:20"
    },
    {
        "message": "The batsman, N Ojha, is on strike. The bowler bowls a short delivery. The batsman pulls the ball towards deep square leg. The ball goes for a boundary. The score is now 5 - 0. The batsman, N Ojha, is on 4 runs, and the bowler, Kruger, has bowled 0.4 overs.",
        "start_time": "0:09:20",
        "end_time": "0:09:30"
    },
    {
        "message": "The batsman is on strike. The bowler bowls a short delivery. The batsman pulls the ball towards deep square leg. The ball goes for a boundary. The score is now 5 - 0. The batsman, N Ojha, is on 4 runs, and the bowler, Kruger, has bowled 0.4 overs.",
        "start_time": "0:09:30",
        "end_time": "0:09:40"
    },
    {
        "message": "The batsman hits the ball towards the fine leg and the fielder is moving to square leg to field the ball. There are only 3 fielders outside the 30-yard circle. The current score is 5-0 and India Legends are batting first. It is the 0.4th over.",
        "start_time": "0:09:40",
        "end_time": "0:09:50"
    },
    {
        "message": "The bowler bowls a delivery just outside off stump and the batsman hits the ball to the leg side and the fielder is out on the leg side. The batsman hits a shot towards the off side and it is a boundary. There are only 3 fielders outside the 30-yard circle. The current score is 5-4 and India Legends are batting first. It is the 0.4th over.",
        "start_time": "0:09:50",
        "end_time": "0:10:00"
    },
    {
        "message": "The bowler is about to bowl. He bowls a delivery and the batsman hits the ball back to the bowler who then throws the ball to the wicketkeeper.  The current score is 5-4 and India Legends are batting first. It is the 0.4th over.",
        "start_time": "0:10:00",
        "end_time": "0:10:10"
    },
    {
        "message": "The score is 5-0. The bowler Kruger bowls a wide ball. The batsman is Tendulkar and is looking to hit the ball off of the back foot.",
        "start_time": "0:10:10",
        "end_time": "0:10:20"
    },
    {
        "message": "The bowler, Kruger, bowls a much better line. Tendulkar hits a four by hitting the ball off of the pads through the leg side. The crowd goes wild and the players on the bench react positively.",
        "start_time": "0:10:20",
        "end_time": "0:10:30"
    },
    {
        "message": "The score is now 0-4 in favour of India Legends. The commentators discuss how Kruger started off poorly, but ended the over in a good fashion. ",
        "start_time": "0:10:30",
        "end_time": "0:10:40"
    },
    {
        "message": "The score is 9-0, the first over is done, India Legends are batting, the bowler Kruger bowled two boundaries in the first over.",
        "start_time": "0:10:40",
        "end_time": "0:10:50"
    },
    {
        "message": "Tendulkar is at the crease and he is talking to his partner. The next bowler is Botha, the score is still 9-0.",
        "start_time": "0:10:50",
        "end_time": "0:11:00"
    },
    {
        "message": "The bowler is Botha and he is talking to the wicketkeeper, the score is still 9-0 and the over is yet to start.",
        "start_time": "0:11:00",
        "end_time": "0:11:10"
    },
    {
        "message": "The batsman is facing the bowler. The bowler is running in to bowl. The bowler bowls the ball. The batsman hits the ball to the offside. It's a dot ball. The score is still 0-0 in the 1st over. The bowler is running in to bowl again.",
        "start_time": "0:11:10",
        "end_time": "0:11:20"
    },
    {
        "message": "A woman in a white shirt and a turban is sitting in the stands. She is watching the game. The game is continuing. The bowler is running in to bowl again. The batsman hits the ball to the offside. It's another dot ball. The score is still 0-0 in the 1st over.",
        "start_time": "0:11:20",
        "end_time": "0:11:30"
    },
    {
        "message": "The woman in the stands is still watching the game. The bowler is running in to bowl again. The batsman hits the ball to the off-side. It's another dot ball. The score is still 0-0 in the 1st over. The bowler is running in to bowl again.",
        "start_time": "0:11:30",
        "end_time": "0:11:40"
    },
    {
        "message": "The score is 9-0, first over, India Legends are batting. The bowler is Johan Botha, a right-arm off break bowler. He's playing in this world series event for the first time. It was his debut against India way back in 2005. He's a very handy crafty off spinner and the batsman is Sachin Tendulkar who has experience of playing in various leagues. The bowler bowls a ball and Tendulkar tries to hit a cover drive, the ball is deflected by the fielder.",
        "start_time": "0:11:40",
        "end_time": "0:11:50"
    },
    {
        "message": "Sachin Tendulkar is up against Johan Botha. Sachin hits the ball with a booming cover drive which is deflected by the fielder for 1 run. The score is now 9-1.",
        "start_time": "0:11:50",
        "end_time": "0:12:00"
    },
    {
        "message": "The replay shows Sachin's shot. He timed it perfectly.",
        "start_time": "0:12:00",
        "end_time": "0:12:10"
    },
    {
        "message": "The score is 14-0, South African Legends are batting. The bowler is N. Ojha and the batsman is Botha. Botha missed the off-drive shot as the ball missed the bat completely. The ball went for a wide and the score is now 14-0. The score is 14-0, South African Legends are batting. The bowler is N. Ojha and the batsman is Botha. Botha missed the off-drive shot as the ball missed the bat completely. The ball went for a wide and the score is now 14-0.",
        "start_time": "0:12:10",
        "end_time": "0:12:20"
    },
    {
        "message": "The score is 14-0, South African Legends are batting. The bowler is N. Ojha and the batsman is Botha. The ball was hit in the direction of the keeper, which was a tough catch for him. It is a wide ball and the score is 14-0. The score is 14-0, South African Legends are batting. The bowler is N. Ojha and the batsman is Botha. The ball was hit in the direction of the keeper, which was a tough catch for him. It is a wide ball and the score is 14-0.",
        "start_time": "0:12:20",
        "end_time": "0:12:30"
    },
    {
        "message": "The score is 14-0, South African Legends are batting. The bowler is N. Ojha and the batsman is Botha. The bowler bowled the ball and it was a couple of wides.  The score is 14-0, South African Legends are batting. The bowler is N. Ojha and the batsman is Botha. The bowler bowled the ball and it was a couple of wides.  ",
        "start_time": "0:12:30",
        "end_time": "0:12:40"
    },
    {
        "message": "The bowler bowls a ball that goes down the leg side. The keeper is unable to collect the ball. The score is 14-0 with 1.1 overs bowled and  Tendulkar is on 0 runs.",
        "start_time": "0:12:40",
        "end_time": "0:12:50"
    },
    {
        "message": "The batsman, Tendulkar hits the ball for a six. The bowler is unhappy with the shot. The score is now 14-0 with 1.2 overs bowled. Tendulkar is now on 6 runs.",
        "start_time": "0:12:50",
        "end_time": "0:13:00"
    },
    {
        "message": "The batsman walks off the pitch, still looking to get off the mark. He is the type of player who can catch up quite easily.",
        "start_time": "0:13:00",
        "end_time": "0:13:10"
    },
    {
        "message": "Sachin Tendulkar is at the crease, the score is 14-0, and it is the second ball of the first over. Tendulkar tries to tuck the ball away but it is going onto his pads. It is going to be an inside edge and the umpire is going to call it leg by. It is a leg bye. Tendulkar has gotten off the mark now.",
        "start_time": "0:13:10",
        "end_time": "0:13:20"
    },
    {
        "message": "The score is 15-0, it is the third ball of the first over. Tendulkar has played a big inside edge, and the ball is dribbling out to the off-side.",
        "start_time": "0:13:20",
        "end_time": "0:13:30"
    },
    {
        "message": "Tendulkar is ready for another ball. The score is 15-0 and it is the third ball of the first over. Tendulkar has played a big inside edge and the ball is dribbling out to the off-side.",
        "start_time": "0:13:30",
        "end_time": "0:13:40"
    },
    {
        "message": "The batsman Johan Botha hits a shot on the off side and tries to take a run. He is just about to reach the crease as the ball is picked up by the fielder.  He tries to dive and the ball just manages to get past his fingertips. The score is still 0 for 0 in 0.4 overs.",
        "start_time": "0:13:40",
        "end_time": "0:13:50"
    },
    {
        "message": "The batsman Johan Botha tries to hit the ball, but it is a bit too high for him to hit cleanly. He gets a bit of bat on the ball, but it goes straight back to the bowler. The bowler tries to run him out, but the batsman is able to make it back safely. The score is still 0 for 0 in 0.4 overs.",
        "start_time": "0:13:50",
        "end_time": "0:14:00"
    },
    {
        "message": "The batsman Johan Botha is on strike. The bowler is running in to bowl the ball, it is a slow off spin, it is a very strong ball in terms of length and it goes straight to the fielder at the off side. This means the batsman is going to have to pitch it up and bowl a bit further out of the off stump.",
        "start_time": "0:14:00",
        "end_time": "0:14:10"
    },
    {
        "message": "The batsman,  Botha,  is facing the bowler,  Ojha.  Ojha bowls the ball.  The batsman plays a booming cover drive. The ball goes to the boundary for four runs. The score is 15-0, after 0.5 overs.",
        "start_time": "0:14:10",
        "end_time": "0:14:20"
    },
    {
        "message": "The batsman,  Botha,  is facing the bowler, Ojha. Ojha bowls the ball. The batsman plays a shot. The ball goes to the boundary for four runs.  The score is now 19-0 after 0.5 overs. ",
        "start_time": "0:14:20",
        "end_time": "0:14:30"
    },
    {
        "message": "The batsman, Botha, is facing the bowler, Ojha. Ojha bowls the ball. The batsman plays a shot. The ball goes to the boundary for four runs.  The score is now 23-0 after 1 over. ",
        "start_time": "0:14:30",
        "end_time": "0:14:40"
    },
    {
        "message": "The score is 20-0, India Legends are batting and the current batsman is Botha. He's on 0 runs,  it's the first over and the first ball of the over. The bowler, N. Ojha, bowls a wide delivery. Botha leaves the ball and it's a wide ball. The score is 20-1 now.",
        "start_time": "0:14:40",
        "end_time": "0:14:50"
    },
    {
        "message": "The bowler N. Ojha starts with a delivery on the right line. The batsman Botha leaves the ball and it's the second ball of the over. The score is 20-1. The bowler is still looking to get a good line and length.",
        "start_time": "0:14:50",
        "end_time": "0:15:00"
    },
    {
        "message": "Botha plays a cut shot and gets a single on the third ball of the over. The score is 20-2. He seems to be playing with confidence.",
        "start_time": "0:15:00",
        "end_time": "0:15:10"
    },
    {
        "message": "The score is 22-0. Two overs are completed. The batsmen are N. Ojha and Sachin Tendulkar.  Ojha is on 14 runs and Tendulkar is on 1 run. ",
        "start_time": "0:15:10",
        "end_time": "0:15:20"
    },
    {
        "message": "The score is 22-0. Two overs are completed. The batsmen are N. Ojha and Sachin Tendulkar.  Ojha is on 14 runs and Tendulkar is on 1 run. ",
        "start_time": "0:15:20",
        "end_time": "0:15:30"
    },
    {
        "message": "The score is 22-0. Two overs are completed. The batsmen are N. Ojha and Sachin Tendulkar.  Ojha is on 14 runs and Tendulkar is on 1 run. The India Legends batting order is shown, with Ojha and Tendulkar as the opening batsmen. The scorecard shows the number of overs bowled, the extras scored and the runs scored by each batsman. ",
        "start_time": "0:15:30",
        "end_time": "0:15:40"
    },
    {
        "message": "The match is between India Legends and South African Legends. India Legends have won the toss and decided to bat first. The score is 22-0, after two overs. N. Ojha is on 14 and Sachin Tendulkar is on 1. The bowler is Kruger, he has bowled 1 over and given 1 run. The first ball is bowled.  Sachin Tendulkar is at the crease facing the bowler.",
        "start_time": "0:15:40",
        "end_time": "0:15:50"
    },
    {
        "message": "The bowler bowls a delivery outside off stump and Sachin Tendulkar leaves it. The ball goes through to the wicketkeeper.",
        "start_time": "0:15:50",
        "end_time": "0:16:00"
    },
    {
        "message": "Sachin Tendulkar is at the crease. The bowler is Kruger. The bowler runs in to bowl. The ball is bowled. It is a good length ball, outside off stump, Sachin Tendulkar leaves it. The ball goes through to the wicketkeeper.",
        "start_time": "0:16:00",
        "end_time": "0:16:10"
    },
    {
        "message": "The bowler is Kruger, the batsman is Tendulkar. Tendulkar plays a drive off the first ball and the ball goes to the boundary for four runs.  The score is now 22-0. The bowler is Kruger and he is bowling a fast delivery.  Tendulkar plays a drive off the ball and it goes to the boundary for four runs.  The crowd is cheering for Tendulkar.",
        "start_time": "0:16:10",
        "end_time": "0:16:20"
    },
    {
        "message": "Tendulkar hits a single off the second ball. The score is now 23-0. The batsman is looking to get runs as quickly as possible. The bowler is Kruger and he is bowling a fast delivery.  Tendulkar plays a single off the ball and it goes to the fielder for one run. The crowd is cheering for Tendulkar.",
        "start_time": "0:16:20",
        "end_time": "0:16:30"
    },
    {
        "message": "Tendulkar plays a shot off the third ball and it goes to the boundary for four runs. The score is now 27-0. The bowler is Kruger and he is bowling a fast delivery.  Tendulkar plays a shot off the ball and it goes to the boundary for four runs. The crowd is cheering for Tendulkar.",
        "start_time": "0:16:30",
        "end_time": "0:16:40"
    },
    {
        "message": "The score is 23-0. The batsman, N. Ojha, is on 14 and Tendulkar is on 4. It is the first over of the innings bowled by Kruger and he has bowled 1.1 overs.",
        "start_time": "0:16:40",
        "end_time": "0:16:50"
    },
    {
        "message": "The batsman, N. Ojha, plays a shot towards short cover.  It is a dangerous shot for the South African team.  The bowler, Kruger, is persisting with a field of short cover and is trying to put pressure on the batsman.",
        "start_time": "0:16:50",
        "end_time": "0:17:00"
    },
    {
        "message": "The batsman, N. Ojha, almost hits the ball to the boundary line and is looking dangerous. The bowler, Kruger, bowled it straight, and the batsman almost played a shot to the boundary line.",
        "start_time": "0:17:00",
        "end_time": "0:17:10"
    },
    {
        "message": "The batsman, Naman Ojha, hits a cover drive for 4 runs. The bowler is Kruger. The score is 23-0, India Legends are batting and the current over is 0-11.",
        "start_time": "0:17:10",
        "end_time": "0:17:20"
    },
    {
        "message": "Naman Ojha hits another cover drive for 4 runs. The bowler is Kruger. The score is 24-0, India Legends are batting and the current over is 0-11.",
        "start_time": "0:17:20",
        "end_time": "0:17:30"
    },
    {
        "message": "Naman Ojha hits a shot, possibly a cover drive. The bowler is Kruger. The score is 24-0, India Legends are batting and the current over is 0-13.",
        "start_time": "0:17:30",
        "end_time": "0:17:40"
    },
    {
        "message": "The batsman is in a good position to play the shot. The bowler bowls a slower ball and the batsman hits it towards the non-striker, the non-striker is running and Sachin Tendulkar has a look at the shot and says yes.  There is one run on the board. The score is 24 for 0. The over is 1.3.",
        "start_time": "0:17:40",
        "end_time": "0:17:50"
    },
    {
        "message": "The batsman is in a good position to play the shot. The bowler bowls a slower ball and the batsman hits it towards the non-striker, the non-striker is running and Sachin Tendulkar has a look at the shot and says yes.  There is one run on the board. The score is 24 for 0. The over is 1.3.",
        "start_time": "0:17:50",
        "end_time": "0:18:00"
    },
    {
        "message": "The batsman is in a good position to play the shot. The bowler bowls a slower ball and the batsman hits it towards the non-striker, the non-striker is running and Sachin Tendulkar has a look at the shot and says yes.  There is one run on the board. The score is 24 for 0. The over is 1.3.",
        "start_time": "0:18:00",
        "end_time": "0:18:10"
    },
    {
        "message": "The batsman Sachin Tendulkar plays a tentative push shot. The fielder at short cover gets to the ball and the batsman is out. The crowd cheers for Tendulkar. ",
        "start_time": "0:18:10",
        "end_time": "0:18:20"
    },
    {
        "message": "The score is 25-0. The bowler is Kruger and he has bowled 1.4 overs. The crowd cheers as Tendulkar walks off the field.  ",
        "start_time": "0:18:20",
        "end_time": "0:18:30"
    },
    {
        "message": "The crowd is excited to watch Tendulkar bat. ",
        "start_time": "0:18:30",
        "end_time": "0:18:40"
    },
    {
        "message": "The batsman is facing the bowler. The score is 25-0 in the second over, and the bowler has bowled 1.5 overs. The batsman is looking focused and ready to play.",
        "start_time": "0:18:40",
        "end_time": "0:18:50"
    },
    {
        "message": "The batsman is waiting for the ball. The bowler is taking his run-up, and he bowls a ball. The ball goes past the batsman and the wicketkeeper catches the ball.  The score is still 25-0.",
        "start_time": "0:18:50",
        "end_time": "0:19:00"
    },
    {
        "message": "The batsman is looking disappointed. The bowler is walking back to his mark. The commentator is talking about Tendulkar. The score is still 25-0, and the bowler is looking quite happy with himself.",
        "start_time": "0:19:00",
        "end_time": "0:19:10"
    },
    {
        "message": "The batsman is trying to hit the ball towards the front and the fielder dives to save it, the ball runs past the boundary line, the score is 25 - 0 with 0 wickets down in 0.1 overs, the players look dejected after the run.",
        "start_time": "0:19:10",
        "end_time": "0:19:20"
    },
    {
        "message": "The batsman is ready to hit the ball, the bowler is running towards the batsman to deliver the ball, the score is 25 - 0 with 0 wickets down in 0.1 overs, the batsman is looking focused.",
        "start_time": "0:19:20",
        "end_time": "0:19:30"
    },
    {
        "message": "The batsman hits the ball for a six, it's an off-spin bowl, and the fielder jumps and tries to catch it, the score is 27 - 0 with 0 wickets down in 0.1 overs, the bowler looks disappointed and the batsman looks happy.",
        "start_time": "0:19:30",
        "end_time": "0:19:40"
    },
    {
        "message": "The score is 27-0. It's the third match of the series. India Legends have elected to bat. The bowler is N. Ojha and the batsman is Tendulkar. The bowler has bowled 3 balls and the batsman has faced 5 balls. There are 2 runs off 14 balls. The last over had 13 runs.",
        "start_time": "0:19:40",
        "end_time": "0:19:50"
    },
    {
        "message": "Tendulkar is talking to the other batsman about how the game is going.",
        "start_time": "0:19:50",
        "end_time": "0:20:00"
    },
    {
        "message": "The bowler is Nitin and the batsman is Tendulkar. The batsman has been playing defensively.",
        "start_time": "0:20:00",
        "end_time": "0:20:10"
    },
    {
        "message": "The score is 27-0. The current batsman is Tendulkar and the bowler is Ntini. The match is being played at the Green Park Stadium, Kanpur. The fans are cheering for their side.",
        "start_time": "0:20:10",
        "end_time": "0:20:20"
    },
    {
        "message": "Ntini is the bowler, he bowls a ball, the batsman defends. The score is 27-0. It is the third over of the innings.",
        "start_time": "0:20:20",
        "end_time": "0:20:30"
    },
    {
        "message": "Ntini is bowling, the batsman is Tendulkar. The ball goes down the leg side. The batsman is unable to score a run. The score is still 27-0. ",
        "start_time": "0:20:30",
        "end_time": "0:20:40"
    },
    {
        "message": "The score is 29-0, the first over is about to begin, Makhaya Ntini is going to bowl the first over, the batsman is Sachin Tendulkar.",
        "start_time": "0:20:40",
        "end_time": "0:20:50"
    },
    {
        "message": "Makhaya Ntini is a legend in South Africa, known for his bowling action and bowling front-on, Tendulkar is ready for the first ball.",
        "start_time": "0:20:50",
        "end_time": "0:21:00"
    },
    {
        "message": "Ntini is ready to bowl the first ball of the over, Sachin Tendulkar takes his stance, the crowd is cheering.",
        "start_time": "0:21:00",
        "end_time": "0:21:10"
    },
    {
        "message": "The batsman is Tendulkar, he plays a shot to the inner circle, the crowd cheers as Tendulkar hits his first boundary, the score is now 33 - 0",
        "start_time": "0:21:10",
        "end_time": "0:21:20"
    },
    {
        "message": "Tendulkar is back in form, the crowd cheers, the score is 33 - 0 with 3.2 overs played, the batsman hits a four by playing a cut shot",
        "start_time": "0:21:20",
        "end_time": "0:21:30"
    },
    {
        "message": "The batsman is in a strong position, he picks up the length of the ball very early, the ball is bowled by Makhaya Ntini, the batsman plays a shot to the front foot in the slot, the ball goes very high",
        "start_time": "0:21:30",
        "end_time": "0:21:40"
    },
    {
        "message": "Sachin Tendulkar is on strike. He hits a boundary off the first ball of the over. The score is 33-0, with India Legends having elected to bat. The bowler is Ntini and he is bowling off-spin. Tendulkar is playing a straight bat shot.",
        "start_time": "0:21:40",
        "end_time": "0:21:50"
    },
    {
        "message": "Tendulkar has hit a good shot but the ball goes straight to the fielder. The umpire signals for a single and the score is now 34-0. The current bowler, Ntini is trying to get the batsman out by bowling a delivery on the pads.",
        "start_time": "0:21:50",
        "end_time": "0:22:00"
    },
    {
        "message": "Ntini bowls a delivery on the pads to Sachin Tendulkar, who defends it. The score is 34-0.",
        "start_time": "0:22:00",
        "end_time": "0:22:10"
    },
    {
        "message": "The batsman is on 17, he tries to play a similar kind of a shot, that fetched him a boundary. He came in and may have gone down the leg side. Makhaya Ntini was quite vociferous in his appealing because this was against Sachin Tendulkar, one of going down the leg side. The score is 34-0 in 3.3 overs.  The bowler is Makhaya Ntini.",
        "start_time": "0:22:10",
        "end_time": "0:22:20"
    },
    {
        "message": "The bowler is Makhaya Ntini and the batsman is Sachin Tendulkar. The score is 34-0 in 3.3 overs.  The bowler is bowling a good length delivery, the batsman tries to play a shot but misses. ",
        "start_time": "0:22:20",
        "end_time": "0:22:30"
    },
    {
        "message": "The batsman is Sachin Tendulkar and the bowler is Makhaya Ntini. The score is 34-0 in 3.3 overs. The batsman is trying to play a shot but misses it.  ",
        "start_time": "0:22:30",
        "end_time": "0:22:40"
    },
    {
        "message": "The score is 34-0, 3.4 overs bowled. The batsman is N Ojha on 17 and Tendulkar is on 9. The bowler is Ntini, who is a fast bowler for South Africa. He has played over a hundred Test matches. The new batsman N Ojha is walking in to bat and the South African players are cheering, it seems like they just took a wicket.",
        "start_time": "0:22:40",
        "end_time": "0:22:50"
    },
    {
        "message": "Ntini bowls the first ball to Ojha, it is a straight ball and Ojha defends it back to Ntini.",
        "start_time": "0:22:50",
        "end_time": "0:23:00"
    },
    {
        "message": "Ntini bowls the second ball to Ojha, it is another straight ball, Ojha plays a defensive shot and the ball goes to the off side. The score remains at 34-0 and the scorecard hasn't changed.",
        "start_time": "0:23:00",
        "end_time": "0:23:10"
    },
    {
        "message": "The batsman, N. Ojha, is on strike. He guides a ball towards the boundary and it is fielded by N. Ojha. This was a deliberate shot. The scoreboard says 34-0, with 3.4 overs bowled. The crowd is cheering.",
        "start_time": "0:23:10",
        "end_time": "0:23:20"
    },
    {
        "message": "The bowler, Ntini, bowls a slower ball and the batsman plays a shot with soft hands, guiding the ball past the wicketkeeper. The ball rolls across the pitch and the wicketkeeper cannot stop it. The batsman has scored two runs off the ball. The crowd is excited.",
        "start_time": "0:23:20",
        "end_time": "0:23:30"
    },
    {
        "message": "Ntini, the bowler, bowls a delivery that races to the fence. The batsman runs a single and the fielders try to stop the ball from going for a boundary, but they cannot reach it. The crowd is cheering. The scoreboard now shows 36-0, with 3.5 overs bowled.",
        "start_time": "0:23:30",
        "end_time": "0:23:40"
    },
    {
        "message": "The score is 38-0 for India Legends.  N. Ojha is batting on 21, Tendulkar is on 9, and Ntini is bowling. The first ball of the 4th over is a full toss, and it's hit for a run.",
        "start_time": "0:23:40",
        "end_time": "0:23:50"
    },
    {
        "message": "The batsman plays a defensive shot and the bowler is going through his run-up. The ball is bowled, and the batsman defends the ball and takes a run.  The score is now 38-1 for India Legends.",
        "start_time": "0:23:50",
        "end_time": "0:24:00"
    },
    {
        "message": "The bowler is taking a few steps and having a chat with the fielders, he is looking a little frustrated.  The batsman is talking to his partner about how to play the ball. The bowler has finished his run-up and is ready to bowl.",
        "start_time": "0:24:00",
        "end_time": "0:24:10"
    },
    {
        "message": "The score is 38-0, the current run rate is 9.5, the match is between South Africa and India Legends, and India Legends has elected to bat, the current over is 4,  and the game is being played in Kanpur.",
        "start_time": "0:24:10",
        "end_time": "0:24:20"
    },
    {
        "message": "The batsman is talking to the team. They seem to be strategising and talking about the game. The team is looking at the player's pitch.",
        "start_time": "0:24:20",
        "end_time": "0:24:30"
    },
    {
        "message": "The batsman is still talking to the team. The team seems to be listening intently and looking serious. The batsman points to something and continues his conversation with the team. ",
        "start_time": "0:24:30",
        "end_time": "0:24:40"
    },
    {
        "message": "The match is between South Africa Legends and India Legends. The scorecard shows South Africa Legends at 38 runs and no wickets and India Legends at 0 runs and no wickets. The current run rate is 9.50 and the venue is Green Park, Kanpur. Van der Wath is the bowler and Ojha is the batsman. The batsman is standing outside the crease ready to face the bowler. The bowler is looking at the batsman to start the match.",
        "start_time": "0:24:40",
        "end_time": "0:24:50"
    },
    {
        "message": "The batsman is standing outside the crease, ready to face the bowler. The bowler is looking at the batsman, getting ready to bowl. The scorecard shows South Africa Legends at 38 runs and no wickets and India Legends at 0 runs and no wickets.",
        "start_time": "0:24:50",
        "end_time": "0:25:00"
    },
    {
        "message": "The bowler is getting ready to bowl and the batsman is standing outside the crease, ready to face the bowler. The scorecard shows South Africa Legends at 38 runs and no wickets and India Legends at 0 runs and no wickets. The bowler is looking at the batsman to start the match.",
        "start_time": "0:25:00",
        "end_time": "0:25:10"
    },
    {
        "message": "The South African bowler Johan Van Der Wath is bowling. He is a right-arm medium-fast bowler. He is bowling at the River End. The score is 38-0 in favor of India. The current run rate is 9.50. Tendulkar is the batsman on strike.  The bowler is walking towards the batsman, getting ready to bowl.",
        "start_time": "0:25:10",
        "end_time": "0:25:20"
    },
    {
        "message": "The bowler Johan Van Der Wath bowls the first ball of the over, which is a little bit of shape away from Tendulkar. Tendulkar tries to hit the ball but misses. The score remains 38-0, and the current run rate is 9.12.",
        "start_time": "0:25:20",
        "end_time": "0:25:30"
    },
    {
        "message": "The second ball of the over is a fuller delivery. Tendulkar steps out of the crease and hits the ball, but it goes straight to the wicketkeeper. The wicketkeeper tries to catch the ball, but it goes through his gloves. The score is still 38-0. Van Der Wath is trying to get his rhythm back. ",
        "start_time": "0:25:30",
        "end_time": "0:25:40"
    },
    {
        "message": "The batsman is playing a defensive shot and the bowler is bowling a good length ball. The score is 38-0, with the number of overs being 4.1. The batsman seems focused and ready for the next ball.",
        "start_time": "0:25:40",
        "end_time": "0:25:50"
    },
    {
        "message": "The batsman is trying to work the ball to the leg side. The bowler has replaced Kruger. The score is still 38-0 with 4.2 overs played. The bowler seems confident.",
        "start_time": "0:25:50",
        "end_time": "0:26:00"
    },
    {
        "message": "The bowler has bowled a decent bounce ball. The batsman seems focused on the next ball. The score is still 38-0 with 4.2 overs played. The Green Park track has shown good bounce and carry so far.",
        "start_time": "0:26:00",
        "end_time": "0:26:10"
    },
    {
        "message": "The score is 38-0 in 4.2 overs. The current run rate is 8.77 runs per over. N Ojha is on 21 runs and Tendulkar is on 9. Van Der Wath has replaced Kruger as the bowler. The bowler bowls a ball that the batsman defends with a straight bat. The batsman is standing at the crease. ",
        "start_time": "0:26:10",
        "end_time": "0:26:20"
    },
    {
        "message": "The bowler is Van Der Wath. The batsman is Tendulkar. The batsman is walking towards the end of the pitch. The score is 39-0 in 4.2 overs. The current run rate is 9 runs per over. 9 runs have been taken by extra runs.  ",
        "start_time": "0:26:20",
        "end_time": "0:26:30"
    },
    {
        "message": "The score is 39-0 in 4.2 overs. The current run rate is 9 runs per over. 9 runs have been taken by extra runs.  The camera angle is zoomed out, showing the whole pitch.",
        "start_time": "0:26:30",
        "end_time": "0:26:40"
    },
    {
        "message": "The score is 39-0 in 4.2 overs. Van Der Wath is batting on 0 runs. The ball goes over the off side and Tendulkar collects the boundary. The crowd cheers loudly. The crowd is in the background.",
        "start_time": "0:26:40",
        "end_time": "0:26:50"
    },
    {
        "message": "The score is 43-0 in 4.3 overs. Tendulkar is on 13 runs. The batsman hits the ball over the top for a boundary. This shot is unusual from Tendulkar as he typically plays these shots on the ground. The batsman is looking pleased with his shot.",
        "start_time": "0:26:50",
        "end_time": "0:27:00"
    },
    {
        "message": "The batsman hits the ball between mid off and cover. It is a different type of shot than Tendulkar normally plays. The batsman is preparing to hit the ball. The batsman hits the ball. The batsman is running.",
        "start_time": "0:27:00",
        "end_time": "0:27:10"
    },
    {
        "message": "The batsman, Tendulkar, is on strike, and the bowler, Ojha, bowls a ball in the slot. Tendulkar plays a push shot towards the covers, which is fielded easily. The score is 43-0, with the Indian Legends having faced 4.3 overs. ",
        "start_time": "0:27:10",
        "end_time": "0:27:20"
    },
    {
        "message": "Ojha is bowling, and he bowls a ball that Tendulkar picks up early, playing a lovely shot that rolls towards the boundary. The fielder, chasing the ball, dives but is unable to stop it. The ball runs for four. The score is now 47-0, with the Indian Legends having faced 4.4 overs.",
        "start_time": "0:27:20",
        "end_time": "0:27:30"
    },
    {
        "message": "Ojha is bowling, and he bowls a ball towards the batsman. The batsman, Tendulkar, plays a shot, and the ball goes for four runs. The score is now 51-0, with the Indian Legends having faced 4.5 overs. ",
        "start_time": "0:27:30",
        "end_time": "0:27:40"
    },
    {
        "message": "The batsman is trying to hit a shot but the bowler is bowling very well and it's looking like a tough one to hit. The bowler is bowling a good length ball and the batsman is trying to hit it over the top. The bowler is bowling very well and the batsman is having trouble getting the ball off the ground. The batsman is trying to hit a shot but the bowler is bowling very well and it's looking like a tough one to hit. The bowler is bowling a good length ball and the batsman is trying to hit it over the top. The bowler is bowling very well and the batsman is having trouble getting the ball off the ground. ",
        "start_time": "0:27:40",
        "end_time": "0:27:50"
    },
    {
        "message": "The batsman has tried to hit a shot but the bowler has taken a great catch. The bowler is celebrating his catch and the crowd is cheering. The batsman is walking back to the pavilion. The crowd is cheering for the bowler. The bowler is giving a thumbs up to the crowd. The batsman is walking back to the pavilion.",
        "start_time": "0:27:50",
        "end_time": "0:28:00"
    },
    {
        "message": "The bowler is running in to bowl and the batsman is ready to hit the ball. The bowler is bowling a good length ball and the batsman is trying to hit it over the top. The batsman has missed the ball. The bowler is bowling very well and the batsman is having trouble getting the ball off the ground. The batsman is trying to hit a shot but the bowler is bowling very well and it's looking like a tough one to hit. The bowler is bowling a good length ball and the batsman is trying to hit it over the top.",
        "start_time": "0:28:00",
        "end_time": "0:28:10"
    },
    {
        "message": "The fielder goes for a diving catch, gets close but misses the ball. Sachin Tendulkar is given a big reprieve. The score is 44 - 0 with the fourth over completed.",
        "start_time": "0:28:10",
        "end_time": "0:28:20"
    },
    {
        "message": "Sachin Tendulkar seems to be happy about the dropped catch. The batsman is facing the bowler who is about to bowl the first ball of the 5th over. ",
        "start_time": "0:28:20",
        "end_time": "0:28:30"
    },
    {
        "message": "The batsman is watching the bowler bowl the ball. The bowler seems to be bowling a good length ball. The score is 44 - 0 with the 5th over underway.",
        "start_time": "0:28:30",
        "end_time": "0:28:40"
    },
    {
        "message": "The Indian Legends are batting and they have scored 44 runs without loss. The current batsman is Van der Wath and he is on 0 runs from 0 balls. The current bowler is Ojha, who is bowling his 4th over. Van der Wath is facing Ojha's first delivery of the over, he plays a defensive shot and it comes off the bat and goes towards the slips. The fielder at slips dives to stop the ball. The score remains 44/0 after 4.5 overs.",
        "start_time": "0:28:40",
        "end_time": "0:28:50"
    },
    {
        "message": "Ojha bowls a good length ball and van der Wath plays a defensive shot. The ball goes to the slips. The score remains 44/0 after 4.5 overs.",
        "start_time": "0:28:50",
        "end_time": "0:29:00"
    },
    {
        "message": "The Indian Legends are batting and they have scored 44 runs without loss. The current batsman is Van der Wath and he is on 0 runs from 0 balls. The current bowler is Ojha, who is bowling his 4th over. Ojha has bowled 5 balls so far.  The score is still 44/0. Ojha bowls another good length delivery and van der Wath defends it back to the bowler. The score remains 44/0 after 4.5 overs.",
        "start_time": "0:29:00",
        "end_time": "0:29:10"
    },
    {
        "message": "The score is 44-0, 4.5 overs completed. The batsman is Van Der Wath on 0 runs, facing the bowler Ojha, who is bowling the 5th over.  Van Der Wath defends the ball to the off side for a dot ball. ",
        "start_time": "0:29:10",
        "end_time": "0:29:20"
    },
    {
        "message": "The batsman Van Der Wath is walking off the field with his bat. The bowler Ojha  and the other fielders are looking at him. ",
        "start_time": "0:29:20",
        "end_time": "0:29:30"
    },
    {
        "message": "The batsman Van Der Wath is walking off the field. The bowler Ojha is walking back to his bowling mark. The fielders are gathering around the batsman.",
        "start_time": "0:29:30",
        "end_time": "0:29:40"
    },
    {
        "message": "The score is 44-0 with India Legends batting first. The scorecard shows that the first bowler Kruger bowled 2 overs, 6 dot balls and gave away 14 runs. The second bowler, Botha, bowled 1 over, 3 dot balls and gave away 13 runs. The third bowler Ntini bowled 1 over, 3 dot balls and gave away 10 runs. The current bowler Van der Wath has bowled 1 over, 4 dot balls and given away 6 runs. The total number of overs bowled are 5 and extras are 9. The first batsman Van der Wath is on 0 runs and has faced 1 ball.  ",
        "start_time": "0:29:40",
        "end_time": "0:29:50"
    },
    {
        "message": "The batsman Van der Wath is trying to hit a boundary but the ball goes straight to the fielder and he survives.  ",
        "start_time": "0:29:50",
        "end_time": "0:30:00"
    },
    {
        "message": "The batsman Van der Wath is on strike. He is trying to hit the ball but misses it.  ",
        "start_time": "0:30:00",
        "end_time": "0:30:10"
    },
    {
        "message": "The score is 44 runs for no wickets in 5 overs. The current bowler is Ntini who has bowled 1 over and has given away 10 runs. The batsman on strike is Tendulkar, he is facing Ntini, who is running in to bowl. Ntini bowls a good length ball, it is on a good line, Tendulkar leaves it.",
        "start_time": "0:30:10",
        "end_time": "0:30:20"
    },
    {
        "message": "Ntini bowls a good length ball, it is on a good line, Tendulkar leaves it. Tendulkar is on 14 runs and has faced 13 balls. ",
        "start_time": "0:30:20",
        "end_time": "0:30:30"
    },
    {
        "message": "Tendulkar is on 14 runs and has faced 13 balls. Ntini bowls a slower ball, it is on the off stump, Tendulkar defends it. ",
        "start_time": "0:30:30",
        "end_time": "0:30:40"
    },
    {
        "message": "Tendulkar has hit a shot, it is going towards the boundary,  the fielder runs to take the catch, he manages to get the ball. The score remains 44-0. The over is 5.1. The score card shows that Tendulkar has 16 runs and Ojha has 21.  ",
        "start_time": "0:30:40",
        "end_time": "0:30:50"
    },
    {
        "message": "Tendulkar was looking to play a straight shot, the ball has gone for a boundary. The score now is 46-0. The over is 5.1. The score card shows that Tendulkar has 16 runs and Ojha has 21. ",
        "start_time": "0:30:50",
        "end_time": "0:31:00"
    },
    {
        "message": "Tendulkar has hit a shot that looks like it will be a boundary, the bowler is looking slightly disappointed but Tendulkar has run for a single, the score now is 46-1. The over is 5.1. The score card shows that Tendulkar has 16 runs and Ojha has 21. ",
        "start_time": "0:31:00",
        "end_time": "0:31:10"
    },
    {
        "message": "The score is 0-0, the batsman is N Ojha, he's on 21 runs and the bowler is T Tendulkar, he's on 16 runs. The current over is the 1st over of the match, and the bowler is delivering a back of a length delivery, the batsman tries to hit a shot, but it goes to mid off, the ball is caught by the fielder, and the batsman gets out. The score becomes 1-1.",
        "start_time": "0:31:10",
        "end_time": "0:31:20"
    },
    {
        "message": "The batsman has been dismissed, and the score is now 1-1. The new batsman is Tendulkar, he's on 0 runs and the bowler is Ojha, he's on 21 runs. The current over is the 1st over of the match, and the bowler is delivering a slow, off-break delivery, the batsman is trying to hit a shot but it's caught at mid off. The fielder is taking an easy catch.",
        "start_time": "0:31:20",
        "end_time": "0:31:30"
    },
    {
        "message": "The batsman is dismissed, and the score is now 1-2. The bowler is celebrating with his teammate, as they have successfully broken the partnership.",
        "start_time": "0:31:30",
        "end_time": "0:31:40"
    },
    {
        "message": "The batsman is trying to play on the up as the ball is coming on to the bat.",
        "start_time": "0:31:40",
        "end_time": "0:31:50"
    },
    {
        "message": "The bowler bowls a good ball that is not coming onto the bat. The bowler takes a good catch.",
        "start_time": "0:31:50",
        "end_time": "0:32:00"
    },
    {
        "message": "The batsman, Sachin Tendulkar, has been dismissed. He scored 16 runs off 15 balls. He did not lift the shot as much as he has been doing throughout the match. He'll have a bit of a better touch.",
        "start_time": "0:32:00",
        "end_time": "0:32:10"
    },
    {
        "message": "The score is 46-1, 5.2 overs. The batsman is walking off the field after getting out. He was on 16 runs. The current batsman is Raina.",
        "start_time": "0:32:10",
        "end_time": "0:32:20"
    },
    {
        "message": "The new batsman Raina is facing the bowler. There is a huge crowd in the background.",
        "start_time": "0:32:20",
        "end_time": "0:32:30"
    },
    {
        "message": "The batsman is talking to the bowler. The bowler is walking towards the batsman and is shaking his hand. The new batsman is ready to face the bowler.",
        "start_time": "0:32:30",
        "end_time": "0:32:40"
    },
    {
        "message": "Raina is walking back to the pavilion, his bat is in his hand. He has been dismissed for zero by Ojha. The crowd is cheering for India Legends. The score is now 46-1. 5.2 overs have been bowled. ",
        "start_time": "0:32:40",
        "end_time": "0:32:50"
    },
    {
        "message": "The crowd is cheering for India Legends. The score is now 46-1. 5.2 overs have been bowled. ",
        "start_time": "0:32:50",
        "end_time": "0:33:00"
    },
    {
        "message": "The crowd is cheering for India Legends. The score is now 46-1. 5.2 overs have been bowled. ",
        "start_time": "0:33:00",
        "end_time": "0:33:10"
    },
    {
        "message": "Suresh Raina comes to the crease, he is a local lad and had a wonderful career, he played with Chennai Super Kings and scored wonderful hundreds for India and who can forget that T20 100 against South Africa, many moons ago in the world cup.",
        "start_time": "0:33:10",
        "end_time": "0:33:20"
    },
    {
        "message": "Suresh Raina has played 320 innings in his T20 career and has scored 8654 runs, 53 fifties and 4 hundreds. His strike rate is 137.45 with a best score of 126 not out.  He is a left-hand bat, currently 35 years old and  playing for India Legends.",
        "start_time": "0:33:20",
        "end_time": "0:33:30"
    },
    {
        "message": "Raina is at the crease, the score is 46 for 1. It is the 5.2nd over. The bowler is bowling a slower delivery and Raina swings but misses. The ball goes through and reaches the keeper Ojha. The score remains the same. ",
        "start_time": "0:33:30",
        "end_time": "0:33:40"
    },
    {
        "message": "The batsman is Suresh Raina. He is on 0 runs. The bowler is N. Ojha, he has bowled 5.2 overs and taken 1 wicket, giving away 46 runs. The score is 46 for 1.",
        "start_time": "0:33:40",
        "end_time": "0:33:50"
    },
    {
        "message": "The bowler N Ojha, bowled a delivery in the off stump line, batsman Raina played a defensive shot.",
        "start_time": "0:33:50",
        "end_time": "0:34:00"
    },
    {
        "message": "The bowler N Ojha is running in to bowl, the batsman is Raina.",
        "start_time": "0:34:00",
        "end_time": "0:34:10"
    },
    {
        "message": "Raina is batting and N Ojha is bowling, the score is 46-1 in 5.3 overs. Raina hits a boundary to the off side and the crowd cheers for him.",
        "start_time": "0:34:10",
        "end_time": "0:34:20"
    },
    {
        "message": "The ball is bowled by Ojha and Raina hits a four, he is making his debut after retiring and this is his home ground. Raina is playing a shot with power and a lot of force. The crowd is cheering for him.",
        "start_time": "0:34:20",
        "end_time": "0:34:30"
    },
    {
        "message": "Raina is at 42 runs and the score is 50-1 in 5.4 overs. He has played a lot of first-class cricket here. The crowd is cheering for him.",
        "start_time": "0:34:30",
        "end_time": "0:34:40"
    },
    {
        "message": "Raina hits a shot, the batsman has played this shot so many times before. The score is 50-1, 5.4 overs completed. The current run rate is 8.82.",
        "start_time": "0:34:40",
        "end_time": "0:34:50"
    },
    {
        "message": "Raina hits a shot for a four. This is his staple shot, over cover, he is leaning into it and putting his body weight behind the shot.",
        "start_time": "0:34:50",
        "end_time": "0:35:00"
    },
    {
        "message": "The ball is hit for four by Raina. The scorecard now reads 54-1 in 5.5 overs.",
        "start_time": "0:35:00",
        "end_time": "0:35:10"
    },
    {
        "message": "The batsman plays a straight drive that goes into the group, and the fielder picks it up. The score is 50-1, and the current run rate is 8.82. The bowler is Ntini.",
        "start_time": "0:35:10",
        "end_time": "0:35:20"
    },
    {
        "message": "The bowler is bowling a full delivery. The batsman tries to hit a shot, but misses the ball as he couldn't get the timing right. He attempted the shot a number of times in the innings. The bowler is bowling a good line and length.",
        "start_time": "0:35:20",
        "end_time": "0:35:30"
    },
    {
        "message": "The bowler bowls a full delivery. The batsman tries to play a shot but the ball goes through the infield. The score is 50-1 and the current run rate is 8.57. The bowler is Ntini.",
        "start_time": "0:35:30",
        "end_time": "0:35:40"
    },
    {
        "message": "The batsman Raina hits a straight shot, the ball goes over the top of the bowler and the bowler tries to stop it. The batsman gets 2 runs. The score is 52/1. The current run rate is 8.67. The power play is over.",
        "start_time": "0:35:40",
        "end_time": "0:35:50"
    },
    {
        "message": "The batsman is walking off the field. The commentators are talking about how he got out.",
        "start_time": "0:35:50",
        "end_time": "0:36:00"
    },
    {
        "message": "The scoreboard is showing the India Legends team's scorecard. The score is 52-1, with N Ojha not out on 21, Tendulkar out on 16 and Raina not out on 6. The extras are 9 and the overs are 6.",
        "start_time": "0:36:00",
        "end_time": "0:36:10"
    },
    {
        "message": "The score is 52 runs for the loss of 1 wicket. India Legends have scored 52 runs in 6 overs. The batsman on strike is N Ojha, who is on 21 runs. The other batsman, Raina, is on 6 runs. The bowler is Ntini, who has bowled 2 overs.",
        "start_time": "0:36:10",
        "end_time": "0:36:20"
    },
    {
        "message": "The bowler is Ntini. N Ojha is on strike, Raina is at the non-striker's end. The ball is bowled outside off stump, N Ojha pushes it towards mid-on for a single. The score is now 53 for 1 in 6 overs.",
        "start_time": "0:36:20",
        "end_time": "0:36:30"
    },
    {
        "message": "The score is now 53 for 1 in 6 overs. Raina is on strike, he defends the ball back to the bowler. The bowler, Ntini is bowling a good length ball, it is bowled outside off stump.",
        "start_time": "0:36:30",
        "end_time": "0:36:40"
    },
    {
        "message": "Ojha is on 21 off 17. He has looked in fine touch. Raina, not far out of retirement, also finding his straps early. The current score is 52 for 1.",
        "start_time": "0:36:40",
        "end_time": "0:36:50"
    },
    {
        "message": "Ojha plays a short ball and it goes for a single. Raina is on strike now. The score is 52 for 1.",
        "start_time": "0:36:50",
        "end_time": "0:37:00"
    },
    {
        "message": "Raina is out caught by Botha off Ntinis bowling. The bowler is delighted and Ojha is walking back. The score is 52 for 1.",
        "start_time": "0:37:00",
        "end_time": "0:37:10"
    },
    {
        "message": "The South African bowlers have set a very good field the fielder's are there in the right places and that's a good sign of a good fielding team, the batsman is trying to push it towards the point region and the ball has gone towards the deep point region, the bowler is celebrating the wicket as the batsman walks off the ground",
        "start_time": "0:37:10",
        "end_time": "0:37:20"
    },
    {
        "message": "The batsman was trying to push the ball towards the point region and he has been bowled out, it was a very good delivery from the South African bowler he just got the ball to swing in and it got to the stumps and he's very happy about it and he's got a wicket in his first over",
        "start_time": "0:37:20",
        "end_time": "0:37:30"
    },
    {
        "message": "The bowler is looking very confident after taking his wicket in the first over, he's looking for more wickets in the next over and he's looking to bowl his next ball, the South African bowler is ready to bowl and he's got a good field set up behind him, the batsman is taking his stance he's looking very focused on the ball and he's trying to hit the ball hard",
        "start_time": "0:37:30",
        "end_time": "0:37:40"
    },
    {
        "message": "The score is 52 for 2 in 6.1 overs. Naman Ojha is dismissed for 21 runs, caught by Rhondes and bowled by Van Der Wath. He played 18 balls and hit 4 fours. He tried to play off the front foot, but the ball hits his pads and he is out. The crowd cheers as he walks off the field. Raina is at the crease on 64, and he is joined by Binny on 0.  The current run rate is 8.43. The bowler is Van Der Wath who has bowled 1 over and conceded 6 runs. ",
        "start_time": "0:37:40",
        "end_time": "0:37:50"
    },
    {
        "message": "The players walk off the field, with Raina and Binny on the crease. Raina is 64* and Binny is 0*. ",
        "start_time": "0:37:50",
        "end_time": "0:38:00"
    },
    {
        "message": "The two batsmen shake hands. The bowler is Van Der Wath, who has taken a wicket.  He has bowled 1 over and conceded 6 runs.",
        "start_time": "0:38:00",
        "end_time": "0:38:10"
    },
    {
        "message": "The batsman is walking towards the wicket, the score is 52-2, South Africa are batting,  the current run rate is 8.43, and the bowler is Van der Wath, who has bowled 1 over for 6 runs. ",
        "start_time": "0:38:10",
        "end_time": "0:38:20"
    },
    {
        "message": "The batsman is now standing at the crease and is ready to face the bowler. Van der Wath is bowling a leg break. The batsman is trying to play a defensive shot, but he misses the ball. The ball goes past the batsman and the wicketkeeper, and hits the stumps. The batsman is out bowled. The score is now 52-3.",
        "start_time": "0:38:20",
        "end_time": "0:38:30"
    },
    {
        "message": "The new batsman is walking towards the crease, the score is 52-3. The bowler is Van der Wath, who has bowled 1 over for 6 runs.",
        "start_time": "0:38:30",
        "end_time": "0:38:40"
    },
    {
        "message": "The batsman, Raina, is on strike and has scored 64 runs, while the non-striker, Binny, has 0 runs. The current score is 52 runs for 2 wickets and the current run rate is 8.43. The current over is 6.1. The bowler is Van Der Wath. The batsman is seen looking down towards the pitch and getting ready to face the bowler.",
        "start_time": "0:38:40",
        "end_time": "0:38:50"
    },
    {
        "message": "Binny comes to the crease.  The score is now 52-2 in 6.2 overs. The current run rate is 8.21. Binny is a right-handed batsman, who has played a lot of IPL cricket for Rajasthan Royals. Binny is 38 years old and has played in 117 T20 matches, scoring 1641 runs with a strike rate of 126.03. He has one 50 to his name.",
        "start_time": "0:38:50",
        "end_time": "0:39:00"
    },
    {
        "message": "The stats for Binny continue to display, showcasing his career stats in T20 cricket. Binny's last ODI was against South Africa on this ground.",
        "start_time": "0:39:00",
        "end_time": "0:39:10"
    },
    {
        "message": "The score is 53-2. The current run rate is 8.15. The batsman is Stuart Binny and he is on 1 run. The bowler is Van Der Wath and he is on 1-7.  The crowd is cheering as Binny walks out to bat.",
        "start_time": "0:39:10",
        "end_time": "0:39:20"
    },
    {
        "message": "The batsman Binny is facing a bowler Van Der Wath. The score is 53-2 in the 1.7 over of the match. Binny is on 1 run. The bowler bowled a ball that was full, and Binny played a shot that went straight to the fielder, but he couldn't hold on to the catch.",
        "start_time": "0:39:20",
        "end_time": "0:39:30"
    },
    {
        "message": "The fans are cheering and waving Indian flags as Binny walks out to bat. Binny is a seasoned cricketer who has played test cricket, ODI, and T20. He had a brief break from the game and made a comeback.",
        "start_time": "0:39:30",
        "end_time": "0:39:40"
    },
    {
        "message": "The score is 53 for 2 and the current run rate is 8.15, Roger Binny is at the crease on 1 run and Raina is on 64 runs. Van Der Wath is bowling the first over and he has given away 7 runs with 1 wicket. Binny is looking to play a shot but the ball is too quick for him and he misses. The crowd is cheering for Binny.",
        "start_time": "0:39:40",
        "end_time": "0:39:50"
    },
    {
        "message": "Binny is taking guard. He is looking for a shot. He missed the ball and it was a good delivery, the ball pitches in line with the off stump, Binny misses the shot completely and the ball hit the pads just in front of the stumps.",
        "start_time": "0:39:50",
        "end_time": "0:40:00"
    },
    {
        "message": "Binny is playing a shot. He is trying to hit the ball towards the boundary.  He is looking to play a shot but the ball is too quick for him and he misses. The ball goes for a single and Binny is not able to play a shot.",
        "start_time": "0:40:00",
        "end_time": "0:40:10"
    },
    {
        "message": "The score is 53-2. The current run rate is 7.95. The bowler is Van der Wath and he is bowling the first over, the score is 1-7. The batsman is Binny and he has scored 1 run. The batsman is Raina and he has scored 6 runs. The umpire signals the start of the over with a raise of his hand. ",
        "start_time": "0:40:10",
        "end_time": "0:40:20"
    },
    {
        "message": "The batsman is Binny. The bowler is Van der Wath. The bowler bowls a delivery that goes towards the batsman. The batsman plays a shot that goes towards the left of the wicketkeeper and the umpire signals a single. The batsman runs a single to reach the other end of the pitch. The score is now 54-2.",
        "start_time": "0:40:20",
        "end_time": "0:40:30"
    },
    {
        "message": "The batsman is Raina. The bowler is Van der Wath. The bowler bowls a delivery that goes towards the batsman. The batsman plays a shot that goes towards the left of the wicketkeeper and the umpire signals a single. The batsman runs a single to reach the other end of the pitch. The score is now 54-2. The bowler is Van der Wath and he is bowling the first over, the score is 1-8.",
        "start_time": "0:40:30",
        "end_time": "0:40:40"
    },
    {
        "message": "The bowler bowls a delivery, the batsman plays a tentative push shot, the ball goes slow off the wicket. The fielder dives and misses a catch.",
        "start_time": "0:40:40",
        "end_time": "0:40:50"
    },
    {
        "message": "The score is 54-2, 6.4 overs, current run rate is 8.10. The batsman is Raina and he's on 69 runs, the bowler is Van der Wath on 1-8. The bowler is downcast after dropping a catch.",
        "start_time": "0:40:50",
        "end_time": "0:41:00"
    },
    {
        "message": "The bowler is Van der Wath and he's bowling accurately, the batsman is Raina and he's trying to score runs. The score is 54-2, the current run rate is 8.10.",
        "start_time": "0:41:00",
        "end_time": "0:41:10"
    },
    {
        "message": "The score is 54-2, the current run rate is 8.10. The last batsman was Naman Ojha, who was on 21 runs.  The batsman Raina is on 6 runs and Binny is on 1 run.  South Africa Legends is bowling the first over and Van Der Wat is the bowler. He has bowled one over with the current score of 1-8. The batsman Raina hits a shot and the ball goes to the long on where a fielder runs and catches the ball. The batsman Raina is out.",
        "start_time": "0:41:10",
        "end_time": "0:41:20"
    },
    {
        "message": "The score is 55-2, the current run rate is 8.05. The last batsman was Naman Ojha, who was on 21 runs.  The batsman Raina is on 7 runs and Binny is on 1 run.  South Africa Legends is bowling the first over and Van Der Wat is the bowler. He has bowled one over with the current score of 1-9. The bowler bowls a ball to Raina. Raina wanted to play a shot but the ball was bowled slowly.",
        "start_time": "0:41:20",
        "end_time": "0:41:30"
    },
    {
        "message": "The score is 55-2, the current run rate is 8.05. The last batsman was Naman Ojha, who was on 21 runs.  The batsman Raina is on 7 runs and Binny is on 1 run.  South Africa Legends is bowling the first over and Van Der Wat is the bowler. He has bowled one over with the current score of 1-9. This play of playing on the front foot is costing India wickets. India needs to watch out for the bowlers.",
        "start_time": "0:41:30",
        "end_time": "0:41:40"
    },
    {
        "message": "The score is 55 for 2 in 6.5 overs. Raina is on strike and is on 7 runs. Binny is on 1 run.  The bowler is van der Wath and he has bowled 1 over and given away 9 runs.",
        "start_time": "0:41:40",
        "end_time": "0:41:50"
    },
    {
        "message": "Van der Wath bowls a ball that goes to the wicketkeeper. Raina tries to push the ball away but misses it. The wicketkeeper dives and manages to save the ball.  The score is now 56-2 in 6.5 overs.",
        "start_time": "0:41:50",
        "end_time": "0:42:00"
    },
    {
        "message": "The bowler van der Wath seems disappointed, the bowler was aiming for a wide ball.  The score is 56 for 2 in 6.5 overs. The current run rate is 8.20.",
        "start_time": "0:42:00",
        "end_time": "0:42:10"
    },
    {
        "message": "The score is 56-2 and the current rate is 8.20. The batsman Raina is on 7 and the bowler Van der Wath has figures of 1-10. A  ball is bowled towards the batsman Raina. The batsman plays a shot to the cover region and the fielder runs after the ball.  The batsman is running for a single. ",
        "start_time": "0:42:10",
        "end_time": "0:42:20"
    },
    {
        "message": "The ball is fielded by the fielder at cover and the batsman Raina takes a run to complete a single. The score is now 57-2.  The batsman is looking at the bowler.",
        "start_time": "0:42:20",
        "end_time": "0:42:30"
    },
    {
        "message": "The ball is bowled towards the batsman Raina. The batsman plays a shot to the backward point region for a boundary. The boundary is hit in between the backward point and third man fielder. The fielder at third man is trying to stop the ball but it goes to the boundary for a four. The score is now 60-2, the current run rate is 8.57 and the total number of fours hit in the match is 8.",
        "start_time": "0:42:30",
        "end_time": "0:42:40"
    },
    {
        "message": "The batsman is facing the bowler. The bowler bowls the ball and the batsman plays a shot towards the off side. The ball is hit for a boundary.",
        "start_time": "0:42:40",
        "end_time": "0:42:50"
    },
    {
        "message": "The bowler is celebrating his wicket. The crowd is cheering. The score is 60-2 after 7 overs. The current run rate is 8.57. 8 fours and 0 sixes have been hit.",
        "start_time": "0:42:50",
        "end_time": "0:43:00"
    },
    {
        "message": "The camera pans over the stadium. The crowd is cheering. The score is 60-2 after 7 overs.",
        "start_time": "0:43:00",
        "end_time": "0:43:10"
    },
    {
        "message": "The batsman is on 74 runs and the bowler is bowling the 7th over of the match. The score is 60 for 2 and the current run rate is 8.57. The batsman hits a sixer, the ball goes over the boundary, the crowd is cheering.",
        "start_time": "0:43:10",
        "end_time": "0:43:20"
    },
    {
        "message": "The batsman is on 80 runs, the bowler is bowling the 7th over. The score is 66 for 2, and the current run rate is 8.80. The batsman is playing some good shots. The crowd is cheering.",
        "start_time": "0:43:20",
        "end_time": "0:43:30"
    }
]